Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

# continue_with_do
source: Continue with Digital Ocean
ar: المتابعة مع Digital Ocean
bn: DigitalOcean দিয়ে চালিয়ে যান
es_cu: Continuar con Digital Ocean
fa: ادامه با Digital Ocean
hi: Digital Ocean के साथ जारी रखें
ms: Teruskan dengan Digital Ocean
my: Digital Ocean နှင့် ဆက်လုပ်ပါ
ps: د DigitalOcean سره دوام ورکړئ
ru: Продолжить с Digital Ocean
th: ดำเนินการต่อด้วย Digital Ocean
tk: Digital Ocean bilen dowam et
tr: Digital Ocean ile Devam Et
vi: Tiếp tục với DigitalOcean
zh_cn: 使用 Digital Ocean 继续
zh_hk: 使用 DigitalOcean 繼續

# do_allows
source: Digital Ocean allows you to pick one server location from the %d options below
ar: يتيح لك Digital Ocean اختيار موقع خادم واحد من بين %d خيارات أدناه
bn: DigitalOcean আপনাকে নিচের %d অপশন থেকে একটি সার্ভার লোকেশন বেছে নিতে দেয়
es_cu: Digital Ocean te permite elegir una ubicación de servidor entre las %d opciones a continuación
fa: Digital Ocean به شما امکان می‌دهد یک مکان سرور را از %d گزینه زیر انتخاب کنید
hi: Digital Ocean आपको नीचे दिए गए %d विकल्पों में से एक सर्वर स्थान चुनने की अनुमति देता है
ms: Digital Ocean membolehkan anda memilih satu lokasi pelayan daripada %d pilihan di bawah
my: Digital Ocean သည် အောက်ပါ ရွေးချယ်စရာ %d မှ ဆာဗာတည်နေရာတစ်ခုကို ရွေးချယ်ရန် ခွင့်ပြုသည်
ps: DigitalOcean تاسو ته اجازه درکوي چې د لاندې %d اختیارونو څخه یو د سرور موقعیت غوره کړئ
ru: Digital Ocean позволяет выбрать одно расположение сервера из %d доступных вариантов ниже
th: Digital Ocean ให้คุณเลือกตำแหน่งเซิร์ฟเวอร์หนึ่งตำแหน่งจาก %d ตัวเลือกด้านล่าง
tk: Digital Ocean aşakdaky %d wariantdan bir serwer ýerleşişini saýlamaga mümkinçilik berýär
tr: Digital Ocean, aşağıdaki %d seçenekten bir sunucu konumu seçmenize olanak tanır
vi: DigitalOcean cho phép bạn chọn một vị trí máy chủ từ %d tùy chọn dưới đây.
zh_cn: Digital Ocean 允许您从以下 %d 个选项中选择一个服务器位置
zh_hk: DigitalOcean 讓你從以下 %d 個選項中選擇一個伺服器位置

# server_setup_gcp_price
source: Only %s month through GCP
ar: فقط %s شهريًا عبر GCP
bn: GCP এর মাধ্যমে মাত্র %s মাস
es_cu: Solo %s al mes a través de GCP
fa: فقط %s در ماه از طریق GCP
hi: GCP के माध्यम से केवल %s महीना
ms: Hanya %s sebulan melalui GCP
my: GCP မှတဆင့် တစ်လ %s သာ
ps: یوازې د GCP له لارې میاشتې %s
ru: Только %s в месяц через GCP
th: เพียง %s ต่อเดือนผ่าน GCP
tk: GCP arkaly diňe %s aýda
tr: GCP üzerinden ayda sadece %s
vi: Chỉ %s/tháng thông qua GCP
zh_cn: 通过 GCP 每月仅需 %s
zh_hk: 透過 GCP 每月只需 %s

# continue_with_gcp
source: Continue with Google
ar: المتابعة مع Google
bn: Google দিয়ে চালিয়ে যান
es_cu: Continuar con Google
fa: ادامه با گوگل
hi: Google के साथ जारी रखें
ms: Teruskan dengan Google
my: Google နှင့် ဆက်လုပ်ပါ
ps: د Google سره دوام ورکړئ
ru: Продолжить с Google
th: ดำเนินการต่อด้วย Google
tk: Google bilen dowam et
tr: Google ile Devam Et
vi: Tiếp tục với Google
zh_cn: 使用 Google 继续
zh_hk: 使用 Google 繼續

# gcp_allows
source: Google Cloud Platform allows you to pick one server location from the %d options below:
ar: تتيح لك Google Cloud Platform اختيار موقع خادم واحد من بين %d خيارات أدناه:
bn: Google Cloud Platform আপনাকে নিচের %d অপশন থেকে একটি সার্ভার লোকেশন বেছে নিতে দেয়:
es_cu: Google Cloud Platform te permite elegir una ubicación de servidor entre las %d opciones a continuación:
fa: Google Cloud Platform به شما امکان می‌دهد یک مکان سرور را از %d گزینه زیر انتخاب کنید:
hi: Google Cloud Platform आपको नीचे दिए गए %d विकल्पों में से एक सर्वर स्थान चुनने की अनुमति देता है:
ms: Google Cloud Platform membolehkan anda memilih satu lokasi pelayan daripada %d pilihan di bawah:
my: Google Cloud Platform သည် အောက်ပါ ရွေးချယ်စရာ %d မှ ဆာဗာတည်နေရာတစ်ခုကို ရွေးချယ်ရန် ခွင့်ပြုသည်-
ps: Google Cloud Platform تاسو ته اجازه درکوي چې د لاندې %d اختیارونو څخه یو د سرور موقعیت غوره کړئ:
ru: Google Cloud Platform позволяет выбрать одно расположение сервера из %d доступных вариантов ниже:
th: Google Cloud Platform ให้คุณเลือกตำแหน่งเซิร์ฟเวอร์หนึ่งตำแหน่งจาก %d ตัวเลือกด้านล่าง:
tk: Google Cloud Platform aşakdaky %d wariantdan bir serwer ýerleşişini saýlamaga mümkinçilik berýär:
tr: Google Cloud Platform, aşağıdaki %d seçenekten bir sunucu konumu seçmenize olanak tanır:
vi: Google Cloud Platform cho phép bạn chọn một vị trí máy chủ từ %d tùy chọn dưới đây:
zh_cn: Google Cloud Platform 允许您从以下 %d 个选项中选择一个服务器位置:
zh_hk: Google Cloud Platform 讓你從以下 %d 個選項中選擇一個伺服器位置:

# server_setup_aws
source: Set up a private server on Digital Ocean
ar: إعداد خادم خاص على Digital Ocean
bn: AWS-এ একটি প্রাইভেট সার্ভার সেটআপ করুন
es_cu: Configurar usando Amazon Web Services
fa: راه‌اندازی سرور خصوصی در AWS
hi: Digital Ocean पर निजी सर्वर सेट अप करें
ms: Sediakan pelayan peribadi di Digital Ocean
my: Digital Ocean တွင် ကိုယ်ပိုင်ဆာဗာ စနစ်ထည့်ပါ
ps: په AWS کې یو شخصي سرور تنظیم کړئ
ru: Настроить через AWS
th: ตั้งค่าเซิร์ฟเวอร์ส่วนตัวบน AWS
tk: Digital Ocean-da hususy serwer guruň
tr: AWS'de özel sunucu kur
vi: Thiết lập máy chủ riêng trên AWS
zh_cn: 在 AWS 上设置私有服务器
zh_hk: 在 DigitalOcean 上設定私人伺服器

# server_setup_aws_price
source: Only %s month through AWS
ar: فقط %s شهريًا عبر AWS
bn: AWS এর মাধ্যমে মাত্র %s মাস
es_cu: Solo %s al mes a través de AWS
fa: فقط %s در ماه از طریق AWS
hi: AWS के माध्यम से केवल %s महीना
ms: Hanya %s sebulan melalui AWS
my: AWS မှတဆင့် တစ်လ %s သာ
ps: یوازې د AWS له لارې میاشتې %s
ru: Только %s в месяц через AWS
th: เพียง %s ต่อเดือนผ่าน AWS
tk: AWS arkaly diňe %s aýda
tr: AWS üzerinden ayda sadece %s
vi: Chỉ %s/tháng thông qua AWS
zh_cn: 通过 AWS 每月仅需 %s
zh_hk: 透過 AWS 每月只需 %s

# server_setup_manual
source: Set Up Manually
ar: الإعداد يدويًا
bn: ম্যানুয়ালি সেটআপ করুন
es_cu: Configurar Manualmente
fa: راه‌اندازی دستی
hi: मैन्युअल रूप से सेट अप करें
ms: Sediakan Secara Manual
my: လက်ဖြင့် စနစ်ထည့်ပါ
ps: په لاسي ډول تنظیم کړئ
ru: Настроить вручную
th: ตั้งค่าด้วยตนเอง
tk: El bilen gur
tr: Manuel Olarak Kur
vi: Thiết lập thủ công
zh_cn: 手动设置
zh_hk: 手動設定

# seamless_integration
source: Seamless integration with Lantern
ar: تكامل سلس مع Lantern
bn: Lantern এর সাথে নিরবচ্ছিন্ন ইন্টিগ্রেশন
es_cu: Integración perfecta con Lantern
fa: یکپارچگی یک‌دست با Lantern
hi: Lantern के साथ सहज एकीकरण
ms: Integrasi lancar dengan Lantern
my: Lantern နှင့် ချောမွေ့စွာ ပေါင်းစပ်ခြင်း
ps: د Lantern سره بې له خنډه ادغام
ru: Бесшовная интеграция с Lantern
th: รวมเข้ากับ Lantern ได้อย่างลงตัว
tk: Lantern bilen üznüksiz integrasiýa
tr: Lantern ile sorunsuz entegrasyon
vi: Tích hợp liền mạch với Lantern
zh_cn: 与蓝灯无缝集成
zh_hk: 與 Lantern 無縫整合

# easiest_setup
source: Easiest setup process
ar: أسهل عملية إعداد
bn: সবচেয়ে সহজ সেটআপ প্রক্রিয়া
es_cu: Proceso de configuración más fácil
fa: ساده‌ترین فرآیند راه‌اندازی
hi: सबसे आसान सेटअप प्रक्रिया
ms: Proses persediaan termudah
my: အလွယ်ဆုံး စနစ်ထည့်ခြင်း လုပ်ငန်းစဉ်
ps: ترټولو اسانه د تنظیم پروسه
ru: Самая простая настройка
th: กระบวนการตั้งค่าที่ง่ายที่สุด
tk: Iň aňsat gurnama prosesi
tr: En kolay kurulum süreci
vi: Quy trình thiết lập dễ nhất
zh_cn: 最简单的设置流程
zh_hk: 最簡單的設定流程

# multiple_location_options
source: Multiple server location options
ar: خيارات متعددة لمواقع الخوادم
bn: একাধিক সার্ভার লোকেশন অপশন
es_cu: Múltiples opciones de ubicación de servidor
fa: گزینه‌های متعدد برای مکان سرور
hi: कई सर्वर स्थान विकल्प
ms: Pelbagai pilihan lokasi pelayan
my: များစွာသော ဆာဗာတည်နေရာ ရွေးချယ်စရာများ
ps: د ډیرو سرور موقعیتونو اختیارونه
ru: Несколько вариантов расположения сервера
th: ตัวเลือกตำแหน่งเซิร์ฟเวอร์หลายตำแหน่ง
tk: Köp serwer ýerleşiş wariantlary
tr: Birden fazla sunucu konumu seçeneği
vi: Nhiều tùy chọn vị trí máy chủ
zh_cn: 多个服务器位置选项
zh_hk: 多個伺服器位置選項

# one_month_included
source: %d TB/month data included
ar: %d تيرابايت/شهر بيانات مضمنة
bn: %d TB/মাস ডেটা অন্তর্ভুক্ত
es_cu: %d TB/mes de datos incluidos
fa: %d ترابایت داده را در ماه شامل می‌شود
hi: %d TB/महीना डेटा शामिल
ms: %d TB/bulan data disertakan
my: %d TB/လ ဒေတာ ပါဝင်သည်
ps: %d TB/میاشتې ډیټا شامله ده
ru: %d ТБ/месяц трафика включено
th: รวมข้อมูล %d TB/เดือน
tk: %d TB/aý maglumat goşuldy
tr: Ayda %d TB veri dahil
vi: %d TB/tháng dữ liệu đi kèm
zh_cn: 包含 %d TB/月 数据
zh_hk: 包含每月 %d TB 數據

source: Set Up Private Server
ar: إعداد خادم خاص
bn: প্রাইভেট সার্ভার সেটআপ করুন
es_cu: Configurar Servidor Privado
fa: راه‌اندازی سرور خصوصی
hi: निजी सर्वर सेट अप करें
ms: Sediakan Pelayan Peribadi
my: ကိုယ်ပိုင်ဆာဗာ စနစ်ထည့်ပါ
ps: شخصي سرور تنظیم کړئ
ru: Настроить частный сервер
th: ตั้งค่าเซิร์ฟเวอร์ส่วนตัว
tk: Hususy serwer gur
tr: Özel Sunucu Kur
vi: Thiết lập máy chủ riêng
zh_cn: 设置私有服务器
zh_hk: 設定私人伺服器

source: Previous
ar: السابق
bn: পূর্ববর্তী
es_cu: Anterior
fa: قبلی
hi: पिछला
ms: Sebelumnya
my: ယခင်
ps: مخکنی
ru: Назад
th: ก่อนหน้า
tk: Öňki
tr: Önceki
vi: Quay lại
zh_cn: 上一步
zh_hk: 上一步

source: Next
ar: التالي
bn: পরবর্তী
es_cu: Siguiente
fa: بعدی
hi: अगला
ms: Seterusnya
my: နောက်တစ်ခု
ps: بل
ru: Далее
th: ถัดไป
tk: Indiki
tr: Sonraki
vi: Tiếp theo
zh_cn: 下一步
zh_hk: 下一步

source: Error
ar: خطأ
bn: ত্রুটি
fa: خطا
hi: त्रुटि
ms: Ralat
my: အမှားအယွင်း
ps: تېروتنه
ru: Ошибка
th: ข้อผิดพลาด
tk: Ýalňyşlyk
tr: Hata
vi: Lỗi
zh_cn: 错误
zh_hk: 錯誤

# signup_error_user_exists
source: It looks like something went wrong with the sign-up. Please try resetting your password, and if the issue continues, reach out to our support team
ar: يبدو أن هناك خطأ ما في التسجيل. يرجى محاولة إعادة تعيين كلمة المرور، وإذا استمرت المشكلة، تواصل مع فريق الدعم لدينا
bn: সাইন-আপে সমস্যা হয়েছে। পাসওয়ার্ড রিসেট করুন, প্রয়োজনে সাপোর্টের সাথে যোগাযোগ করুন।
es_cu: Parece que algo salió mal con el registro. Por favor, intenta restablecer tu contraseña, y si el problema persiste, comunícate con nuestro equipo de soporte.
fa: به نظر می‌رسد در نام‌نویسی مشکلی پیش آمده. لطفاً رمز عبور خود را بازنشانی کنید یا با پشتیبانی تماس بگیرید.
hi: ऐसा लगता है कि साइन-अप में कुछ गड़बड़ी हुई। कृपया अपना पासवर्ड रीसेट करने का प्रयास करें, और यदि समस्या जारी रहती है, तो हमारी सहायता टीम से संपर्क करें
ms: Nampaknya ada masalah dengan pendaftaran. Sila cuba set semula kata laluan anda, dan jika masalah berterusan, hubungi pasukan sokongan kami
my: စာရင်းသွင်းမှုနှင့် တစ်ခုခု မှားယွင်းနေသည်ဟု ထင်ပါသည်။ ကျေးဇူးပြု၍ သင့်စကားဝှက်ကို ပြန်လည်သတ်မှတ်ကြည့်ပါ၊ ပြဿနာ ဆက်ရှိနေလျှင်၊ ကျွန်ုပ်တို့၏ ပံ့ပိုးမှုအဖွဲ့ကို ဆက်သွယ်ပါ
ps: داسې بریښي چې د ګډون په وخت کې یو څه تېروتنه شوې وي. مهرباني وکړئ د خپل پټنوم بیا تنظیم کولو هڅه وکړئ، او که ستونزه دوام لري، زموږ د ملاتړ ټیم سره اړیکه ونیسئ
ru: Похоже, что-то пошло не так при регистрации. Попробуйте сбросить пароль, и если проблема не исчезнет, обратитесь в нашу службу поддержки
th: ดูเหมือนว่ามีบางอย่างผิดพลาดกับการสมัคร กรุณาลองรีเซ็ตรหัสผ่านของคุณ และหากปัญหายังคงอยู่ กรุณาติดต่อทีมสนับสนุนของเรา
tk: Hasaba ýazylmakda bir zat nädogry boldy. Parolyňyzy täzeden diklemäge synanyň we mesele dowam etse, goldaw toparymyz bilen habarlaşyň
tr: Kayıt sırasında bir sorun oluştu gibi görünüyor. Lütfen şifrenizi sıfırlamayı deneyin ve sorun devam ederse destek ekibimizle iletişime geçin
vi: Có vẻ như có lỗi xảy ra khi đăng ký. Vui lòng thử đặt lại mật khẩu và nếu vấn đề vẫn tiếp tục, hãy liên hệ nhóm hỗ trợ của chúng tôi
zh_cn: 注册时似乎出了问题。请尝试重置密码,如果问题仍然存在,请联系我们的支持团队
zh_hk: 註冊時似乎出現問題。請嘗試重設你的密碼,如果問題持續發生,請聯絡我們的支援團隊

# user_not_found
source: User not recognized. Please check your credentials and try again. If you continue to experience issues, please reach out to our support team for assistance.
ar: المستخدم غير معروف. يرجى التحقق من بيانات الاعتماد والمحاولة مرة أخرى. إذا استمرت المشاكل، يرجى التواصل مع فريق الدعم للحصول على المساعدة.
bn: ব্যবহারকারী চেনা যাচ্ছে না। আপনার লগইন তথ্য চেক করুন এবং আবার চেষ্টা করুন। সমস্যা অব্যাহত থাকলে, সহায়তার জন্য আমাদের সাপোর্ট টিমের সাথে যোগাযোগ করুন।
es_cu: Usuario no reconocido. Por favor, revisa tus credenciales e inténtalo de nuevo. Si continúas experimentando problemas, comunícate con nuestro equipo de soporte para obtener ayuda.
fa: کاربر شناسایی نشد. لطفاً اطلاعات ورودی را بررسی کرده و دوباره آزمایش کنید. اگر همچنان مشکل دارید، لطفاً برای کمک با تیم پشتیبانی ما تماس بگیرید.
hi: उपयोगकर्ता पहचाना नहीं गया। कृपया अपनी जानकारी जांचें और फिर से प्रयास करें। यदि आप समस्याओं का सामना करना जारी रखते हैं, तो कृपया सहायता के लिए हमारी सहायता टीम से संपर्क करें।
ms: Pengguna tidak dikenali. Sila semak kelayakan anda dan cuba lagi. Jika anda terus mengalami masalah, sila hubungi pasukan sokongan kami untuk bantuan.
my: အသုံးပြုသူကို အသိအမှတ်မပြုပါ။ ကျေးဇူးပြု၍ သင့် အထောက်အထားများကို စစ်ဆေးပြီး ထပ်စမ်းကြည့်ပါ။ ပြဿနာများ ဆက်လက်တွေ့ကြုံနေလျှင်၊ ကျေးဇူးပြု၍ အကူအညီအတွက် ကျွန်ုပ်တို့၏ ပံ့ပိုးမှုအဖွဲ့ကို ဆက်သွယ်ပါ။
ps: کارن ونه پیژندل شو. مهرباني وکړئ خپل اعتبارونه وګورئ او بیا هڅه وکړئ. که تاسو له ستونزو سره مخ یاست، مهرباني وکړئ د مرستې لپاره زموږ د ملاتړ ټیم سره اړیکه ونیسئ.
ru: Пользователь не найден. Проверьте свои данные и попробуйте снова. Если проблема продолжается, обратитесь в нашу службу поддержки.
th: ไม่พบผู้ใช้ กรุณาตรวจสอบข้อมูลรับรองของคุณและลองอีกครั้ง หากคุณยังคงประสบปัญหา กรุณาติดต่อทีมสนับสนุนของเราเพื่อขอความช่วยเหลือ
tk: Ulanyjy tanalmaýar. Maglumatlaryňyzy barlaň we täzeden synanyň. Meseler dowam etse, kömek üçin goldaw toparymyz bilen habarlaşyň.
tr: Kullanıcı tanınmadı. Lütfen kimlik bilgilerinizi kontrol edip tekrar deneyin. Sorun devam ederse, yardım için destek ekibimizle iletişime geçin.
vi: Không nhận diện được người dùng. Vui lòng kiểm tra thông tin đăng nhập và thử lại. Nếu bạn tiếp tục gặp vấn đề, vui lòng liên hệ nhóm hỗ trợ của chúng tôi để được trợ giúp.
zh_cn: 无法识别用户。请检查您的凭据并重试。如果您继续遇到问题,请联系我们的支持团队寻求帮助。
zh_hk: 無法識別使用者。請檢查你的憑證後重試。如果問題持續發生,請聯絡我們的支援團隊尋求協助。

# invalid_code
source: Incorrect code or it might have expired. Please try resending again
ar: رمز غير صحيح أو ربما انتهت صلاحيته. يرجى محاولة إعادة الإرسال مرة أخرى
bn: কোড ভুল বা মেয়াদ শেষ হয়ে গেছে। আবার পাঠানোর চেষ্টা করুন
es_cu: Código incorrecto o puede haber expirado. Por favor, intenta reenviar nuevamente
fa: کد نادرست یا احتمالا منقضی شده است. لطفاً دوباره بفرستید
hi: गलत कोड या यह समाप्त हो गया होगा। कृपया फिर से भेजने का प्रयास करें
ms: Kod salah atau mungkin telah tamat tempoh. Sila cuba hantar semula
my: မှားယွင်းသော ကုဒ် သို့မဟုတ် သက်တမ်းကုန်ဆုံးသွားနိုင်သည်။ ကျေးဇူးပြု၍ ထပ်မံပို့ကြည့်ပါ
ps: غلط کوډ یا شاید پای ته رسیدلی وي. مهرباني وکړئ د بیا لیږلو هڅه وکړئ
ru: Неверный код или срок действия истек. Попробуйте отправить повторно
th: รหัสไม่ถูกต้องหรืออาจหมดอายุแล้ว กรุณาลองส่งอีกครั้ง
tk: Nädogry kod ýa-da möhleti geçen bolmagy mümkin. Täzeden iberip görüň
tr: Yanlış kod veya süresi dolmuş olabilir. Lütfen tekrar göndermeyi deneyin
vi: Mã không đúng hoặc có thể đã hết hạn. Vui lòng thử gửi lại
zh_cn: 验证码错误或已过期。请尝试重新发送
zh_hk: 驗證碼錯誤或可能已過期。請嘗試重新傳送

# email_resend_message
source: Your new confirmation code has been sent
ar: تم إرسال رمز التأكيد الجديد الخاص بك
bn: আপনার নতুন নিশ্চিতকরণ কোড পাঠানো হয়েছে
es_cu: Tu nuevo código de confirmación ha sido enviado
fa: کد تأیید جدیدتان فرستاده شد
hi: आपका नया पुष्टिकरण कोड भेज दिया गया है
ms: Kod pengesahan baru anda telah dihantar
my: သင့် အတည်ပြုကုဒ်အသစ်ကို ပေးပို့ပြီးပါပြီ
ps: ستاسو نوی د تایید کوډ ولیږل شو
ru: Ваш новый код подтверждения отправлен
th: รหัสยืนยันใหม่ของคุณถูกส่งแล้ว
tk: Täze tassyklama kodyňyz iberildi
tr: Yeni onay kodunuz gönderildi
vi: Mã xác nhận mới của bạn đã được gửi
zh_cn: 您的新确认码已发送
zh_hk: 你的新確認碼已傳送

source: Password has been updated
ar: تم تحديث كلمة المرور
bn: পাসওয়ার্ড আপডেট করা হয়েছে
es_cu: La contraseña ha sido actualizada
fa: رمز عبور به‌روزرسانی شد
hi: पासवर्ड अपडेट हो गया है
ms: Kata laluan telah dikemas kini
my: စကားဝှက်ကို အပ်ဒိတ်လုပ်ပြီးပါပြီ
ps: پټنوم تازه شوی دی
ru: Пароль обновлен
th: อัปเดตรหัสผ่านแล้ว
tk: Parol täzelendi
tr: Şifre güncellendi
vi: Mật khẩu đã được cập nhật
zh_cn: 密码已更新
zh_hk: 密碼已更新

# password_has_been_updated_message
source: Your password has been reset successfully
ar: تمت إعادة تعيين كلمة المرور بنجاح
bn: আপনার পাসওয়ার্ড সফলভাবে রিসেট করা হয়েছে
es_cu: Tu contraseña ha sido restablecida exitosamente
fa: رمز عبور شما با موفقیت بازنشانی شد
hi: आपका पासवर्ड सफलतापूर्वक रीसेट हो गया है
ms: Kata laluan anda telah berjaya ditetapkan semula
my: သင့်စကားဝှက်ကို အောင်မြင်စွာ ပြန်လည်သတ်မှတ်ပြီးပါပြီ
ps: ستاسو پټنوم په بریالیتوب سره بیا تنظیم شوی دی
ru: Ваш пароль успешно сброшен
th: รีเซ็ตรหัสผ่านของคุณเรียบร้อยแล้ว
tk: Parolyňyz üstünlikli täzelendi
tr: Şifreniz başarıyla sıfırlandı
vi: Mật khẩu của bạn đã được đặt lại thành công
zh_cn: 您的密码已成功重置
zh_hk: 你的密碼已成功重設

source: Update Pro Account
ar: تحديث حساب برو
bn: প্রো অ্যাকাউন্ট আপডেট করুন
es_cu: Actualizar Cuenta Pro
fa: به‌روزرسانی حساب پرو
hi: प्रो अकाउंट अपडेट करें
ms: Kemas Kini Akaun Pro
my: Pro အကောင့် အပ်ဒိတ်လုပ်ပါ
ps: پرو حساب تازه کړئ
ru: Обновить аккаунт Про
th: อัปเดตบัญชี Pro
tk: Pro hasabyny täzele
tr: Pro Hesabı Güncelle
vi: Cập nhật tài khoản Pro
zh_cn: 更新专业版账户
zh_hk: 更新專業版帳號

# update_pro_account_message
source: To manage your account or sign in to another device, please add an email and password to your account first.
ar: لإدارة حسابك أو تسجيل الدخول على جهاز آخر، يرجى إضافة بريد إلكتروني وكلمة مرور لحسابك أولاً.
bn: আপনার অ্যাকাউন্ট পরিচালনা করতে বা অন্য ডিভাইসে সাইন ইন করতে, প্রথমে আপনার অ্যাকাউন্টে একটি ইমেইল এবং পাসওয়ার্ড যোগ করুন।
es_cu: Para gestionar tu cuenta o iniciar sesión en otro dispositivo, por favor agrega primero un email y contraseña a tu cuenta.
fa: برای مدیریت حساب خود یا ورود از دستگاه دیگر، لطفاً قبل از هر چیز یک ایمیل و رمز عبور به حساب خود بیفزایید.
hi: अपने अकाउंट को प्रबंधित करने या किसी अन्य डिवाइस में साइन इन करने के लिए, कृपया पहले अपने अकाउंट में एक ईमेल और पासवर्ड जोड़ें।
ms: Untuk mengurus akaun anda atau log masuk ke peranti lain, sila tambahkan e-mel dan kata laluan ke akaun anda terlebih dahulu.
my: သင့်အကောင့်ကို စီမံခန့်ခွဲရန် သို့မဟုတ် အခြားစက်ပစ္စည်းသို့ ဝင်ရောက်ရန်၊ ကျေးဇူးပြု၍ ပထမဦးစွာ သင့်အကောင့်သို့ အီးမေးလ်နှင့် စကားဝှက် ထည့်ပါ။
ps: د خپل حساب مدیریت یا بل وسیلې ته ننوتلو لپاره، مهرباني وکړئ لومړی خپل حساب ته بریښنالیک او پټنوم اضافه کړئ.
ru: Для управления аккаунтом или входа на другом устройстве сначала добавьте email и пароль к вашему аккаунту.
th: ในการจัดการบัญชีของคุณหรือลงชื่อเข้าใช้บนอุปกรณ์อื่น กรุณาเพิ่มอีเมลและรหัสผ่านให้กับบัญชีของคุณก่อน
tk: Hasabyňyzy dolandyrmak ýa-da başga enjamda girmek üçin ilki bilen hasabyňyza e-poçta we parol goşuň.
tr: Hesabınızı yönetmek veya başka bir cihazda oturum açmak için lütfen önce hesabınıza bir e-posta ve şifre ekleyin.
vi: Để quản lý tài khoản hoặc đăng nhập vào thiết bị khác, vui lòng thêm email và mật khẩu vào tài khoản của bạn trước.
zh_cn: 要管理您的账户或登录到其他设备,请先为您的账户添加电子邮箱和密码。
zh_hk: 若要管理你的帳號或登入其他裝置,請先為你的帳號新增電子郵件和密碼。

# subscription_cancelled
source: Your subscription has been cancelled.
ar: تم إلغاء اشتراكك.
bn: আপনার সাবস্ক্রিপশন বাতিল করা হয়েছে।
es_cu: Tu suscripción ha sido cancelada.
fa: اشتراک شما لغو شد.
hi: आपकी सब्सक्रिप्शन रद्द कर दी गई है।
ms: Langganan anda telah dibatalkan.
my: သင့် စာရင်းသွင်းမှုကို ပယ်ဖျက်ပြီးပါပြီ။
ps: ستاسو ګډون لغوه شوی دی.
ru: Ваша подписка отменена.
th: การสมัครสมาชิกของคุณถูกยกเลิกแล้ว
tk: Abunalygyňyz ýatyryldy.
tr: Aboneliğiniz iptal edildi.
vi: Gói đăng ký của bạn đã bị hủy.
zh_cn: 您的订阅已取消。
zh_hk: 你的訂閱已取消。

# subscription_updated
source: Your subscription has been updated.
ar: تم تحديث اشتراكك.
bn: আপনার সাবস্ক্রিপশন আপডেট করা হয়েছে।
es_cu: Tu suscripción ha sido actualizada.
fa: اشتراک شما به‌روزرسانی شد.
hi: आपकी सब्सक्रिप्शन अपडेट हो गई है।
ms: Langganan anda telah dikemas kini.
my: သင့် စာရင်းသွင်းမှုကို အပ်ဒိတ်လုပ်ပြီးပါပြီ။
ps: ستاسو ګډون تازه شوی دی.
ru: Ваша подписка обновлена.
th: การสมัครสมาชิกของคุณถูกอัปเดตแล้ว
tk: Abunalygyňyz täzelendi.
tr: Aboneliğiniz güncellendi.
vi: Gói đăng ký của bạn đã được cập nhật.
zh_cn: 您的订阅已更新。
zh_hk: 你的訂閱已更新。

# subscription_renewed
source: Your subscription has been renewed.
ar: تم تجديد اشتراكك.
bn: আপনার সাবস্ক্রিপশন পুনর্নবীকরণ করা হয়েছে।
es_cu: Tu suscripción ha sido renovada.
fa: اشتراک شما تمدید شد.
hi: आपकी सब्सक्रिप्शन नवीनीकृत हो गई है।
ms: Langganan anda telah diperbaharui.
my: သင့် စာရင်းသွင်းမှုကို အသစ်ပြန်လည်ပြုလုပ်ပြီးပါပြီ။
ps: ستاسو ګډون نوی شوی دی.
ru: Ваша подписка продлена.
th: การสมัครสมาชิกของคุณถูกต่ออายุแล้ว
tk: Abunalygyňyz täzelendi.
tr: Aboneliğiniz yenilendi.
vi: Gói đăng ký của bạn đã được gia hạn.
zh_cn: 您的订阅已续订。
zh_hk: 你的訂閱已續訂。

source: Got It
ar: فهمت
bn: বুঝেছি
es_cu: Entendido
fa: فهمیدم
hi: समझ गया
ms: Faham
my: နားလည်ပါပြီ
ps: پوه شوم
ru: Понятно
th: เข้าใจแล้ว
tk: Düşündim
tr: Anladım
vi: Đã hiểu
zh_cn: 知道了
zh_hk: 知道了

source: Server Location
ar: موقع الخادم
bn: সার্ভার লোকেশন
es_cu: Ubicación del servidor
fa: مکان سرور
hi: सर्वर स्थान
ms: Lokasi Pelayan
my: ဆာဗာ တည်နေရာ
ps: د سرور موقعیت
ru: Расположение сервера
th: ตำแหน่งเซิร์ฟเวอร์
tk: Serwer ýerleşişi
tr: Sunucu Konumu
vi: Vị trí máy chủ
zh_cn: 服务器位置
zh_hk: 伺服器位置

source: Choose
ar: اختر
bn: বেছে নিন
es_cu: Elegir
fa: انتخاب
hi: चुनें
ms: Pilih
my: ရွေးပါ
ps: غوره کړئ
ru: Выбрать
th: เลือก
tk: Saýla
tr: Seç
vi: Chọn
zh_cn: 选择
zh_hk: 選擇

source: Choose Your Account
ar: اختر حسابك
bn: আপনার অ্যাকাউন্ট বেছে নিন
es_cu: Elige tu Cuenta
fa: حساب خود را برگزینید
hi: अपना अकाउंट चुनें
ms: Pilih Akaun Anda
my: သင့်အကောင့်ကို ရွေးပါ
ps: خپل حساب غوره کړئ
ru: Выберите ваш аккаунт
th: เลือกบัญชีของคุณ
tk: Hasabyňyzy saýlaň
tr: Hesabını Seç
vi: Chọn tài khoản của bạn
zh_cn: 选择您的账户
zh_hk: 選擇你的帳號

source: Choose your project
ar: اختر مشروعك
bn: আপনার প্রজেক্ট বেছে নিন
es_cu: Elige tu proyecto
fa: پروژه خود را برگزینید
hi: अपना प्रोजेक्ट चुनें
ms: Pilih projek anda
my: သင့်ပရောဂျက်ကို ရွေးပါ
ps: خپله پروژه غوره کړئ
ru: Выберите ваш проект
th: เลือกโปรเจกต์ของคุณ
tk: Taslamaňyzy saýlaň
tr: Projeni seç
vi: Chọn dự án của bạn
zh_cn: 选择您的项目
zh_hk: 選擇你的專案

source: Name your Google Cloud Project
ar: اسم مشروع Google Cloud الخاص بك
bn: আপনার Google Cloud প্রজেক্টের নাম দিন
es_cu: Nombra tu Proyecto de Google Cloud
fa: پروژه Google Cloud خود را نام‌گذاری کنید
hi: अपने Google Cloud प्रोजेक्ट का नाम दें
ms: Namakan Projek Google Cloud anda
my: သင့် Google Cloud ပရောဂျက်ကို အမည်ပေးပါ
ps: د خپل Google Cloud پروژې نوم ورکړئ
ru: Назовите ваш проект Google Cloud
th: ตั้งชื่อโปรเจกต์ Google Cloud ของคุณ
tk: Google Cloud taslamaňyza at beriň
tr: Google Cloud Projene isim ver
vi: Đặt tên cho dự án Google Cloud của bạn
zh_cn: 为您的 Google Cloud 项目命名
zh_hk: 為你的 Google Cloud 專案命名

source: Billing Account
ar: حساب الفوترة
bn: বিলিং অ্যাকাউন্ট
es_cu: Cuenta de Facturación
fa: حساب صورت‌حساب
hi: बिलिंग अकाउंट
ms: Akaun Bil
my: ငွေတောင်းခံမှု အကောင့်
ps: د بیل حساب
ru: Платежный аккаунт
th: บัญชีการเรียกเก็บเงิน
tk: Hasap hesaby
tr: Fatura Hesabı
vi: Tài khoản thanh toán
zh_cn: 账单账户
zh_hk: 帳單帳號

# billing_account_placeholder
source: Billing account for %s
ar: حساب فوترة لـ %s
bn: %s এর জন্য বিলিং অ্যাকাউন্ট
es_cu: Cuenta de facturación para %s
fa: حساب صورت‌حساب برای %s
hi: %s के लिए बिलिंग अकाउंट
ms: Akaun bil untuk %s
my: %s အတွက် ငွေတောင်းခံမှု အကောင့်
ps: د %s لپاره د بیل حساب
ru: Платежный аккаунт для %s
th: บัญชีการเรียกเก็บเงินสำหรับ %s
tk: %s üçin hasap hesaby
tr: %s için fatura hesabı
vi: Tài khoản thanh toán cho %s
zh_cn: %s 的账单账户
zh_hk: %s 的帳單帳號

source: Server Name
ar: اسم الخادم
bn: সার্ভারের নাম
es_cu: Nombre del Servidor
fa: نام سرور
hi: सर्वर नाम
ms: Nama Pelayan
my: ဆာဗာ အမည်
ps: د سرور نوم
ru: Имя сервера
th: ชื่อเซิร์ฟเวอร์
tk: Serwer ady
tr: Sunucu Adı
vi: Tên máy chủ
zh_cn: 服务器名称
zh_hk: 伺服器名稱

source: Google Project
ar: مشروع Google
bn: Google প্রজেক্ট
es_cu: Proyecto de Google
fa: پروژه گوگل
hi: Google प्रोजेक्ट
ms: Projek Google
my: Google ပရောဂျက်
ps: د Google پروژه
ru: Проект Google
th: โปรเจกต์ Google
tk: Google taslama
tr: Google Projesi
vi: Dự án Google
zh_cn: Google 项目
zh_hk: Google 專案

# field_name_required
source: Name required
ar: الاسم مطلوب
bn: নাম প্রয়োজন
es_cu: Nombre requerido
fa: نام الزامی است
hi: नाम आवश्यक है
ms: Nama diperlukan
my: အမည် လိုအပ်သည်
ps: نوم اړین دی
ru: Требуется имя
th: จำเป็นต้องมีชื่อ
tk: At zerur
tr: İsim gerekli
vi: Yêu cầu nhập tên
zh_cn: 需要填写名称
zh_hk: 需要名稱
