Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

source: Continue with Google
ar: المتابعة باستخدام Google
bn: Google দিয়ে চালিয়ে যান
es_cu: Continuar con Google
fa: ادامه با گوگل
hi: Google के साथ जारी रखें
ms: Teruskan dengan Google
my: Google ဖြင့် ဆက်လုပ်ပါ
ps: د Google سره دوام ورکړئ
ru: Продолжить с Google
th: ดำเนินการต่อด้วย Google
tk: Google bilen dowam et
tr: Google ile Devam Et
vi: Tiếp tục với Google
zh_cn: 使用 Google 继续
zh_hk: 使用 Google 繼續

source: Continue with Apple
ar: المتابعة باستخدام Apple
bn: Apple দিয়ে চালিয়ে যান
es_cu: Continuar con Apple
fa: ادامه با اپل
hi: Apple के साथ जारी रखें
ms: Teruskan dengan Apple
my: Apple ဖြင့် ဆက်လုပ်ပါ
ps: د Apple سره دوام ورکړئ
ru: Продолжить с Apple
th: ดำเนินการต่อด้วย Apple
tk: Apple bilen dowam et
tr: Apple ile Devam Et
vi: Tiếp tục với Apple
zh_cn: 使用 Apple 继续
zh_hk: 使用 Apple 繼續

source: Continue without Email
ar: المتابعة بدون بريد إلكتروني
bn: ইমেইল ছাড়াই চালিয়ে যান
es_cu: Continuar sin Email
fa: ادامه بدون ایمیل
hi: ईमेल के बिना जारी रखें
ms: Teruskan tanpa E-mel
my: အီးမေးလ်မပါဘဲ ဆက်ပါ
ps: پرته له بریښنالیک دوام ورکړئ
ru: Продолжить без email
th: ดำเนินการต่อโดยไม่ใช้อีเมล
tk: E-poçtasyz dowam et
tr: E-posta Olmadan Devam Et
vi: Tiếp tục mà không cần email
zh_cn: 不使用电子邮箱继续
zh_hk: 不使用電子郵件繼續

source: Confirm Email
ar: تأكيد البريد الإلكتروني
bn: ইমেইল নিশ্চিত করুন
es_cu: Correo de confirmación
fa: تأیید ایمیل
hi: ईमेल की पुष्टि करें
ms: Sahkan E-mel
my: အီးမေးလ် အတည်ပြုပါ
ps: بریښنالیک تایید کړئ
ru: Подтвердить email
th: ยืนยันอีเมล
tk: E-poçtany tassykla
tr: E-postayı Onayla
vi: Xác nhận email
zh_cn: 确认电子邮箱
zh_hk: 確認電子郵件

# add_your_email_message
source: Add your email to access your subscription on any device.
ar: أضف بريدك الإلكتروني للوصول إلى اشتراكك على أي جهاز.
bn: যেকোনো ডিভাইসে আপনার সাবস্ক্রিপশন অ্যাক্সেস করতে আপনার ইমেইল যোগ করুন।
es_cu: Agrega tu email para acceder a tu suscripción en cualquier dispositivo.
fa: ایمیل خود را اضافه کنید تا از هر دستگاهی به اشتراک خود دسترسی داشته باشید.
hi: किसी भी डिवाइस पर अपनी सब्सक्रिप्शन एक्सेस करने के लिए अपना ईमेल जोड़ें।
ms: Tambah e-mel anda untuk mengakses langganan anda pada mana-mana peranti.
my: မည်သည့်စက်ပစ္စည်းတွင်မဆို သင့် စာရင်းသွင်းမှုကို ဝင်ရောက်ရန် သင့်အီးမေးလ်ကို ထည့်ပါ။
ps: په هر وسیله کې د خپل ګډون لاسرسي لپاره خپل بریښنالیک اضافه کړئ.
ru: Добавьте ваш email, чтобы иметь доступ к вашей подписке на любом устройстве.
th: เพิ่มอีเมลของคุณเพื่อเข้าถึงการสมัครสมาชิกบนอุปกรณ์ใดก็ได้
tk: Islendik enjamda abunalygyňyz elýeterli bolmagy üçin e-poçtaňyzy goşuň.
tr: Aboneliğinize herhangi bir cihazdan erişmek için e-postanızı ekleyin.
vi: Thêm email để truy cập gói đăng ký trên bất kỳ thiết bị nào.
zh_cn: 添加您的电子邮箱以在任何设备上访问您的订阅。
zh_hk: 新增你的電子郵件以在任何裝置上存取你的訂閱。

# confirm_email_code
source: Confirmation Code
ar: رمز التأكيد
bn: নিশ্চিতকরণ কোড
es_cu: Código de Confirmación
fa: کد تأیید
hi: पुष्टिकरण कोड
ms: Kod Pengesahan
my: အတည်ပြုကုဒ်
ps: د تایید کوډ
ru: Код подтверждения
th: รหัสยืนยัน
tk: Tassyklama kody
tr: Onay Kodu
vi: Mã xác nhận
zh_cn: 确认码
zh_hk: 確認碼

# confirm_email_code_message
source: Confirm that this email address belongs to you, enter the code sent to:
ar: أكِّد أن عنوان البريد الإلكتروني هذا يخصك، أدخل الرمز المرسل إلى:
bn: নিশ্চিত করুন যে এই ইমেইল ঠিকানাটি আপনার, যে কোড পাঠানো হয়েছে সেটি লিখুন:
es_cu: Confirma que esta dirección de correo electrónico es tuya ingresando el código enviado a:
fa: برای تأیید اینکه این آدرس ایمیل متعلق به شماست، کدی را که به آدرس زیر ارسال شده، وارد کنید:
hi: पुष्टि करें कि यह ईमेल पता आपका है, भेजे गए कोड को दर्ज करें:
ms: Sahkan bahawa alamat e-mel ini milik anda, masukkan kod yang dihantar ke:
my: ဒီအီးမေးလ်လိပ်စာသည် သင့်ပိုင် ဖြစ်ကြောင်း အတည်ပြုပါ၊ ပို့လိုက်သော ကုဒ်ကို ထည့်ပါ-
ps: تایید کړئ چې دا د بریښنالیک پته ستاسو ده، هغه کوډ دننه کړئ چې ولیږل شو:
ru: Подтвердите, что этот email принадлежит вам, введите код, отправленный на:
th: ยืนยันว่าที่อยู่อีเมลนี้เป็นของคุณ กรอกรหัสที่ส่งไปยง:
tk: Bu e-poçta salgysynyň size degişlidigini tassyklaň, iberilen kody giriziň:
tr: Bu e-posta adresinin size ait olduğunu onaylayın, şu adrese gönderilen kodu girin:
vi: Xác nhận địa chỉ email này thuộc về bạn bằng cách nhập mã được gửi đến:
zh_cn: 请确认此电子邮箱地址属于您,输入发送至以下地址的验证码:
zh_hk: 確認此電子郵件地址屬於你,請輸入傳送至以下地址的驗證碼:

source: Resend Email
ar: إعادة إرسال البريد الإلكتروني
bn: ইমেইল আবার পাঠান
es_cu: Reenviar Email
fa: ارسال دوباره ایمیل
hi: ईमेल फिर से भेजें
ms: Hantar Semula E-mel
my: အီးမေးလ် ပြန်ပို့ပါ
ps: بریښنالیک بیا واستوئ
ru: Отправить email повторно
th: ส่งอีเมลอีกครั้ง
tk: E-poçtany täzeden iber
tr: E-postayı Yeniden Gönder
vi: Gửi lại email
zh_cn: 重新发送邮件
zh_hk: 重新傳送電子郵件

source: Create Password
ar: إنشاء كلمة مرور
bn: পাসওয়ার্ড তৈরি করুন
es_cu: Crear contraseña
fa: ایجاد رمز عبور
hi: पासवर्ड बनाएं
ms: Cipta Kata Laluan
my: စကားဝှက် ဖန်တီးပါ
ps: پټنوم جوړ کړئ
ru: Создать пароль
th: สร้างรหัสผ่าน
tk: Parol dörediň
tr: Şifre Oluştur
vi: Tạo mật khẩu
zh_cn: 创建密码
zh_hk: 建立密碼

source: Sign In to Lantern Pro
ar: تسجيل الدخول إلى Lantern برو
bn: Lantern Pro তে সাইন ইন করুন
es_cu: Iniciar Sesión en Lantern Pro
fa: ورود به Lantern پرو
hi: Lantern प्रो में साइन इन करें
ms: Log Masuk ke Lantern Pro
my: Lantern Pro သို့ ဝင်ရောက်ပါ
ps: Lantern Pro ته ننوځئ
ru: Войти в Lantern Про
th: ลงชื่อเข้าใช้ Lantern Pro
tk: Lantern Pro içeri gir
tr: Lantern Pro'ya Giriş Yap
vi: Đăng nhập vào Lantern Pro
zh_cn: 登录蓝灯专业版
zh_hk: 登入 Lantern 專業版

source: Sign in with Email
ar: تسجيل الدخول بالبريد الإلكتروني
bn: ইমেইল দিয়ে সাইন ইন করুন
es_cu: Iniciar sesión con Email
fa: ورود با ایمیل
hi: ईमेल के साथ साइन इन करें
ms: Log masuk dengan E-mel
my: အီးမေးလ် ဖြင့် ဝင်ရောက်ပါ
ps: د بریښنالیک سره ننوځئ
ru: Войти через email
th: ลงชื่อเข้าใช้ด้วยอีเมล
tk: E-poçta bilen giriň
tr: E-posta ile Giriş Yap
vi: Đăng nhập bằng email
zh_cn: 使用电子邮箱登录
zh_hk: 使用電子郵件登入

source: Enter your Lantern Pro Account details.
ar: أدخل تفاصيل حساب Lantern برو الخاص بك.
bn: আপনার Lantern Pro অ্যাকাউন্টের বিস্তারিত তথ্য লিখুন।
es_cu: Ingresa los detalles de tu cuenta Lantern Pro.
fa: جزئیات حساب Lantern پرو خود را وارد کنید.
hi: अपने Lantern प्रो अकाउंट विवरण दर्ज करें।
ms: Masukkan butiran Akaun Lantern Pro anda.
my: သင့် Lantern Pro အကောင့် အသေးစိတ်များကို ထည့်ပါ။
ps: د خپل Lantern Pro حساب جزئیات دننه کړئ.
ru: Введите данные вашего Lantern Про аккаунта
th: กรอกรายละเอียดบัญชี Lantern Pro ของคุณ
tk: Lantern Pro hasap maglumatlaryňyzy giriziň.
tr: Lantern Pro Hesap bilgilerinizi girin.
vi: Nhập thông tin tài khoản Lantern Pro của bạn.
zh_cn: 输入您的蓝灯专业版账户详情。
zh_hk: 輸入你的 Lantern 專業版帳號資訊。

source: Email
ar: البريد الإلكتروني
bn: ইমেইল
es_cu: Correo electrónico
fa: ایمیل
hi: ईमेल
ms: E-mel
my: အီးမေးလ်
ps: بریښنالیک
th: อีเมล
tk: E-poçta
tr: E-posta
zh_cn: 电子邮箱
zh_hk: 電子郵件

source: Enter Password
ar: أدخل كلمة المرور
bn: পাসওয়ার্ড লিখুন
es_cu: Ingrese la Contraseña
fa: رمز عبور را وارد کنید
hi: पासवर्ड दर्ज करें
ms: Masukkan Kata Laluan
my: စကားဝှက် ထည့်ပါ
ps: پټنوم دننه کړئ
ru: Введите пароль
th: กรอกรหัสผ่าน
tk: Parol giriziň
tr: Şifre Girin
vi: Nhập mật khẩu
zh_cn: 输入密码
zh_hk: 輸入密碼

# forgot_password
source: Forgot your password?
ar: هل نسيت كلمة المرور؟
bn: পাসওয়ার্ড ভুলে গেছেন?
es_cu: ¿Olvidaste tu contraseña?
fa: رمز عبور خود را فراموش کرده‌اید؟
hi: अपना पासवर्ड भूल गए?
ms: Terlupa kata laluan anda?
my: သင့်စကားဝှက်ကို မေ့နေပါသလား?
ps: خپل پټنوم مو هیر کړی؟
ru: Забыли пароль?
th: ลืมรหัสผ่าน?
tk: Parolyňyzy ýatdan çykardyňyzmy?
tr: Şifrenizi mi unuttunuz?
vi: Quên mật khẩu?
zh_cn: 忘记密码?
zh_hk: 忘記密碼?

source: Reset Your Password
ar: إعادة تعيين كلمة المرور
bn: আপনার পাসওয়ার্ড রিসেট করুন
es_cu: Restablecer tu Contraseña
fa: بازنشانی رمز عبور
hi: अपना पासवर्ड रीसेट करें
ms: Set Semula Kata Laluan Anda
my: သင့်စကားဝှက်ကို ပြန်လည်သတ်မှတ်ပါ
ps: خپل پټنوم بیا تنظیم کړئ
ru: Сбросить пароль
th: รีเซ็ตรหัสผ่านของคุณ
tk: Parolyňyzy täzeden dikleň
tr: Şifrenizi Sıfırlayın
vi: Đặt lại mật khẩu
zh_cn: 重置您的密码
zh_hk: 重設你的密碼

source: Enter your Lantern Pro Account Email.
ar: أدخل البريد الإلكتروني لحساب Lantern برو الخاص بك.
bn: আপনার Lantern Pro অ্যাকাউন্টের ইমেইল লিখুন।
es_cu: Ingresa el email de tu cuenta Lantern Pro.
fa: ایمیل حساب Lantern پرو خود را وارد کنید.
hi: अपना Lantern प्रो अकाउंट ईमेल दर्ज करें।
ms: Masukkan E-mel Akaun Lantern Pro anda.
my: သင့် Lantern Pro အကောင့် အီးမေးလ်ကို ထည့်ပါ။
ps: د خپل Lantern Pro حساب بریښنالیک دننه کړئ.
ru: Введите email вашего Lantern Про аккаунта
th: กรอกอีเมลบัญชี Lantern Pro ของคุณ
tk: Lantern Pro hasap e-poçtaňyzy giriziň.
tr: Lantern Pro Hesap E-postanızı girin.
vi: Nhập email tài khoản Lantern Pro của bạn.
zh_cn: 输入您的蓝灯专业版账户电子邮箱。
zh_hk: 輸入你的 Lantern 專業版帳號電子郵件。

source: Reset Password
ar: إعادة تعيين كلمة المرور
bn: পাসওয়ার্ড রিসেট করুন
es_cu: Restablecer contraseña
fa: بازنشانی رمز عبور
hi: पासवर्ड रीसेट करें
ms: Set Semula Kata Laluan
my: စကားဝှက် ပြန်လည်သတ်မှတ်ပါ
ps: پټنوم بیا تنظیم کړئ
ru: Сбросить пароль
th: รีเซ็ตรหัสผ่าน
tk: Paroly täzele
tr: Şifreyi Sıfırla
vi: Đặt lại mật khẩu
zh_cn: 重置密码
zh_hk: 重設密碼

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة
bn: নতুন পাসওয়ার্ড নিশ্চিত করুন
es_cu: Confirmar nueva contraseña
fa: تأیید رمز عبور جدید
hi: नए पासवर्ड की पुष्टि करें
ms: Sahkan Kata Laluan Baru
my: စကားဝှက်အသစ် အတည်ပြုပါ
ps: نوی پټنوم تایید کړئ
ru: Подтвердите новый пароль
th: ยืนยันรหัสผ่านใหม่
tk: Täze paroly tassykla
tr: Yeni Şifreyi Onayla
vi: Xác nhận mật khẩu mới
zh_cn: 确认新密码
zh_hk: 確認新密碼

source: Create New Password
ar: إنشاء كلمة مرور جديدة
bn: নতুন পাসওয়ার্ড তৈরি করুন
es_cu: Crear Nueva Contraseña
fa: ایجاد رمز عبور جدید
hi: नया पासवर्ड बनाएं
ms: Cipta Kata Laluan Baru
my: စကားဝှက်အသစ် ဖန်တီးပါ
ps: نوی پټنوم جوړ کړئ
ru: Создать новый пароль
th: สร้างรหัสผ่านใหม่
tk: Täze parol dörediň
tr: Yeni Şifre Oluştur
vi: Tạo mật khẩu mới
zh_cn: 创建新密码
zh_hk: 建立新密碼

source: Confirm Password
ar: تأكيد كلمة المرور
bn: পাসওয়ার্ড নিশ্চিত করুন
es_cu: Confirmar contraseña
fa: تأیید رمز عبور
hi: पासवर्ड की पुष्टि करें
ms: Sahkan Kata Laluan
my: စကားဝှက် အတည်ပြုပါ
ps: پټنوم تایید کړئ
ru: Подтвердить пароль
th: ยืนยันรหัสผ่าน
tk: Paroly tassykla
tr: Şifreyi Onayla
vi: Xác nhận mật khẩu
zh_cn: 确认密码
zh_hk: 確認密碼

# confirm_password_required
source: Confirm Password is required
ar: تأكيد كلمة المرور مطلوب
bn: পাসওয়ার্ড নিশ্চিতকরণ প্রয়োজন
es_cu: Se requiere confirmar contraseña
fa: تأیید رمز عبور الزامی است
hi: पासवर्ड की पुष्टि आवश्यक है
ms: Pengesahan kata laluan diperlukan
my: စကားဝှက် အတည်ပြုရန် လိုအပ်သည်
ps: د پټنوم تایید اړین دی
ru: Необходимо подтвердить пароль
th: จำเป็นต้องยืนยันรหัสผ่าน
tk: Parol tassyklanmasy zerur
tr: Şifre onayı gerekli
vi: Yêu cầu xác nhận mật khẩu
zh_cn: 必须确认密码
zh_hk: 需要確認密碼

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين
bn: পাসওয়ার্ড মিলছে না
es_cu: Las contraseñas no coinciden
fa: رمزهای عبور مطابقت ندارند
hi: पासवर्ड मेल नहीं खाते
ms: Kata laluan tidak sepadan
my: စကားဝှက်များ မကိုက်ညီပါ
ps: پټنومونه سره سمون نلري
ru: Пароли не совпадают
th: รหัสผ่านไม่ตรงกัน
tk: Parollar gabat gelenok
tr: Şifreler eşleşmiyor
vi: Mật khẩu không khớp
zh_cn: 密码不匹配
zh_hk: 密碼不符

source: Activation Code
ar: رمز التفعيل
bn: অ্যাক্টিভেশন কোড
es_cu: Código de Activación
fa: کد فعال‌سازی
hi: एक्टिवेशन कोड
ms: Kod Pengaktifan
my: အသက်ဝင်စေမည့်ကုဒ်
ps: د فعالولو کوډ
ru: Код активации
th: รหัสเปิดใช้งาน
tk: Işjeňleşdiriş kody
tr: Aktivasyon Kodu
vi: Mã kích hoạt
zh_cn: 激活码
zh_hk: 啟用碼

source: Activate Lantern Pro
ar: تفعيل Lantern برو
bn: Lantern Pro সক্রিয় করুন
es_cu: Activar Lantern Pro
fa: فعال‌سازی Lantern پرو
hi: Lantern प्रो को सक्रिय करें
ms: Aktifkan Lantern Pro
my: Lantern Pro ကို အသက်ဝင်စေပါ
ps: Lantern Pro فعال کړئ
ru: Активировать Lantern Про
th: เปิดใช้งาน Lantern Pro
tk: Lantern Pro işjeňleşdir
tr: Lantern Pro'yu Etkinleştir
vi: Kích hoạt Lantern Pro
zh_cn: 激活蓝灯专业版
zh_hk: 啟用 Lantern 專業版

# invalid_email
source: Invalid email address
ar: عنوان بريد إلكتروني غير صالح
bn: অবৈধ ইমেইল ঠিকানা
es_cu: Correo electrónico no válido
fa: آدرس ایمیل نامعتبر
hi: अमान्य ईमेल पता
ms: Alamat e-mel tidak sah
my: မမှန်ကန်သော အီးမေးလ်လိပ်စာ
ps: ناسم بریښنالیک پته
ru: Неверный email адрес
th: ที่อยู่อีเมลไม่ถูกต้อง
tk: Nädogry e-poçta salgysy
tr: Geçersiz e-posta adresi
vi: Địa chỉ email không hợp lệ
zh_cn: 无效的电子邮箱地址
zh_hk: 無效的電子郵件地址

# purchase_already_owned
source: You already own this purchase, Try doing restore purchase
ar: لديك هذا الشراء بالفعل، جرّب استعادة الشراء
bn: আপনি ইতিমধ্যে এই ক্রয়ের মালিক, রিস্টোর পারচেজ করার চেষ্টা করুন
es_cu: Ya posees esta compra, intenta restaurar compra
fa: شما قبلاً این خرید را انجام داده‌اید، بازیابی خرید را بیازمایید
hi: आप पहले से ही इस खरीदारी के मालिक हैं, खरीदारी को रिस्टोर करने का प्रयास करें
ms: Anda sudah memiliki pembelian ini. Cuba pulihkan pembelian
my: သင်သည် ဒီဝယ်ယူမှုကို ပိုင်ဆိုင်ပြီးဖြစ်သည်၊ ဝယ်ယူမှု ပြန်လည်ရယူခြင်း လုပ်ကြည့်ပါ
ps: تاسو لا دمخه دا پیرود لرئ، د بیرته راګرځولو هڅه وکړئ
ru: Вы уже сделали эту покупку. Попробуйте восстановить покупку.
th: คุณเป็นเจ้าของการซื้อนี้อยู่แล้ว ลองคืนค่าการซื้อดู
tk: Siziň eýýäm bu satyn alşyňyz bar, Dikeltmegi synanyň
tr: Bu satın almaya zaten sahipsiniz, Satın almayı geri yüklemeyi deneyin
vi: Bạn đã sở hữu gói mua này, hãy thử khôi phục gói mua
zh_cn: 您已经拥有此购买,请尝试恢复购买
zh_hk: 你已經擁有此購買項目,請嘗試恢復購買

source: Stripe Payment
ar: الدفع عبر Stripe
bn: Stripe পেমেন্ট
es_cu: Pago con Stripe
fa: پرداخت Stripe
hi: Stripe भुगतान
ms: Pembayaran Stripe
my: Stripe ငွေပေးချေမှု
ps: د Stripe تادیه
ru: Оплата через Stripe
th: การชำระเงินผ่าน Stripe
tk: Stripe töleg
tr: Stripe Ödeme
vi: Thanh toán Stripe
zh_cn: Stripe 支付
zh_hk: Stripe 付款

# split_tunneling_description
source: Lantern intelligently routes internet traffic based on your location, ensuring secure access while keeping your connection fast by only using a VPN when necessary.
ar: يوجّه Lantern بذكاء حركة الإنترنت بناءً على موقعك، مما يضمن وصولاً آمنًا مع الحفاظ على سرعة اتصالك من خلال استخدام VPN فقط عند الضرورة.
bn: Lantern আপনার লোকেশনের উপর ভিত্তি করে বুদ্ধিমত্তার সাথে ইন্টারনেট ট্রাফিক রাউট করে, শুধুমাত্র প্রয়োজনে ভিপিএন ব্যবহার করে আপনার সংযোগ দ্রুত রেখে নিরাপদ অ্যাক্সেস নিশ্চিত করে।
es_cu: Lantern enruta inteligentemente el tráfico de internet según tu ubicación, asegurando acceso seguro mientras mantiene tu conexión rápida usando la VPN solo cuando es necesario.
fa: Lantern به طور هوشمندانه ترافیک اینترنت را بر اساس مکان شما مسیریابی و دسترسی امن را تضمین می‌کند. و فقط در صورت نیاز از VPN استفاده می‌کند تا اتصال شما پرسرعت باقی بماند.
hi: Lantern आपके स्थान के आधार पर इंटरनेट ट्रैफ़िक को स्मार्ट तरीके से रूट करता है, केवल आवश्यकता पड़ने पर VPN का उपयोग करके सुरक्षित एक्सेस सुनिश्चित करते हुए आपके कनेक्शन को तेज़ रखता है।
ms: Lantern menghalakan trafik internet secara pintar berdasarkan lokasi anda, memastikan akses selamat sambil mengekalkan sambungan pantas dengan hanya menggunakan VPN apabila perlu.
my: Lantern သည် သင့်တည်နေရာအပေါ် မူတည်၍ အင်တာနက် ဒေတာကို ဉာဏ်ရည်ထက်မြက်စွာ လမ်းညွှန်ပြီး လိုအပ်လျှင်သာ VPN အသုံးပြုပါသည်။
ps: Lantern په هوښیارۍ سره د ستاسو د موقعیت پر بنسټ د انټرنیټ ترافیک لار هواروي، خوندي لاسرسی یقیني کوي پداسې حال کې چې ستاسو اتصال ګړندی ساتي یوازې هغه وخت VPN کاروي چې اړینه وي.
ru: Lantern маршрутизирует интернет-трафик на основе вашего местоположения, обеспечивая безопасный доступ и сохраняя высокую скорость соединения, используя VPN только при необходимости.
th: Lantern จัดเส้นทางการรับส่งข้อมูลอินเทอร์เน็ตอย่างชาญฉลาดตามตำแหน่งของคุณ เพื่อให้มั่นใจในการเข้าถึงที่ปลอดภัยในขณะที่ทำให้การเชื่อมต่อของคุณยังคงรวดเร็ว โดยใช้ VPN เฉพาะเมื่อจำเป็นเท่านั้น
tk: Lantern internet traffigini ýagdaýyňyza esaslanyp akylly ugradýar, howpsuz girişi üpjün edýär we diňe zerur bolanda VPN ulanmak arkaly baglanyşygyňyzy çalt saklaýar.
tr: Lantern, konumunuza göre internet trafiğini akıllıca yönlendirir, yalnızca gerektiğinde VPN kullanarak güvenli erişimi sağlarken bağlantınızı hızlı tutar.
vi: Lantern định tuyến lưu lượng internet một cách thông minh dựa trên vị trí của bạn, đảm bảo truy cập an toàn đồng thời giữ kết nối nhanh chóng bằng cách chỉ sử dụng VPN khi cần thiết.
zh_cn: 蓝灯根据您的位置智能路由互联网流量,确保安全访问的同时,仅在必要时使用 VPN 来保持连接速度快。
zh_hk: Lantern 會根據你的位置智慧地路由網路流量,確保安全存取,同時僅在必要時使用 VPN 以保持連線速度。

source: Region-Specific Rules
ar: قواعد خاصة بالمنطقة
bn: অঞ্চল-নির্দিষ্ট নিয়ম
es_cu: Reglas Específicas por Región
fa: قوانین منطقه‌ای
hi: क्षेत्र-विशिष्ट नियम
ms: Peraturan Khusus Wilayah
my: ဒေသဆိုင်ရာ သီးခြား စည်းမျဉ်းများ
ps: د سیمې ځانګړي قواعد
ru: Правила для отдельных регионов
th: กฎเฉพาะภูมิภาค
tk: Sebit boýunça düzgünler
tr: Bölgeye Özel Kurallar
vi: Quy tắc theo khu vực
zh_cn: 地区特定规则
zh_hk: 區域專用規則

# location_based_rules
source: Lantern uses different routing rules depending on your location:
ar: يستخدم Lantern قواعد توجيه مختلفة اعتمادًا على موقعك:
bn: Lantern আপনার লোকেশনের উপর নির্ভর করে বিভিন্ন রাউটিং নিয়ম ব্যবহার করে:
es_cu: Lantern usa diferentes reglas de enrutamiento según tu ubicación:
fa: Lantern بسته به مکان شما از قوانین مسیریابی مختلفی استفاده می‌کند:
hi: Lantern आपके स्थान के आधार पर अलग-अलग रूटिंग नियम का उपयोग करता है:
ms: Lantern menggunakan peraturan penghalaan berbeza bergantung pada lokasi anda:
my: Lantern သည် သင့်တည်နေရာပေါ်မူတည်၍ မတူညီသော လမ်းညွှန်စည်းမျဉ်းများ အသုံးပြုသည်-
ps: Lantern د ستاسو د موقعیت پورې اړوند مختلف د لارې قواعد کاروي:
ru: Lantern использует различные правила маршрутизации трафика в зависимости от вашего местоположения:
th: Lantern ใช้กฎการจัดเส้นทางที่แตกต่างกันตามตำแหน่งของคุณ:
tk: Lantern ýagdaýyňyza görä dürli ugratma düzgünlerini ulanýar:
tr: Lantern, konumunuza bağlı olarak farklı yönlendirme kuralları kullanır:
vi: Lantern sử dụng các quy tắc định tuyến khác nhau tùy theo vị trí của bạn:
zh_cn: 蓝灯根据您的位置使用不同的路由规则:
zh_hk: Lantern 根據你的位置使用不同的路由規則:

# censored_regions
source: In censored regions:
ar: في المناطق الخاضعة للرقابة:
bn: সেন্সর করা অঞ্চলে:
es_cu: En regiones censuradas:
fa: در مناطق سانسورشده:
hi: सेंसर किए गए क्षेत्रों में:
ms: Di wilayah bertapisan:
my: ဆင်ဆာဖြတ်သော ဒေသများတွင်-
ps: په سانسور شوو سیمو کې:
ru: В регионах с цензурой:
th: ในภูมิภาคที่มีการเซ็นเซอร์:
tk: Senzurlanan sebitlerd:
tr: Sansürlü bölgelerde:
vi: Ở các khu vực bị kiểm duyệt:
zh_cn: 在受审查地区:
zh_hk: 在有審查的地區:

# blocked_sites_proxied
source: Blocked websites and apps (news, messaging, restricted services) are proxied.
ar: المواقع والتطبيقات المحظورة (الأخبار والمراسلة والخدمات المقيدة) تمر عبر البروكسي.
bn: ব্লক করা ওয়েবসাইট এবং অ্যাপস (নিউজ, মেসেজিং, সীমাবদ্ধ সেবা) প্রক্সি করা হয়।
es_cu: Los sitios web y aplicaciones bloqueados (noticias, mensajería, servicios restringidos) se enrutan mediante proxy.
fa: وب‌سایت‌ها و برنامه‌های مسدودشده (اخبار، پیام‌رسانی، خدمات محدودشده) از طریق پروکسی ارسال می‌شوند.
hi: ब्लॉक की गई वेबसाइटें और ऐप (समाचार, मैसेजिंग, प्रतिबंधित सेवाएं) प्रॉक्सी के माध्यम से जाती हैं।
ms: Laman web dan aplikasi yang disekat (berita, pemesejan, perkhidmatan terhad) diproksi.
my: ပိတ်ဆို့ထားသော ဝက်ဘ်ဆိုက်များနှင့် အက်ပ်များ (သတင်းများ၊ မက်ဆေ့ခ်ျ၊ ကန့်သတ်ထားသော ဝန်ဆောင်မှုများ) ကို ပရောက်ဆီလုပ်သည်။
ps: بند شوي ویب سایټونه او اپلیکیشنونه (خبرونه، پیغام رسول، محدود خدمتونه) پروکسي کیږي.
ru: Заблокированные сайты и приложения (новости, мессенджеры, ограниченные сервисы) проксируются.
th: เว็บไซต์และแอปที่ถูกบล็อก (ข่าว, แชท, บริการที่ถูกจำกัด) จะถูกส่งผ่านพร็อกซี
tk: Bloklanan web saýtlar we programmalar (habarlar, habarlaşma, çäklendirilen hyzmatlar) proksi arkaly geçirilýär.
tr: Engellenmiş web siteleri ve uygulamalar (haber, mesajlaşma, kısıtlı hizmetler) proxy üzerinden bağlanır.
vi: Các trang web và ứng dụng bị chặn (tin tức, nhắn tin, dịch vụ bị hạn chế) được định tuyến qua proxy.
zh_cn: 被屏蔽的网站和应用(新闻、消息、受限服务)将通过代理访问。
zh_hk: 被封鎖的網站和應用程式(新聞、通訊、受限服務)會經過代理。

# unblocked_sites_bypass
source: Most unblocked websites bypass the VPN for faster browsing.
ar: معظم المواقع غير المحظورة تتجاوز VPN للتصفح الأسرع.
bn: বেশিরভাগ আনব্লক করা ওয়েবসাইট দ্রুত ব্রাউজিংয়ের জন্য ভিপিএন বাইপাস করে।
es_cu: La mayoría de los sitios web no bloqueados omiten la VPN para una navegación más rápida.
fa: اکثر وب‌سایت‌های مسدودنشده برای مرور سریع‌تر VPN را دور می‌زنند.
hi: अधिकांश अनब्लॉक वेबसाइटें तेज़ ब्राउज़िंग के लिए VPN को बायपास करती हैं।
ms: Kebanyakan laman web tidak disekat melepasi VPN untuk pelayaran lebih pantas.
my: ပိတ်ဆို့မထားသော ဝက်ဘ်ဆိုက်များသည် ပိုမြန်စွာ ရှာဖွေနိုင်ရန် VPN ကို ကျော်သွားသည်။
ps: ډیری نه بند شوي ویب سایټونه د ګړندي براوزینګ لپاره VPN تیروي.
ru: Большинство незаблокированных сайтов обходят VPN для более быстрого просмотра.
th: เว็บไซต์ส่วนใหญ่ที่ไม่ถูกบล็อกจะข้าม VPN เพื่อการท่องเว็บที่รวดเร็วขึ้น
tk: Köp bloklanan däl web saýtlar has çalt görmek üçin VPN-den geçýär.
tr: Çoğu engellenmemiş web sitesi daha hızlı tarama için VPN'i atlar.
vi: Hầu hết các trang web không bị chặn sẽ bỏ qua VPN để duyệt web nhanh hơn.
zh_cn: 大多数未被屏蔽的网站将直连以加快浏览速度。
zh_hk: 大多數未被封鎖的網站會繞過 VPN 以加快瀏覽速度。

# uncensored_regions
source: In uncensored regions:
ar: في المناطق غير الخاضعة للرقابة:
bn: অ-সেন্সর করা অঞ্চলে:
es_cu: En regiones sin censura:
fa: در مناطق سانسورنشده:
hi: गैर-सेंसर किए गए क्षेत्रों में:
ms: Di wilayah tidak bertapisan:
my: ဆင်ဆာမဖြတ်သော ဒေသများတွင်-
ps: په سانسور نشوو سیمو کې:
ru: В регионах без цензуры:
th: ในภูมิภาคที่ไม่มีการเซ็นเซอร์:
tk: Senzurlama bolmadyk sebitlerd:
tr: Sansürsüz bölgelerde:
vi: Ở các khu vực không bị kiểm duyệt:
zh_cn: 在非审查地区:
zh_hk: 在無審查的地區:

# trusted_sites_bypass
source: Only trusted websites and services bypass the VPN by default.
ar: فقط المواقع والخدمات الموثوقة تتجاوز VPN بشكل افتراضي.
bn: শুধুমাত্র বিশ্বস্ত ওয়েবসাইট এবং সেবাগুলি ডিফল্টভাবে ভিপিএন বাইপাস করে।
es_cu: Solo los sitios web y servicios de confianza omiten la VPN por defecto.
fa: تنها وب‌سایت‌ها و خدمات مورد اعتماد به طور پیش‌فرض از VPN دور می‌زنند.
hi: केवल विश्वसनीय वेबसाइटें और सेवाएं डिफ़ॉल्ट रूप से VPN को बायपास करती हैं।
ms: Hanya laman web dan perkhidmatan dipercayai melepasi VPN secara lalai.
my: ယုံကြည်စိတ်ချရသော ဝက်ဘ်ဆိုက်များနှင့် ဝန်ဆောင်မှုများသာ မူလအတိုင်း VPN ကို ကျော်သွားသည်။
ps: یوازې باوري ویب سایټونه او خدمتونه په تلواله توګه VPN تیروي.
ru: Только доверенные сайты и сервисы обходят VPN по умолчанию.
th: เฉพาะเว็บไซต์และบริการที่เชื่อถือได้เท่านั้นที่จะข้าม VPN โดยค่าเริ่มต้น
tk: Diňe ygtybarly web saýtlar we hyzmatlar deslapky boýunça VPN-den geçýär.
tr: Yalnızca güvenilir web siteleri ve hizmetler varsayılan olarak VPN'i atlar.
vi: Chỉ các trang web và dịch vụ đáng tin cậy mới bỏ qua VPN theo mặc định.
zh_cn: 默认情况下,仅可信的网站和服务会直连。
zh_hk: 預設僅有可信任的網站和服務繞過 VPN。
