Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

source: Select Your Server Location
ar: اختر موقع خادمك
bn: আপনার সার্ভার লোকেশন নির্বাচন করুন
es_cu: Selecciona la ubicación de tu servidor
fa: مکان سرور خود را انتخاب کنید
hi: अपना सर्वर स्थान चुनें
ms: Pilih lokasi pelayan anda
my: သင့်ဆာဗာ တည်နေရာကို ရွေးချယ်ပါ
ps: د خپل سرور موقعیت غوره کړئ
ru: Выберите расположение вашего сервера
th: เลือกตำแหน่งเซิร์ฟเวอร์ของคุณ
tk: Serwer ýerleşişiňizi saýlaň
tr: Sunucu konumunu seçin
vi: Chọn vị trí máy chủ của bạn
zh_cn: 选择您的服务器位置
zh_hk: 選擇你的伺服器位置

source: Faster speeds & unlimited bandwidth
ar: سرعات أعلى ونطاق ترددي غير محدود
bn: দ্রুত গতি এবং আনলিমিটেড ব্যান্ডউইথ
es_cu: Velocidades más rápidas y ancho de banda ilimitado
fa: سرعت بیشتر و پهنای باند نامحدود
hi: तेज़ गति और असीमित बैंडविड्थ
ms: Kelajuan lebih pantas & lebar jalur tanpa had
my: ပိုမြန်သော အမြန်နှုန်းနှင့် ကန့်သတ်မရှိ bandwidth
ps: ګړندي سرعتونه او نامحدود بینډویتھ
ru: Более высокие скорости и безлимитный трафик
th: ความเร็วที่เร็วขึ้นและแบนด์วิดท์ไม่จำกัด
tk: Has çalt tizlik we çäksiz internet giňligi
tr: Daha hızlı hız ve sınırsız bant genişliği
vi: Tốc độ nhanh hơn & băng thông không giới hạn
zh_cn: 更快的速度和无限带宽
zh_hk: 更快速度與無限頻寬

# premium_servers_less_congestion
source: Premium servers with less congestion
ar: خوادم مميزة مع ازدحام أقل
bn: কম যানজট সহ প্রিমিয়াম সার্ভার
es_cu: Servidores premium con menos congestión
fa: سرورهای ممتاز با ازدحام کمتر
hi: कम भीड़भाड़ वाले प्रीमियम सर्वर
ms: Pelayan premium dengan kurang kesesakan
my: ပရီမီယံ ဆာဗာများ လူစည်ကားမှု နည်းသည်
ps: پریمیم سرورونه د لږ ګڼې ګوڼې سره
ru: Премиум-серверы с меньшей нагрузкой
th: เซิร์ฟเวอร์พรีเมียมที่แออัดน้อยกว่า
tk: Az dykyz premium serwerler
tr: Daha az yoğunluğa sahip premium sunucular
vi: Máy chủ cao cấp ít tắc nghẽn hơn
zh_cn: 高级服务器,拥堵更少
zh_hk: 高級伺服器,較少壅塞

# advanced_anti_censorship
source: Advanced Anti-Censorship Technology
ar: تقنية متقدمة لمكافحة الرقابة
bn: উন্নত অ্যান্টি-সেন্সরশিপ প্রযুক্তি
es_cu: Tecnología avanzada anti-censura
fa: فناوری پیشرفته ضدسانسور
hi: उन्नत एंटी-सेंसरशिप तकनीक
ms: Teknologi anti-penapisan canggih
my: အဆင့်မြင့် ဆင်ဆာ ဆန့်ကျင်ရေး နည်းပညာ
ps: پرمختللې د سانسور ضد ټیکنالوژي
ru: Продвинутая технология обхода цензуры
th: เทคโนโลยีต่อต้านการเซ็นเซอร์ขั้นสูง
tk: Öňdebaryjy anti-senzura tehnologiýasy
tr: Gelişmiş sansür önleme teknolojisi
vi: Công nghệ chống kiểm duyệt tiên tiến
zh_cn: 先进的反审查技术
zh_hk: 進階反審查技術

# connect_up_to_five_devices
source: Connect up to 5 devices
ar: اتصل بما يصل إلى 5 أجهزة
bn: সর্বোচ্চ ৫টি ডিভাইস সংযোগ করুন
es_cu: Conecta hasta 5 dispositivos
fa: اتصال تا ۵ دستگاه
hi: 5 डिवाइस तक कनेक्ट करें
ms: Sambungkan sehingga 5 peranti
my: စက်ပစ္စည်း 5 လုံးအထိ ချိတ်ဆက်ပါ
ps: تر 5 وسایلو پورې وصل کړئ
ru: Подключите до 5 устройств
th: เชื่อมต่อได้สูงสุด 5 อุปกรณ์
tk: 5 enjama çenli birikdiriň
tr: 5 cihaza kadar bağlayın
vi: Kết nối tối đa 5 thiết bị
zh_cn: 最多连接 5 台设备
zh_hk: 最多連接 5 台裝置

source: Built-in Ad Blocking
ar: حظر إعلانات مدمج
bn: বিল্ট-ইন বিজ্ঞাপন ব্লকিং
es_cu: Bloqueo de anuncios integrado
fa: مسدودسازی تبلیغات داخلی
hi: बिल्ट-इन विज्ञापन ब्लॉकिंग
ms: Penyekatan iklan terbina dalam
my: ပါဝင်သော ကြော်ငြာ ပိတ်ဆို့မှု
ps: جوړ شوی اعلان بندول
ru: Встроенная блокировка рекламы
th: การบล็อกโฆษณาในตัว
tk: Içerki reklama bloklaýyş
tr: Yerleşik reklam engelleme
vi: Chặn quảng cáo tích hợp sẵn
zh_cn: 内置广告屏蔽
zh_hk: 內建廣告封鎖

source: Get Lantern Pro
ar: احصل على Lantern برو
bn: Lantern Pro পান
es_cu: Consiga Lantern Pro
fa: دریافت Lantern پرو
hi: Lantern प्रो पाएं
ms: Dapatkan Lantern Pro
my: Lantern Pro ရယူပါ
ps: Lantern Pro ترلاسه کړئ
ru: Получить Lantern Про
th: รับ Lantern Pro
tk: Lantern Pro alyň
tr: Lantern Pro Edin
vi: Nhận Lantern Pro
zh_cn: 获取蓝灯专业版
zh_hk: 取得 Lantern 專業版

source: Connected to Private Server
ar: متصل بخادم خاص
bn: প্রাইভেট সার্ভারে সংযুক্ত
es_cu: Conectado a Servidor Privado
fa: به سرور خصوصی متصل شد
hi: निजी सर्वर से कनेक्टेड
ms: Disambungkan ke Pelayan Peribadi
my: ကိုယ်ပိုင်ဆာဗာသို့ ချိတ်ဆက်ထားသည်
ps: د شخصي سرور سره وصل شوی
ru: Подключено к частному серверу
th: เชื่อมต่อกับเซิร์ฟเวอร์ส่วนตัวแล้ว
tk: Hususy serwere birikdirildi
tr: Özel Sunucuya Bağlandı
vi: Đã kết nối với máy chủ riêng
zh_cn: 已连接到私有服务器
zh_hk: 已連線至私人伺服器

# server_already_selected
source: You are already connected to this server.
ar: أنت متصل بالفعل بهذا الخادم.
bn: আপনি ইতিমধ্যে এই সার্ভারে সংযুক্ত আছেন।
es_cu: Ya estás conectado a este servidor.
fa: همین حالا هم به این سرور متصلید.
hi: आप पहले से ही इस सर्वर से कनेक्ट हैं।
ms: Anda sudah disambungkan ke pelayan ini.
my: သင်သည် ဤဆာဗာကို ချိတ်ဆက်ထားပြီးဖြစ်သည်။
ps: تاسو لا دمخه له دې سرور سره وصل یاست.
ru: Вы уже подключены к этому серверу.
th: คุณเชื่อมต่อกับเซิร์ฟเวอร์นี้อยู่แล้ว
tk: Siz eýýäm bu serwere birikdirildiňiz.
tr: Bu sunucuya zaten bağlısınız.
vi: Bạn đã kết nối với máy chủ này rồi.
zh_cn: 您已经连接到此服务器。
zh_hk: 你已經連線至此伺服器。

source: Device Limit Reached
ar: تم الوصول إلى حد الأجهزة
bn: ডিভাইস সীমা পৌঁছেছে
es_cu: Límite de Dispositivos Alcanzado
fa: به محدودیت تعداد دستگاه رسیدید
hi: डिवाइस सीमा पहुंच गई
ms: Had Peranti Dicapai
my: စက်ပစ္စည်း ကန့်သတ်ချက် ရောက်ပြီ
ps: د وسیلې حد ته ورسیدلی
ru: Достигнут лимит устройств
th: ถึงจำนวนจำกัดของอุปกรณ์แล้ว
tk: Enjam çägi ýetildi
tr: Cihaz Limitine Ulaşıldı
vi: Đã đạt giới hạn thiết bị
zh_cn: 已达到设备数量上限
zh_hk: 已達裝置數量上限

# device_limit_reached_message
source: You’ve reached your 5-device limit. Please remove a device to continue.
ar: لقد وصلت إلى حد 5 أجهزة. يرجى إزالة جهاز للمتابعة.
bn: আপনি আপনার ৫-ডিভাইস সীমায় পৌঁছেছেন। চালিয়ে যেতে একটি ডিভাইস সরান।
es_cu: Has alcanzado tu límite de 5 dispositivos. Por favor elimina un dispositivo para continuar.
fa: شما به محدودیت ۵ دستگاه خود رسیده‌اید. لطفاً یک دستگاه را حذف کنید تا ادامه دهید.
hi: आप अपनी 5-डिवाइस सीमा तक पहुंच गए हैं। जारी रखने के लिए कृपया एक डिवाइस हटाएं।
ms: Anda telah mencapai had 5 peranti anda. Sila buang peranti untuk meneruskan.
my: သင်သည် 5-စက်ပစ္စည်း ကန့်သတ်ချက်ကို ရောက်ပြီးပါပြီ။ ဆက်လက်လုပ်ဆောင်ရန် စက်ပစ္စည်းတစ်ခုကို ဖယ်ရှားပါ။
ps: تاسو خپل د 5 وسایلو حد ته ورسیدلی یاست. د دوام لپاره مهرباني وکړئ یوه وسیله لرې کړئ.
ru: Вы достигли лимита в 5 устройств. Пожалуйста, удалите устройство, чтобы продолжить.
th: คุณมีอุปกรณ์ครบ 5 เครื่องแล้ว กรุณาลบเครื่องหนึ่งออกเพื่อดำเนินการต่อ
tk: 5 enjam çägiňize ýetdiňiz. Dowam etmek üçin enjam aýyryň.
tr: 5 cihaz limitinize ulaştınız. Devam etmek için lütfen bir cihazı kaldırın.
vi: Bạn đã đạt giới hạn 5 thiết bị. Vui lòng xóa một thiết bị để tiếp tục.
zh_cn: 您已达到 5 台设备的上限。请移除一台设备以继续。
zh_hk: 你已達到 5 台裝置的上限。請移除一台裝置以繼續。

source: Remove Device and Sign In
ar: إزالة جهاز وتسجيل الدخول
bn: ডিভাইস সরান এবং সাইন ইন করুন
es_cu: Eliminar Dispositivo e Iniciar Sesión
fa: حذف دستگاه و ورود
hi: डिवाइस हटाएं और साइन इन करें
ms: Buang Peranti dan Log Masuk
my: စက်ပစ္စည်းကို ဖယ်ရှားပြီး ဝင်ရောက်ပါ
ps: وسیله لرې کړئ او ننوځئ
ru: Удалить устройство и войти
th: ลบอุปกรณ์และลงชื่อเข้าใช้
tk: Enjam aýyr we gir
tr: Cihazı Kaldır ve Giriş Yap
vi: Xóa thiết bị và đăng nhập
zh_cn: 移除设备并登录
zh_hk: 移除裝置並登入

source: Cancel Sign In
ar: إلغاء تسجيل الدخول
bn: সাইন ইন বাতিল করুন
es_cu: Cancelar Inicio de Sesión
fa: لغو ورود
hi: साइन इन रद्द करें
ms: Batalkan Log Masuk
my: ဝင်ရောက်ခြင်းကို ပယ်ဖျက်ပါ
ps: ننوتل لغوه کړئ
ru: Отменить вход
th: ยกเลิกการลงชื่อเข้าใช้
tk: Girişi ýatyr
tr: Girişi İptal Et
vi: Hủy đăng nhập
zh_cn: 取消登录
zh_hk: 取消登入

source: Change Email
ar: تغيير البريد الإلكتروني
bn: ইমেইল পরিবর্তন করুন
es_cu: Cambiar Correo Electrónico
fa: تغییر ایمیل
hi: ईमेल बदलें
ms: Tukar E-mel
my: အီးမေးလ် ပြောင်းပါ
ps: بریښنالیک بدل کړئ
ru: Изменить email
th: เปลี่ยนอีเมล
tk: E-poçta üýtget
tr: E-posta Değiştir
vi: Đổi email
zh_cn: 更改电子邮箱
zh_hk: 變更電子郵件

# change_email_message
source: This will become your new login email. You’ll need to verify it before the change takes effect.
ar: سيصبح هذا بريدك الإلكتروني الجديد لتسجيل الدخول. ستحتاج إلى التحقق منه قبل أن يدخل التغيير حيز التنفيذ.
bn: এটি আপনার নতুন লগইন ইমেইল হবে। পরিবর্তন কার্যকর হওয়ার আগে আপনাকে এটি যাচাই করতে হবে।
es_cu: Este será tu nuevo email de inicio de sesión. Necesitarás verificarlo antes de que el cambio tenga efecto.
fa: این ایمیل ورودی جدید شما خواهد شد. برای اعمال تغییرات باید آن را تأیید کنید.
hi: यह आपका नया लॉगिन ईमेल बन जाएगा। परिवर्तन प्रभावी होने से पहले आपको इसे सत्यापित करना होगा।
ms: Ini akan menjadi e-mel log masuk baharu anda. Anda perlu mengesahkannya sebelum perubahan berkuat kuasa.
my: ဒါက သင့်အကောင့်ဝင်ရန် အီးမေးလ်အသစ် ဖြစ်လာမည်။ ပြောင်းလဲမှု အသက်ဝင်မီ သင် ၎င်းကို အတည်ပြုရန် လိုအပ်သည်။
ps: دا به ستاسو نوی د ننوتلو بریښنالیک شي. تاسو ته اړتیا ده چې د بدلون د اغیزمن کیدو مخکې یې تایید کړئ.
ru: Это станет вашим новым email для входа. Вам нужно будет подтвердить его, прежде чем изменение вступит в силу.
th: นี่จะเป็นอีเมลเข้าสู่ระบบใหม่ของคุณ คุณจะต้องยืนยันก่อนที่การเปลี่ยนแปลงจะมีผล
tk: Bu siziň täze giriş e-poçtaňyz bolar. Üýtgeşme güýje girmezden ozal tassyklamaly bolarňyz.
tr: Bu, yeni giriş e-postanız olacaktır. Değişiklik yürürlüğe girmeden önce doğrulamanız gerekecektir.
vi: Đây sẽ trở thành email đăng nhập mới của bạn. Bạn sẽ cần xác minh nó trước khi thay đổi có hiệu lực.
zh_cn: 这将成为您的新登录电子邮箱。您需要先验证它,更改才会生效。
zh_hk: 這將成為你的新登入電子郵件。你需要先驗證才能生效。

# enter_new_email
source: Enter your new Email
ar: أدخل بريدك الإلكتروني الجديد
bn: আপনার নতুন ইমেইল লিখুন
es_cu: Ingresa tu nuevo Email
fa: ایمیل جدید خود را وارد کنید
hi: अपना नया ईमेल दर्ज करें
ms: Masukkan E-mel baharu anda
my: သင့်အီးမေးလ်အသစ်ကို ထည့်ပါ
ps: خپل نوی بریښنالیک دننه کړئ
ru: Введите ваш новый email
th: กรอกอีเมลใหม่ของคุณ
tk: Täze e-poçtaňyzy giriziň
tr: Yeni e-postanı girin
vi: Nhập email mới của bạn
zh_cn: 输入您的新电子邮箱
zh_hk: 輸入你的新電子郵件

# confirm_password_to_continue
source: To continue, please confirm your password.
ar: للمتابعة، يرجى تأكيد كلمة المرور.
bn: চালিয়ে যেতে, অনুগ্রহ করে আপনার পাসওয়ার্ড নিশ্চিত করুন।
es_cu: Para continuar, por favor confirma tu contraseña.
fa: برای ادامه، لطفاً رمز عبور خود را تأیید کنید.
hi: जारी रखने के लिए, कृपया अपने पासवर्ड की पुष्टि करें।
ms: Untuk meneruskan, sila sahkan kata laluan anda.
my: ဆက်လုပ်ရန်၊ ကျေးဇူးပြု၍ သင့်စကားဝှက်ကို အတည်ပြုပါ။
ps: د دوام لپاره، مهرباني وکړئ خپل پټنوم تایید کړئ.
ru: Для продолжения подтвердите ваш пароль.
th: ในการดำเนินการต่อ กรุณายืนยันรหัสผ่านของคุณ
tk: Dowam etmek üçin parolyňyzy tassyklaň.
tr: Devam etmek için lütfen şifrenizi onaylayın.
vi: Để tiếp tục, vui lòng xác nhận mật khẩu của bạn.
zh_cn: 要继续,请确认您的密码。
zh_hk: 若要繼續,請確認你的密碼。

# email_updated
source: Your email has been updated.
ar: تم تحديث بريدك الإلكتروني.
bn: আপনার ইমেইল আপডেট করা হয়েছে।
es_cu: Tu email ha sido actualizado.
fa: ایمیل شما به‌روزرسانی شد.
hi: आपका ईमेल अपडेट हो गया है।
ms: E-mel anda telah dikemas kini.
my: သင့်အီးမေးလ်ကို အပ်ဒိတ်လုပ်ပြီးပါပြီ။
ps: ستاسو بریښنالیک تازه شوی دی.
ru: Ваш email обновлен.
th: อัปเดตอีเมลของคุณแล้ว
tk: E-poçtaňyz täzelendi.
tr: E-postanız güncellendi.
vi: Email của bạn đã được cập nhật.
zh_cn: 您的电子邮箱已更新。
zh_hk: 你的電子郵件已更新。

source: Enable Network extension.
ar: تفعيل امتداد الشبكة
bn: নেটওয়ার্ক এক্সটেনশন সক্ষম করুন
es_cu: Habilitar Extensión de Red
fa: فعال کردن افزونه شبکه
hi: नेटवर्क एक्सटेंशन सक्षम करें
ms: Dayakan Sambungan Rangkaian
my: ကွန်ရက် တိုးချဲ့မှု ဖွင့်ပါ
ps: د شبکې غزونه فعاله کړئ
ru: Включить сетевое расширение
th: เปิดใช้งานส่วนขยายเครือข่าย
tk: Tor giňeltmesini aç
tr: Ağ Uzantısını Etkinleştir
vi: Bật tiện ích mở rộng mạng
zh_cn: 启用网络扩展
zh_hk: 啟用網路擴充功能

# enable_network_extension_message
source: To use Lantern, we need to install a network extension for your Mac.
ar: لاستخدام Lantern، نحتاج إلى تثبيت امتداد شبكة لجهاز Mac الخاص بك.
bn: Lantern ব্যবহার করতে, আমাদের আপনার Mac এর জন্য একটি নেটওয়ার্ক এক্সটেনশন ইনস্টল করতে হবে।
es_cu: Para usar Lantern, necesitamos instalar una extensión de red para tu Mac.
fa: برای استفاده از Lantern، باید یک افزونه شبکه برای مک خود نصب کنیم.
hi: Lantern का उपयोग करने के लिए, हमें आपके Mac के लिए एक नेटवर्क एक्सटेंशन इंस्टॉल करना होगा।
ms: Untuk menggunakan Lantern, kami perlu memasang sambungan rangkaian untuk Mac anda.
my: Lantern ကို အသုံးပြုရန်၊ ကျွန်ုပ်တို့သည် သင့် Mac အတွက် ကွန်ရက် တိုးချဲ့မှုကို ထည့်သွင်းရန် လိုအပ်သည်။
ps: د Lantern د کارولو لپاره، موږ ته اړتیا ده چې ستاسو د Mac لپاره د شبکې غزونه نصب کړو.
ru: Для использования Lantern нам нужно установить сетевое расширение для вашего Mac.
th: ในการใช้ Lantern เราจำเป็นต้องติดตั้งส่วนขยายเครือข่ายสำหรับ Mac ของคุณ
tk: Lantern ulanmak üçin Mac üçin tor giňeltmesini gurmalydyrys.
tr: Lantern'i kullanmak için Mac'iniz için bir ağ uzantısı yüklememiz gerekiyor.
vi: Để sử dụng Lantern, chúng tôi cần cài đặt tiện ích mở rộng mạng cho Mac của bạn.
zh_cn: 要使用蓝灯,我们需要为您的 Mac 安装网络扩展。
zh_hk: 為使用 Lantern,我們需要為你的 Mac 安裝網路擴充功能。

source: Install Now
ar: التثبيت الآن
bn: এখনই ইনস্টল করুন
es_cu: Activar Extensión
fa: اکنون نصب کنید
hi: अभी इंस्टॉल करें
ms: Pasang Sekarang
my: ယခု ထည့်သွင်းပါ
ps: اوس نصب کړئ
ru: Установить сейчас
th: ติดตั้งเดี๋ยวนี้
tk: Häzir gur
tr: Şimdi Yükle
vi: Cài đặt ngay
zh_cn: 立即安装
zh_hk: 立即安裝

source: Learn More
ar: معرفة المزيد
bn: আরও জানুন
es_cu: Aprende más
fa: بیشتر بدانید
hi: अधिक जानें
ms: Ketahui Lebih Lanjut
my: နောက်ထပ် လေ့လာပါ
ps: نور زده کړئ
ru: Узнать больше
th: เรียนรู้เพิ่มเติม
tk: Has köp öwren
tr: Daha Fazla Bilgi
vi: Tìm hiểu thêm
zh_cn: 了解更多
zh_hk: 進一步了解

source: Network extension required
ar: مطلوب امتداد شبكة
bn: নেটওয়ার্ক এক্সটেনশন প্রয়োজন
es_cu: Extensión de red requerida
fa: افزونه شبکه مورد نیاز است
hi: नेटवर्क एक्सटेंशन आवश्यक है
ms: Sambungan rangkaian diperlukan
my: ကွန်ရက် တိုးချဲ့မှု လိုအပ်သည်
ps: د شبکې غزونه اړینه ده
ru: Требуется сетевое расширение
th: จำเป็นต้องมีส่วนขยายเครือข่าย
tk: Tor giňeltmesi zerur
tr: Ağ uzantısı gerekli
vi: Yêu cầu tiện ích mở rộng mạng
zh_cn: 需要网络扩展
zh_hk: 需要網路擴充功能

source: Click
ar: انقر
bn: ক্লিক করুন
es_cu: Haz clic
fa: کلیک کنید
hi: क्लिक करें
ms: Klik
my: နှိပ်ပါ
ps: کلیک وکړئ
ru: Нажмите
th: คลิก
tk: Basyň
tr: Tıkla
vi: Nhấn
zh_cn: 点击
zh_hk: 點擊

source: open system settings
ar: فتح إعدادات النظام
bn: সিস্টেম সেটিংস খুলুন
es_cu: Abrir Configuración del Sistema
fa: باز کردن تنظیمات سیستم
hi: सिस्टम सेटिंग्स खोलें
ms: Buka Tetapan Sistem
my: စနစ် ဆက်တင်များကို ဖွင့်ပါ
ps: د سیسټم تنظیمات خلاص کړئ
ru: Открыть системные настройки
th: เปิดการตั้งค่าระบบ
tk: Ulgam sazlamalaryny aç
tr: Sistem Ayarlarını Aç
vi: Mở cài đặt hệ thống
zh_cn: 打开系统设置
zh_hk: 開啟系統設定

source: When prompted
ar: عندما يُطلب منك ذلك.
bn: যখন অনুরোধ করা হয়।
es_cu: cuando se te solicite.
fa: هنگام درخواست.
hi: जब संकेत मिले।
ms: apabila diminta.
my: မေးမြန်းလျှင်။
ps: کله چې غوښتل شي.
ru: при появлении запроса.
th: เมื่อได้รับแจ้ง
tk: haýyş edilende.
tr: istendiğinde.
vi: khi được nhắc.
zh_cn: 在提示时。
zh_hk: 出現提示時。

# activate_extension
source: Activate Lantern extension.
ar: التثبيت الآن
bn: এক্সটেনশন সক্রিয় করুন
es_cu: Activar Extensión
fa: فعال‌سازی افزونه
hi: अभी इंस्टॉल करें
ms: Pasang Sekarang
my: ယခု ထည့်သွင်းပါ
ps: فعاله کړئ
ru: Активировать расширение
th: เปิดใช้งานส่วนขยาย
tk: Häzir gur
tr: Uzantıyı Etkinleştir
vi: Kích hoạt tiện ích mở rộng
zh_cn: 立即安装
zh_hk: 立即安裝

source: Email (optional)
ar: البريد الإلكتروني (اختياري)
bn: ইমেইল (ঐচ্ছিক)
es_cu: Email (opcional)
fa: ایمیل (اختیاری)
hi: ईमेल (वैकल्पिक)
ms: E-mel (pilihan)
my: အီးမေးလ် (ရွေးချယ်နိုင်သော)
ps: بریښنالیک (اختیاري)
ru: Email (необязательно)
th: อีเมล (ไม่บังคับ)
tk: E-poçta (meýletin)
tr: E-posta (isteğe bağlı)
vi: Email (tùy chọn)
zh_cn: 电子邮箱(可选)
zh_hk: 電子郵件(選填)

# please_enter_valid_email
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صالح
bn: অনুগ্রহ করে একটি বৈধ ইমেইল লিখুন
es_cu: Por favor ingresa un email válido
fa: لطفاً یک نشانی ایمیل معتبر وارد کنید
hi: कृपया एक वैध ईमेल दर्ज करें
ms: Sila masukkan e-mel yang sah
my: ကျေးဇူးပြု၍ မှန်ကန်သော အီးမေးလ် ထည့်ပါ
ps: مهرباني وکړئ معتبر بریښنالیک دننه کړئ
ru: Пожалуйста, введите действительный email
th: กรุณากรอกอีเมลที่ถูกต้อง
tk: Dogry e-poçta giriziň
tr: Lütfen geçerli bir e-posta girin
vi: Vui lòng nhập email hợp lệ
zh_cn: 请输入有效的电子邮箱
zh_hk: 請輸入有效的電子郵件

source: Please select an issue
ar: يرجى تحديد مشكلة
bn: অনুগ্রহ করে একটি সমস্যা নির্বাচন করুন
es_cu: Por favor, seleccione un problema
fa: لطفاً یک مشکل را انتخاب کنید
hi: कृपया एक समस्या चुनें
ms: Sila pilih masalah
my: ကျေးဇူးပြု၍ ပြဿနာတစ်ခု ရွေးပါ
ps: مهرباني وکړئ یوه ستونزه غوره کړئ
ru: Пожалуйста, выберите проблему
th: กรุณาเลือกปัญหา
tk: Mesele saýlaň
tr: Lütfen bir sorun seçin
vi: Vui lòng chọn một sự cố
zh_cn: 请选择问题类型
zh_hk: 請選擇一個問題

# please_enter_issue_description
source: Please enter an issue description
ar: يرجى إدخال وصف للمشكلة
bn: অনুগ্রহ করে সমস্যার বর্ণনা লিখুন
es_cu: Por favor ingresa una descripción del problema
fa: لطفاً توضیحات مشکل را وارد کنید
hi: कृपया समस्या का विवरण दर्ज करें
ms: Sila masukkan huraian masalah
my: ကျေးဇူးပြု၍ ပြဿနာ ဖော်ပြချက် ထည့်ပါ
ps: مهرباني وکړئ د ستونزې بیان دننه کړئ
ru: Пожалуйста, опишите проблему
th: กรุณากรอกคำอธิบายปัญหา
tk: Mesele düşündirişini giriziň
tr: Lütfen bir sorun açıklaması girin
vi: Vui lòng nhập mô tả sự cố
zh_cn: 请输入问题描述
zh_hk: 請輸入問題描述

# thanks_for_feedback
source: Thanks for your feedback!
ar: شكرًا لملاحظاتك!
bn: আপনার মতামতের জন্য ধন্যবাদ!
es_cu: ¡Gracias por tus comentarios!
fa: سپاس از بازخورد شما!
hi: आपके फीडबैक के लिए धन्यवाद!
ms: Terima kasih atas maklum balas anda!
my: သင့်အကြံပြုချက်အတွက် ကျေးဇူးတင်ပါသည်!
ps: ستاسو د نظر لپاره مننه!
ru: Спасибо за отзыв!
th: ขอบคุณสำหรับความคิดเห็นของคุณ!
tk: Pikirleriňiz üçin sag boluň!
tr: Geri bildiriminiz için teşekkürler!
vi: Cảm ơn phản hồi của bạn!
zh_cn: 感谢您的反馈!
zh_hk: 感謝你的回饋!

source: No apps selected
ar: لم يتم تحديد أي تطبيقات
bn: কোনো অ্যাপ নির্বাচন করা হয়নি
es_cu: No hay aplicaciones seleccionadas
fa: هیچ برنامه‌ای انتخاب نشده
hi: कोई ऐप चयनित नहीं
ms: Tiada aplikasi dipilih
my: အက်ပ်များ မရွေးထားပါ
ps: هیڅ اپلیکیشن غوره شوی نه دی
ru: Приложения не выбраны
th: ไม่ได้เลือกแอป
tk: Hiç bir programma saýlanmady
tr: Hiç uygulama seçilmedi
vi: Chưa chọn ứng dụng nào
zh_cn: 未选择应用
zh_hk: 未選擇應用程式

source: Deselect All
ar: إلغاء تحديد الكل
bn: সব বাতিল করুন
es_cu: Deseleccionar Todas
fa: لغو همه گزینه‌ها
hi: सभी को अचयनित करें
ms: Nyahpilih Semua
my: အားလုံး ဖယ်ထုတ်ပါ
ps: ټول غوره نه کړئ
ru: Снять все
th: ยกเลิกการเลือกทั้งหมด
tk: Hemmesini saýlama
tr: Tümünün Seçimini Kaldır
vi: Bỏ chọn tất cả
zh_cn: 取消全选
zh_hk: 取消全選

source: Select All
ar: تحديد الكل
bn: সব নির্বাচন করুন
es_cu: Seleccionar todo
fa: انتخاب همه
hi: सभी चुनें
ms: Pilih Semua
my: အားလုံး ရွေးပါ
ps: ټول غوره کړئ
ru: Выбрать все
th: เลือกทั้งหมด
tk: Hemmesini saýla
tr: Tümünü Seç
vi: Chọn tất cả
zh_cn: 全选
zh_hk: 全選

source: No websites selected
ar: لم يتم تحديد أي مواقع
bn: কোনো ওয়েবসাইট নির্বাচন করা হয়নি
es_cu: No hay sitios web seleccionados
fa: هیچ وب‌سایتی انتخاب نشده
hi: कोई वेबसाइट चयनित नहीं
ms: Tiada laman web dipilih
my: ဝက်ဘ်ဆိုက်များ မရွေးထားပါ
ps: هیڅ ویب سایټ غوره شوی نه دی
ru: Сайты не выбраны
th: ไม่ได้เลือกเว็บไซต์
tk: Hiç bir web saýt saýlanmady
tr: Hiç web sitesi seçilmedi
vi: Chưa chọn trang web nào
zh_cn: 未选择网站
zh_hk: 未選擇網站

# enter_activation_code
source: Enter an Activation Code
ar: أدخل رمز التفعيل
bn: একটি অ্যাক্টিভেশন কোড লিখুন
es_cu: Ingresa un Código de Activación
fa: کد فعال‌سازی را وارد کنید
hi: एक्टिवेशन कोड दर्ज करें
ms: Masukkan Kod Pengaktifan
my: အသက်ဝင်စေမည့်ကုဒ် ထည့်ပါ
ps: د فعالولو کوډ دننه کړئ
ru: Введите код активации
th: กรอกรหัสเปิดใช้งาน
tk: Işjeňleşdiriş kody giriziň
tr: Aktivasyon Kodu Girin
vi: Nhập mã kích hoạt
zh_cn: 输入激活码
zh_hk: 輸入啟用碼

source: Restore Purchase
ar: استعادة الشراء
bn: ক্রয় পুনরুদ্ধার করুন
es_cu: Restaurar Compra
fa: بازیابی خرید
hi: खरीदारी रिस्टोर करें
ms: Pulihkan Pembelian
my: ဝယ်ယူမှု ပြန်လည်ရယူပါ
ps: پیرود بیرته راګرځوئ
ru: Восстановить покупку
th: คืนค่าการซื้อ
tk: Satyn almagy dikelt
tr: Satın Almayı Geri Yükle
vi: Khôi phục gói mua
zh_cn: 恢复购买
zh_hk: 恢復購買

source: DO Private Server Setup
ar: إعداد خادم DO الخاص
bn: DO প্রাইভেট সার্ভার সেটআপ
es_cu: Configuración de Servidor Privado DO
fa: راه‌اندازی سرور خصوصی DO
hi: DO निजी सर्वर सेटअप
ms: Persediaan Pelayan Peribadi DO
my: DO ကိုယ်ပိုင်ဆာဗာ စနစ်ထည့်မှု
ps: د DO شخصي سرور تنظیم
ru: Настройка частного сервера DO
th: การตั้งค่าเซิร์ฟเวอร์ส่วนตัว DO
tk: DO hususy serwer gurnama
tr: DO Özel Sunucu Kurulumu
vi: Thiết lập máy chủ riêng DO
zh_cn: DO 私有服务器设置
zh_hk: DO 私人伺服器設定

# private_server_note
source: Select a region for your Private Server. Closer locations may improve speed and latency.
ar: اختر منطقة لخادمك الخاص. قد تؤدي المواقع الأقرب إلى تحسين السرعة وتقليل زمن الاستجابة.
bn: আপনার প্রাইভেট সার্ভারের জন্য একটি অঞ্চল নির্বাচন করুন। কাছাকাছি লোকেশন গতি এবং লেটেন্সি উন্নত করতে পারে।
es_cu: Selecciona una región para tu Servidor Privado. Ubicaciones más cercanas pueden mejorar la velocidad y latencia.
fa: یک منطقه برای سرور خصوصی خود انتخاب کنید. انتخاب نقاط نزدیک‌تر احتمالا در بهبودی سرعت و تأخیر مؤثرند.
hi: अपने निजी सर्वर के लिए एक क्षेत्र चुनें। करीबी स्थान गति और लेटेंसी में सुधार कर सकते हैं।
ms: Pilih wilayah untuk Pelayan Peribadi anda. Lokasi yang lebih dekat mungkin meningkatkan kelajuan dan kependaman.
my: သင့် ကိုယ်ပိုင်ဆာဗာ အတွက် ဒေသတစ်ခု ရွေးချယ်ပါ။ ပိုနီးသော တည်နေရာများက အမြန်နှုန်းနှင့် နှောင့်နှေးမှုကို တိုးတက်စေနိုင်သည်။
ps: د خپل شخصي سرور لپاره یوه سیمه غوره کړئ. نږدې موقعیتونه ممکن سرعت او وقفه ښه کړي.
ru: Выберите регион для вашего частного сервера. Более близкие расположения могут улучшить скорость и задержку.
th: เลือกภูมิภาคสำหรับเซิร์ฟเวอร์ส่วนตัวของคุณ ตำแหน่งที่ใกล้กว่าอาจช่วยปรับปรุงความเร็วและเวลาแฝง
tk: Hususy serweriňiz üçin sebiti saýlaň. Ýakyn ýerleşişler tizlik we gijikdirme gowulaşdyryp biler.
tr: Özel Sunucunuz için bir bölge seçin. Daha yakın konumlar hız ve gecikmeyi iyileştirebilir.
vi: Chọn khu vực cho máy chủ riêng của bạn. Vị trí gần hơn có thể cải thiện tốc độ và độ trễ.
zh_cn: 为您的私有服务器选择区域。距离较近的位置可能会提高速度并降低延迟。
zh_hk: 選擇私人伺服器的區域。較近的位置可能會提升速度並降低延遲。

source: GCP Private Server Setup
ar: إعداد خادم GCP الخاص
bn: GCP প্রাইভেট সার্ভার সেটআপ
es_cu: Configuración de Servidor Privado GCP
fa: راه‌اندازی سرور خصوصی GCP
hi: GCP निजी सर्वर सेटअप
ms: Persediaan Pelayan Peribadi GCP
my: GCP ကိုယ်ပိုင်ဆာဗာ စနစ်ထည့်မှု
ps: د GCP شخصي سرور تنظیم
ru: Настройка частного сервера GCP
th: การตั้งค่าเซิร์ฟเวอร์ส่วนตัว GCP
tk: GCP hususy serwer gurnama
tr: GCP Özel Sunucu Kurulumu
vi: Thiết lập máy chủ riêng GCP
zh_cn: GCP 私有服务器设置
zh_hk: GCP 私人伺服器設定

source: GCP Private Server Location
ar: موقع خادم GCP الخاص
bn: GCP প্রাইভেট সার্ভার লোকেশন
es_cu: Ubicación de Servidor Privado GCP
fa: مکان سرور خصوصی GCP
hi: GCP निजी सर्वर स्थान
ms: Lokasi Pelayan Peribadi GCP
my: GCP ကိုယ်ပိုင်ဆာဗာ တည်နေရာ
ps: د GCP شخصي سرور موقعیت
ru: Расположение частного сервера GCP
th: ตำแหน่งเซิร์ฟเวอร์ส่วนตัว GCP
tk: GCP hususy serwer ýerleşişi
tr: GCP Özel Sunucu Konumu
vi: Vị trí máy chủ riêng GCP
zh_cn: GCP 私有服务器位置
zh_hk: GCP 私人伺服器位置

source: DO Private Server Location
ar: موقع خادم DO الخاص
bn: DO প্রাইভেট সার্ভার লোকেশন
es_cu: Ubicación de Servidor Privado DO
fa: مکان سرور خصوصی DO
hi: DO निजी सर्वर स्थान
ms: Lokasi Pelayan Peribadi DO
my: DO ကိုယ်ပိုင်ဆာဗာ တည်နေရာ
ps: د DO شخصي سرور موقعیت
ru: Расположение частного сервера DO
th: ตำแหน่งเซิร์ฟเวอร์ส่วนตัว DO
tk: DO hususy serwer ýerleşişi
tr: DO Özel Sunucu Konumu
vi: Vị trí máy chủ riêng DO
zh_cn: DO 私有服务器位置
zh_hk: DO 私人伺服器位置

source: Confirm
ar: تأكيد
bn: নিশ্চিত করুন
es_cu: Confirmar
fa: تأیید
hi: पुष्टि करें
ms: Sahkan
my: အတည်ပြုပါ
ps: تایید کړئ
ru: Подтвердить
th: ยืนยัน
tk: Tassykla
tr: Onayla
vi: Xác nhận
zh_cn: 确认
zh_hk: 確認
