Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

# private_server_warning
source: Only add servers run by people you trust
ar: أضف فقط الخوادم التي يديرها أشخاص تثق بهم
bn: শুধুমাত্র যাদের আপনি বিশ্বাস করেন, তাদের পরিচালিত সার্ভার যোগ করুন
es_cu: Solo agrega servidores operados por personas en las que confíes
fa: فقط سرورهایی را بیفزایید که به دست افراد مورد اعتماد اداره می‌شوند
hi: केवल उन्हीं सर्वर को जोड़ें जो आप भरोसा करते हैं
ms: Hanya tambah pelayan yang dikendalikan oleh orang yang anda percayai
my: သင်ယုံကြည်သော လူများ လည်ပတ်သော ဆာဗာများကိုသာ ထည့်ပါ
ps: یوازې هغه سرورونه اضافه کړئ چې د باوري کسانو لخوا چلول کیږي
ru: Добавляйте только серверы, которыми управляют люди, которым вы доверяете
th: เพิ่มเฉพาะเซิร์ฟเวอร์ที่ดูแลโดยคนที่คุณไว้วางใจเท่านั้น
tk: Diňe ynanýan adamlar tarapyndan dolandyrylýan serwerleri goşuň
tr: Yalnızca güvendiğiniz kişiler tarafından çalıştırılan sunucuları ekleyin
vi: Chỉ thêm máy chủ do người bạn tin tưởng vận hành
zh_cn: 仅添加您信任的人运行的服务器
zh_hk: 僅新增你信任的人營運的伺服器

source: Go To Server Locations
ar: الانتقال إلى مواقع الخوادم
bn: সার্ভার লোকেশনে যান
es_cu: Ir a Ubicaciones de Servidor
fa: رفتن به مکان‌های سرور
hi: सर्वर स्थानों पर जाएं
ms: Pergi ke Lokasi Pelayan
my: ဆာဗာ တည်နေရာများသို့ သွားပါ
ps: د سرور موقعیتونو ته لاړ شئ
ru: Перейти к расположениям серверов
th: ไปที่ตำแหน่งเซิร์ฟเวอร์
tk: Serwer ýerleşişlerine git
tr: Sunucu Konumlarına Git
vi: Đi tới vị trí máy chủ
zh_cn: 前往服务器位置
zh_hk: 前往伺服器位置

source: Remove Server?
ar: إزالة الخادم
bn: সার্ভার সরান
es_cu: Eliminar Servidor
fa: حذف سرور
hi: सर्वर हटाएं
ms: Buang Pelayan
my: ဆာဗာ ဖယ်ရှားပါ
ps: سرور لرې کړئ
ru: Удалить сервер
th: ลบเซิร์ฟเวอร์
tk: Serwer aýyr
tr: Sunucuyu Kaldır
vi: Xóa máy chủ
zh_cn: 移除服务器
zh_hk: 移除伺服器

# app_name
source: Lantern
zh_cn: 蓝灯
