Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

source: Upgrade to Pro
ar: الترقية إلى برو
bn: প্রো-তে আপগ্রেড করুন
es_cu: Actualice a PRO
fa: ارتقا به نسخه پرو
hi: प्रो में अपग्रेड करें
ms: Naik Taraf ke Pro
my: Pro သို့ အဆင့်မြှင့်ရန်
ps: پرو ته لوړ کړئ
ru: Перейти на Про
th: อัปเกรดเป็น Pro
tk: Pro wersiýasyna geç
tr: Pro'ya Yükselt
vi: Nâng cấp lên Pro
zh_cn: 升级至专业版
zh_hk: 升級至專業版

source: Settings
ar: الإعدادات
bn: সেটিংস
es_cu: Configuración
fa: تنظیمات
hi: सेटिंग्स
ms: Tetapan
my: ဆက်တင်များ
ps: تنظیمات
ru: Настройки
th: การตั้งค่า
tk: Sazlamalar
tr: Ayarlar
vi: Cài đặt
zh_cn: 设置
zh_hk: 設定

source: Lantern Projects:
ar: مشاريع Lantern:
bn: Lantern প্রজেক্টস:
es_cu: Proyectos de Lantern:
fa: پروژه‌های Lantern:
hi: Lantern प्रोजेक्ट्स:
ms: Projek Lantern:
my: Lantern ပရောဂျက်များ
ps: د Lantern پروژې:
ru: Проекты Lantern:
th: โปรเจกต์ Lantern:
tk: Lantern taslamalary:
tr: Lantern Projeleri:
vi: Dự án Lantern:
zh_cn: 蓝灯项目:
zh_hk: Lantern 專案:

source: Invite Friends
ar: دعوة الأصدقاء
bn: বন্ধুদের আমন্ত্রণ জানান
es_cu: Invitar amigos
fa: دعوت از دوستان
hi: दोस्तों को आमंत्रित करें
ms: Jemput Rakan
my: သူငယ်ချင်းများ ဖိတ်ခေါ်ရန်
ps: ملګري راوبلئ
ru: Пригласить друзей
th: เชิญเพื่อน
tk: Dostlary çagyryň
tr: Arkadaşlarını Davet Et
vi: Mời bạn bè
zh_cn: 邀请好友
zh_hk: 邀請朋友

source: Your Referral Code
ar: رمز الإحالة الخاص بك
bn: আপনার রেফারেল কোড
es_cu: Su código de referencia
fa: کد معرف شما
hi: आपका रेफरल कोड
ms: Kod Rujukan Anda
my: သင့်ရဲ့ ရည်ညွှန်းကုဒ်
ps: ستاسو د راجع کولو کوډ
ru: Ваш реферальный код
th: รหัสแนะนำของคุณ
tk: Siziň taýşdyryş koduňyz
tr: Tavsiye Kodun
vi: Mã giới thiệu của bạn
zh_cn: 您的邀请码
zh_hk: 你的推薦碼

# invite_friends_message
source: Share your referral code with a friend. When they use it to purchase Lantern Pro, both of you will receive 30 days of Lantern Pro for free!
ar: شارك رمز الإحالة الخاص بك مع صديق. عندما يقومون بشراء Lantern Pro، ستحصلان كلاكما على وقت إضافي:
bn: আপনার রেফারেল কোডটি একটি বন্ধুর সাথে শেয়ার করুন। যখন তারা Lantern Pro কিনবে, তখন আপনি দুজনেই অতিরিক্ত সময় পাবেন:
es_cu: Comparte tu código de referido con un amigo. Cuando compren Lantern Pro, ambos recibirán tiempo adicional:
fa: کد معرف خود را با یک دوست به اشتراک بگذارید. وقتی آن‌ها Lantern Pro را خریداری کنند، هر دو زمان اضافی دریافت می‌کنید:
hi: अपने रेफरल कोड को एक दोस्त के साथ साझा करें। जब वे Lantern Pro खरीदते हैं, तो आप दोनों को बोनस समय मिलता है:
ms: Kongsi kod rujukan anda dengan rakan. Apabila mereka membeli Lantern Pro, anda berdua akan mendapat masa bonus:
my: သင့်ရဲ့ ရည်ညွှန်းကုဒ်ကို သူငယ်ချင်းတစ်ဦးနှင့် မျှဝေပါ။ သူတို့က Lantern Pro ကို ဝယ်ယူတဲ့အခါ၊ သင်နှင့် သူတို့နှစ်ဦးစလုံး အပိုအချိန်ရရှိပါသည်။
ps: خپل د راجع کولو کوډ د یوه ملګري سره شریک کړئ. کله چې دوی Lantern Pro واخلي، تاسو دواړه اضافي وخت ترلاسه کوئ:
ru: Поделитесь реферальным кодом с другом. Когда он купит Lantern Pro, вы оба получите бонусное время:
th: แชร์โค้ดแนะนำของคุณกับเพื่อน เมื่อพวกเขาซื้อ Lantern Pro คุณทั้งคู่จะได้เวลาโบนัส:
tk: Rekomendasiýa koduňyzy dostuňyz bilen paýlaşyň. Olar Lantern Pro satyn alanda, ikä siziň hem goşmaça wagt alarsyňyz:
tr: Referans kodunuzu bir arkadaşınızla paylaşın. Lantern Pro satın aldıklarında, ikiniz de bonus süre kazanırsınız:
vi: Chia sẻ mã giới thiệu của bạn với bạn bè. Khi họ mua Lantern Pro, cả hai sẽ nhận được thời gian thưởng:
zh_cn: 将您的推荐码分享给朋友。当他们购买蓝灯 Pro时，您和朋友都将获得额外时间：
zh_hk: 將你的推薦碼分享給朋友。當他們購買 Lantern Pro 時，你們都可以獲得額外的使用時間：

source: Share Referral Code
ar: مشاركة رمز الإحالة
bn: রেফারেল কোড শেয়ার করুন
es_cu: Comparte el código de referencia
fa: هم‌رسانی کد معرف
hi: रेफरल कोड शेयर करें
ms: Kongsi Kod Rujukan
my: ရည်ညွှန်းကုဒ် မျှဝေရန်
ps: د راجع کولو کوډ شریک کړئ
ru: Поделиться реферальным кодом
th: แชร์รหัสแนะนำ
tk: Taýşdyryş kodyny paýlaş
tr: Tavsiye Kodunu Paylaş
vi: Chia sẻ mã giới thiệu
zh_cn: 分享邀请码
zh_hk: 分享推薦碼

source: Help Fight Global Internet Censorship
ar: ساعد في مكافحة الرقابة العالمية على الإنترنت
bn: বিশ্বব্যাপী ইন্টারনেট সেন্সরশিপের বিরুদ্ধে লড়াইয়ে সাহায্য করুন
es_cu: Ayuda a Combatir la Censura Global de Internet
fa: در مبارزه با سانسور جهانی اینترنت هم‌راه شوید
hi: वैश्विक इंटरनेट सेंसरशिप से लड़ने में मदद करें
ms: Bantu Menentang Penapisan Internet Global
my: ကမ္ဘာလုံးဆိုင်ရာ အင်တာနက် ဆင်ဆာဖြတ်ခြင်းကို တိုက်ဖျက်ရန် ကူညီပါ
ps: د نړیوال انټرنیټ سانسورشپ په مقابله کې مرسته وکړئ
ru: Помогите бороться с интернет-цензурой по всему миру
th: ช่วยต่อสู้กับการเซ็นเซอร์อินเทอร์เน็ตทั่วโลก
tk: Global internet senzurasy bilen göreşmäge kömek ediň
tr: Küresel İnternet Sansürüne Karşı Mücadeleye Yardım Et
vi: Chung tay chống kiểm duyệt Internet toàn cầu
zh_cn: 共同对抗全球互联网审查
zh_hk: 協助對抗全球網路審查

source: VPN Settings
ar: إعدادات VPN
bn: ভিপিএন সেটিংস
es_cu: Configuración de VPN
fa: تنظیمات VPN
hi: VPN सेटिंग्स
ms: Tetapan VPN
my: VPN ဆက်တင်များ
ps: د VPN تنظیمات
ru: Настройки VPN
th: การตั้งค่า VPN
tk: VPN sazlamalary
tr: VPN Ayarları
vi: Cài đặt VPN
zh_cn: VPN 设置
zh_hk: VPN 設定

source: Split Tunneling
ar: التوجيه المُقسّم
bn: স্প্লিট টানেলিং
es_cu: Túnel dividido
fa: تونل‌سازی تفکیکی
hi: स्प्लिट टनलिंग
ms: Terowong Terpisah
my: ခွဲခြားချိတ်ဆက်ခြင်း
ps: وېشل شوی ټنل
ru: Раздельное туннелирование
th: แยกอุโมงค์
tk: Bölünişikli tunnelirleme
tr: Bölünmüş Tünelleme
vi: Định tuyến phân tách
zh_cn: 分流
zh_hk: 分流

source: Server Locations
ar: مواقع الخوادم
bn: সার্ভার লোকেশন
es_cu: Ubicaciones de Servidor
fa: مکان سرورها
hi: सर्वर स्थान
ms: Lokasi Pelayan
my: ဆာဗာ တည်နေရာများ
ps: د سرور موقعیتونه
ru: Выбор региона сервера
th: ตำแหน่งเซิร์ฟเวอร์
tk: Serwer ýerleri
tr: Sunucu Konumları
vi: Vị trí máy chủ
zh_cn: 服务器位置
zh_hk: 伺服器位置

source: Lantern Pro Email:
ar: بريد Lantern برو الإلكتروني:
bn: Lantern Pro ইমেইল:
es_cu: Email de Lantern Pro:
fa: ایمیل Lantern پرو:
hi: Lantern प्रो ईमेल:
ms: E-mel Pro:
my: Lantern Pro အီးမေးလ်-
ps: د Lantern Pro بریښنالیک:
ru: Email Lantern Про:
th: อีเมล Lantern Pro:
tk: Lantern Pro e-poçtasy:
tr: Lantern Pro E-postası:
vi: Email Lantern Pro:
zh_cn: 蓝灯专业版电子邮箱:
zh_hk: Lantern 專業版電子郵件:

source: Pro Account Expiration
ar: انتهاء صلاحية حساب برو
bn: প্রো অ্যাকাউন্ট মেয়াদ শেষ
es_cu: Caducidad de la cuenta Pro
fa: انقضای حساب پرو
hi: प्रो अकाउंट समाप्ति
ms: Tarikh Tamat Akaun Pro
my: Pro အကောင့် သက်တမ်းကုန်ဆုံးမှု
ps: د پرو حساب پای موده
ru: Истечение срока действия Про аккаунта
th: วันหมดอายุบัญชี Pro
tk: Pro hasabynyň möhleti
tr: Pro Hesap Bitiş Tarihi
vi: Ngày hết hạn tài khoản Pro
zh_cn: 专业版账户到期时间
zh_hk: 專業版帳號到期日

source: Manage Subscription
ar: إدارة الاشتراك
bn: সাবস্ক্রিপশন পরিচালনা করুন
es_cu: Gestionar Suscripción
fa: مدیریت اشتراک
hi: सब्सक्रिप्शन प्रबंधित करें
ms: Urus Langganan
my: စာရင်းသွင်းမှု စီမံခန့်ခွဲရန်
ps: ګډون مدیریت کړئ
ru: Управление подпиской
th: จัดการการสมัครสมาชิก
tk: Abunalygyňyzy dolandyr
tr: Aboneliği Yönet
vi: Quản lý gói đăng ký
zh_cn: 管理订阅
zh_hk: 管理訂閱

source: Lantern Pro Devices
ar: أجهزة Lantern برو
bn: Lantern Pro ডিভাইস
es_cu: Dispositivos Lantern Pro
fa: دستگاه‌های Lantern پرو
hi: Lantern प्रो डिवाइस
ms: Peranti Lantern Pro
my: Lantern Pro စက်ပစ္စည်းများ
ps: د Lantern Pro وسایل
ru: Lantern Про устройства
th: อุปกรณ์ Lantern Pro
tk: Lantern Pro enjamlary
tr: Lantern Pro Cihazları
vi: Thiết bị Lantern Pro
zh_cn: 蓝灯专业版设备
zh_hk: Lantern 專業版裝置

source: Remove
ar: إزالة
bn: সরান
es_cu: Eliminar
fa: حذف
hi: हटाएं
ms: Buang
my: ဖယ်ရှားရန်
ps: لرې کړئ
ru: Удалить
th: ลบออก
tk: Aýyr
tr: Kaldır
vi: Xóa
zh_cn: 移除
zh_hk: 移除

source: Add Device
ar: إضافة جهاز
bn: ডিভাইস যোগ করুন
es_cu: Agregar dispositivo
fa: افزودن دستگاه
hi: डिवाइस जोड़ें
ms: Tambah Peranti
my: စက်ပစ္စည်း ထည့်ရန်
ps: وسیله اضافه کړئ
ru: Добавить устройство
th: เพิ่มอุปกรณ์
tk: Enjam goş
tr: Cihaz Ekle
vi: Thêm thiết bị
zh_cn: 添加设备
zh_hk: 新增裝置

source: Danger Zone:
ar: منطقة الخطر:
bn: ঝুঁকিপূর্ণ এলাকা:
es_cu: Zona de Riesgo:
fa: منطقه خطر:
hi: खतरे का क्षेत्र:
ms: Zon Berbahaya:
my: အန္တရာယ် ဇုန်-
ps: خطر ساحه:
ru: Опасная зона:
th: โซนอันตราย:
tk: Howply zona:
tr: Tehlike Bölgesi:
vi: Vùng nguy hiểm:
zh_cn: 危险操作:
zh_hk: ⚠️ 危險區域

source: Delete Account
ar: حذف الحساب
bn: অ্যাকাউন্ট মুছে দিন
es_cu: Eliminar Cuenta
fa: حذف حساب کاربری
hi: अकाउंट डिलीट करें
ms: Padam Akaun
my: အကောင့် ဖျက်ရန်
ps: حساب ړنګ کړئ
ru: Удалить аккаунт
th: ลบบัญชี
tk: Hasaby poz
tr: Hesabı Sil
vi: Xóa tài khoản
zh_cn: 删除账户
zh_hk: 刪除帳號

source: Delete
ar: حذف
bn: মুছুন
es_cu: Borrar
fa: حذف
hi: डिलीट करें
ms: Padam
my: ဖျက်ရန်
ps: ړنګول
ru: Удалить
th: ลบ
tk: Poz
tr: Sil
vi: Xóa
zh_cn: 删除
zh_hk: 刪除

source: Account
ar: الحساب
bn: অ্যাকাউন্ট
es_cu: Cuenta
fa: حساب کاربری
hi: अकाउंट
ms: Akaun
my: အကောင့်
ps: حساب
ru: Аккаунт
th: บัญชี
tk: Hasap
tr: Hesap
vi: Tài khoản
zh_cn: 账户
zh_hk: 帳號

# delete_account_?
source: Delete your Account?
ar: حذف حسابك؟
bn: আপনার অ্যাকাউন্ট মুছে দিতে চান?
es_cu: ¿Eliminar tu Cuenta?
fa: می‌خواهید حساب کاربری خود را حذف کنید؟
hi: अपना अकाउंट डिलीट करें?
ms: Padam Akaun Anda?
my: သင့်အကောင့်ကို ဖျက်မလား?
ps: ستاسو حساب ړنګ کړئ؟
ru: Удалить ваш аккаунт?
th: ลบบัญชีของคุณ?
tk: Hasabyňyzy pozmalymy?
tr: Hesabını Sil?
vi: Xóa tài khoản của bạn?
zh_cn: 删除您的账户?
zh_hk: 刪除你的帳號?

# delete_account_message
source: To confirm deletion please enter your password below
ar: حذف الحساب نهائي. ستفقد الوصول على جميع الأجهزة، وسيتم فقدان أي وقت متبقي من اشتراك برو دون استرداد.
bn: অ্যাকাউন্ট মুছে ফেলা স্থায়ী। আপনি সমস্ত ডিভাইসে অ্যাক্সেস হারাবেন এবং অবশিষ্ট প্রো সাবস্ক্রিপশনের সময় কোনো রিফান্ড ছাড়াই বাতিল হয়ে যাবে।
es_cu: La eliminación de la cuenta es permanente. Perderás el acceso en todos los dispositivos y cualquier tiempo restante de suscripción Pro se perderá sin reembolso.
fa: حذف حساب کاربری برگشت‌ناپذیر است. دسترسی شما در تمام دستگاه‌ها از دست می‌رود و زمان باقی‌مانده اشتراک پرو نیز، بدون بازپرداخت از بین خواهد رفت.
hi: अकाउंट डिलीट करना स्थायी है। आप सभी डिवाइस पर एक्सेस खो देंगे, और बची हुई प्रो सब्सक्रिप्शन का समय बिना रिफंड के जब्त हो जाएगा।
ms: Pemadaman akaun adalah kekal. Anda akan kehilangan akses pada semua peranti, dan sebarang masa langganan Pro yang berbaki akan dilucuthakkan tanpa bayaran balik.
my: အကောင့် ဖျက်ခြင်းသည် အပြီးသတ်ဖြစ်သည်။ သင်သည် စက်ပစ္စည်းအားလုံးတွင် အသုံးပြုခွင့် ဆုံးရှုံးမည်ဖြစ်ပြီး၊ ကျန်ရှိသော Pro စာရင်းသွင်းမှု အချိန်မှန်သမျှကို ပြန်အမ်းငွေမရှိဘဲ စွန့်လွှတ်ရပါမည်။
ps: د حساب ړنګول دایمي دي. تاسو به په ټولو وسایلو کې لاسرسی له لاسه ورکړئ، او هره پاتې د پرو ګډون وخت به پرته له بیرته ورکولو له لاسه ورکړي.
ru: Удаление аккаунта необратимо. Вы потеряете доступ на всех устройствах, а оставшееся время подписки Про будет утрачено без возврата средств.
th: การลบบัญชีเป็นการถาวร คุณจะสูญเสียการเข้าถึงบนอุปกรณ์ทั้งหมด และเวลาการใช้งาน Pro ที่เหลืออยู่จะถูกริบโดยไม่มีการคืนเงิน
tk: Hasabyň pozulmagy hemişelik. Ähli enjamlarda elýeterliligi ýitirýärsiňiz we galan Pro abunalyk wagty yzyna gaýtarylman ýitirilýär.
tr: Hesap silme işlemi kalıcıdır. Tüm cihazlarda erişiminizi kaybedeceksiniz ve kalan Pro abonelik süreniz iade yapılmadan kaybedilecektir.
vi: Việc xóa tài khoản là vĩnh viễn. Bạn sẽ mất quyền truy cập trên tất cả các thiết bị, và thời gian đăng ký Pro còn lại sẽ bị hủy mà không được hoàn tiền.
zh_cn: 账户删除是永久性的。您将在所有设备上失去访问权限,任何剩余的专业版订阅时间将被没收且不予退款。
zh_hk: 帳號刪除後將無法復原。你將失去所有裝置的存取權限,且任何剩餘的專業版訂閱時間都將被沒收且不予退款。

# Submit Issue Report
source: Enter Password to Confirm
ar: إرسال تقرير المشكلة
bn: সমস্যা রিপোর্ট জমা দিন
es_cu: Enviar Reporte de Problema
fa: رمز عبور را برای تأیید وارد کنید
hi: पुष्टि के लिए पासवर्ड दर्ज करें
ms: Hantar Laporan Masalah
my: အတည်ပြုရန် စကားဝှက် ထည့်ပါ
ps: د ستونزې راپور وسپارئ
ru: Введите пароль для подтверждения
th: ส่งรายงานปัญหา
tk: Mesele hasabatyny iber
tr: Sorun Raporu Gönder
vi: Gửi báo cáo sự cố
zh_cn: 提交问题报告
zh_hk: 提交問題回報

source: Confirm Deletion
ar: تأكيد الحذف
bn: মুছে ফেলা নিশ্চিত করুন
es_cu: Confirmar Eliminación
fa: تأیید حذف
hi: डिलीट करने की पुष्टि करें
ms: Sahkan Pemadaman
my: ဖျက်ပါ
ps: ړنګول تایید کړئ
ru: Подтвердить удаление
th: ยืนยันการลบ
tk: Pozulmagyny tassykla
tr: Silmeyi Onayla
vi: Xác nhận xóa
zh_cn: 确认删除
zh_hk: 確認刪除

source: Cancel
ar: إلغاء
bn: বাতিল করুন
es_cu: Cancelar
fa: لغو
hi: रद्द करें
ms: Batal
my: ပယ်ဖျက်ရန်
ps: لغوه کړئ
ru: Отмена
th: ยกเลิก
tk: Ýatyr
tr: İptal
vi: Hủy
zh_cn: 取消
zh_hk: 取消

source: Daily Data Usage
ar: استهلاك البيانات اليومي
bn: দৈনিক ডেটা ব্যবহার
es_cu: Uso de datos diario
fa: مصرف داده روزانه
hi: दैनिक डेटा उपयोग
ms: Penggunaan Data Harian
my: နေ့စဉ် ဒေတာ အသုံးပြုမှု
ps: ورځنۍ ډیټا کارول
ru: Использованные данные задень
th: การใช้ข้อมูลรายวัน
tk: Gündelik maglumat ulanyşy
tr: Günlük Veri Kullanımı
vi: Lưu lượng dữ liệu hàng ngày
zh_cn: 每日数据用量
zh_hk: 每日數據用量

source: MB
ar: ميجابايت
fa: مگابایت
ru: МБ

source: VPN Status
ar: حالة VPN
bn: ভিপিএন স্ট্যাটাস
es_cu: Estado de la VPN
fa: وضعیت VPN
hi: VPN स्थिति
ms: Status VPN
my: VPN အခြေအနေ
ps: د VPN حالت
ru: Статус VPN
th: สถานะ VPN
tk: VPN ýagdaýy
tr: VPN Durumu
vi: Trạng thái VPN
zh_cn: VPN 状态
zh_hk: VPN 狀態

source: Telegram
ar: تيليجرام
fa: تلگرام
ps: ټیلیګرام

source: Instagram
ar: إنستجرام
fa: اینستاگرام
ps: انسټاګرام

source: X
fa: ایکس

source: Follow Us
ar: تابعنا
bn: আমাদের ফলো করুন
es_cu: Síguenos
fa: ما را دنبال کنید
hi: हमें फॉलो करें
ms: Ikuti Kami
my: ကျွန်ုပ်တို့ကို လိုက်ပါ
ps: موږ تعقیب کړئ
ru: Следите за нами
th: ติดตามเรา
tk: Bizi yzarlaň
tr: Bizi Takip Et
vi: Theo dõi chúng tôi
zh_cn: 关注我们
zh_hk: 追蹤我們

source: Server Selection
ar: اختيار الخادم
bn: সার্ভার নির্বাচন
es_cu: Selección de Servidor
fa: انتخاب سرور
hi: सर्वर चयन
ms: Pemilihan Pelayan
my: ဆာဗာ ရွေးချယ်မှု
ps: د سرور انتخاب
ru: Выбор сервера
th: การเลือกเซิร์ฟเวอร์
tk: Serwer saýlamak
tr: Sunucu Seçimi
vi: Chọn máy chủ
zh_cn: 服务器选择
zh_hk: 伺服器選擇

source: Smart Location
ar: الموقع الذكي
bn: স্মার্ট লোকেশন
es_cu: Ubicación Inteligente
fa: مکان هوشمند
hi: स्मार्ट लोकेशन
ms: Lokasi Pintar
my: စမတ် တည်နေရာ
ps: هوښیار موقعیت
ru: Умное расположение
th: ตำแหน่งอัจฉริยะ
tk: Akylly ýerleşiş
tr: Akıllı Konum
vi: Vị trí thông minh
zh_cn: 智能位置
zh_hk: 智慧位置

source: Automatically chooses fastest location
ar: يختار تلقائيًا أسرع موقع
bn: স্বয়ংক্রিয়ভাবে দ্রুততম লোকেশন বেছে নেয়
es_cu: Elige automáticamente la ubicación más rápida
fa: انتخاب سریع‌ترین مکان را به طور خودکار
hi: स्वचालित रूप से सबसे तेज़ स्थान चुनता है
ms: Secara automatik memilih lokasi terpantas
my: အမြန်ဆုံး တည်နေရာကို အလိုအလျောက် ရွေးချယ်သည်
ps: په اتوماتیک ډول تر ټولو ګړندی موقعیت غوره کوي
ru: Автоматически выбирает расположение с самым быстрым сервером
th: เลือกตำแหน่งที่เร็วที่สุดโดยอัตโนมัติ
tk: Iň çalt ýerleşişi awtomatik saýlaýar
tr: En hızlı konumu otomatik seçer
vi: Tự động chọn vị trí nhanh nhất
zh_cn: 自动选择最快的位置
zh_hk: 自動選擇最快的位置

source: Pro locations:
ar: مواقع برو:
bn: প্রো লোকেশনস:
es_cu: Ubicaciones Pro:
fa: مکان‌های پرو:
hi: प्रो स्थान:
ms: Lokasi Pro:
my: Pro တည်နေရာများ
ps: پرو موقعیتونه:
ru: Расположение Про серверов:
th: ตำแหน่ง Pro:
tk: Pro ýerleşişler:
tr: Pro konumları:
vi: Vị trí Pro:
zh_cn: 专业版位置:
zh_hk: 專業版位置:

source: Choose your location with Lantern Pro:
ar: اختر موقعك مع Lantern برو:
bn: Lantern Pro দিয়ে আপনার লোকেশন বেছে নিন:
es_cu: Elige tu ubicación con Lantern Pro:
fa: مکان خود را با Lantern پرو انتخاب کنید:
hi: Lantern प्रो के साथ अपना स्थान चुनें:
ms: Pilih lokasi anda dengan Lantern Pro:
my: Lantern Pro ဖြင့် သင့်တည်နေရာကို ရွေးချယ်ပါ
ps: د Lantern Pro سره خپل موقعیت غوره کړئ:
ru: Выберите расположение Lantern Про серверов:
th: เลือกตำแหน่งของคุณด้วย Lantern Pro:
tk: Lantern Pro bilen ýerleşişiňizi saýlaň:
tr: Lantern Pro ile konumunu seç:
vi: Chọn vị trí của bạn với Lantern Pro:
zh_cn: 使用蓝灯专业版选择您的位置:
zh_hk: 使用 Lantern 專業版選擇你的位置:

source: Language
ar: اللغة
bn: ভাষা
es_cu: Idioma
fa: زبان
hi: भाषा
ms: Bahasa
my: ဘာသာစကား
ps: ژبه
ru: Язык
th: ภาษา
tk: Dil
tr: Dil
vi: Ngôn ngữ
zh_cn: 语言
zh_hk: 語言

source: Sign In
ar: تسجيل الدخول
bn: সাইন ইন করুন
es_cu: Iniciar sesión
fa: ورود
hi: साइन इन करें
ms: Log Masuk
my: ဝင်ရောက်ရန်
ps: ننوتل
ru: Войти
th: ลงชื่อเข้าใช้
tk: Içeri gir
tr: Giriş Yap
vi: Đăng nhập
zh_cn: 登录
zh_hk: 登入

source: Sign Out
ar: تسجيل الخروج
bn: সাইন আউট করুন
es_cu: Cerrar sesión
fa: خروج
hi: साइन आउट करें
ms: Log Keluar
my: ထွက်ရန်
ps: وتل
ru: Выйти
th: ออกจากระบบ
tk: Çyk
tr: Çıkış Yap
vi: Đăng xuất
zh_cn: 退出登录
zh_hk: 登出

source: Check for Updates
ar: التحقق من التحديثات
bn: আপডেট চেক করুন
es_cu: Buscar actualizaciones
fa: بررسی به‌روزرسانی
hi: अपडेट की जांच करें
ms: Semak Kemas Kini
my: အပ်ဒိတ်များ စစ်ဆေးရန်
ps: د تازه کولو لپاره وګورئ
ru: Проверить обновления
th: ตรวจสอบการอัปเดต
tk: Täzelenmeler barla
tr: Güncellemeleri Kontrol Et
vi: Kiểm tra cập nhật
zh_cn: 检查更新
zh_hk: 檢查更新

source: Support
ar: الدعم
bn: সহায়তা
es_cu: Soporte
fa: پشتیبانی
hi: सहायता
ms: Sokongan
my: ပံ့ပိုးမှု
ps: ملاتړ
ru: Поддержка
th: ฝ่ายสนับสนุน
tk: Goldaw
tr: Destek
vi: Hỗ trợ
zh_cn: 支持
zh_hk: 支援

source: Download Links
ar: روابط التنزيل
bn: ডাউনলোড লিংক
es_cu: Enlaces de Descarga
fa: لینک‌های دانلود
hi: डाउनलोड लिंक
ms: Pautan Muat Turun
my: ဒေါင်းလုဒ် လင့်များ
ps: د ډاونلوډ لینکونه
ru: Ссылки для скачивания
th: ลิงก์ดาวน์โหลด
tk: Göçürip almak baglanyşyklary
tr: İndirme Linkleri
vi: Liên kết tải xuống
zh_cn: 下载链接
zh_hk: 下載連結

source: Get 30 days of Pro free
ar: احصل على 30 يومًا من برو مجانًا
bn: ৩০ দিন প্রো বিনামূল্যে পান
es_cu: Obtén 30 días de Pro gratis
fa: ۳۰ روز پرو رایگان بگیرید
hi: 30 दिन का प्रो मुफ्त पाएं
ms: Dapatkan 30 hari Pro percuma
my: Pro ကို ရက် 30 အခမဲ့ရယူပါ
ps: د 30 ورځو لپاره وړیا پرو ترلاسه کړئ
ru: Получите 30 дней Про бесплатно
th: รับ Pro ฟรี 30 วัน
tk: 30 gün mugt Pro alyň
tr: 30 gün ücretsiz Pro kazan
vi: Nhận 30 ngày Pro miễn phí
zh_cn: 免费获得 30 天专业版
zh_hk: 免費獲得 30 天專業版

# share_message_referral_code
source: For a free month of Lantern Pro, use this referral code: %s ; You can download it from here: https://lantern.io/download
ar: للحصول على شهر مجاني من Lantern برو، استخدم رمز الإحالة هذا: %s ؛ يمكنك تنزيله من هنا: https://lantern.io/download
bn: Lantern Pro এর এক মাস বিনামূল্যে পেতে এই রেফারেল কোড ব্যবহার করুন: %s ; আপনি এটি এখান থেকে ডাউনলোড করতে পারেন: https://lantern.io/download
es_cu: Para conseguir un mes gratis de Lantern Pro, usa este código de referencia: %1$s ; Puedes descargarlo aquí: https://bit.ly/1M8x04u
fa: برای دریافت Lantern پرو یک‌ماههه رایگان، از این کد معرف استفاده کنید: %s ؛ آن را می‌توانید از اینجا دانلود کنید: https://lantern.io/download
hi: Lantern प्रो के एक मुफ्त महीने के लिए, इस रेफरल कोड का उपयोग करें: %s ; आप इसे यहां से डाउनलोड कर सकते हैं: https://lantern.io/download
ms: Untuk bulan percuma Lantern Pro, gunakan kod rujukan ini: %s ; Anda boleh memuat turunnya dari sini: https://lantern.io/download
my: Lantern Pro တစ်လအခမဲ့အတွက်၊ ဒီရည်ညွှန်းကုဒ်ကို အသုံးပြုပါ- %s ; သင် ဒီမှာ ဒေါင်းလုဒ်လုပ်နိုင်ပါတယ်- https://lantern.io/download
ps: د یوې وړیا میاشتې Lantern Pro لپاره، دا د راجع کولو کوډ وکاروئ: %s ; تاسو کولی شئ دلته له دې ځایه ډاونلوډ کړئ: https://lantern.io/download
ru: Чтобы получить один бесплатный месяц подписки на Lantern Про, используйте этот реферальный код: %s ; Можете скачать приложение здесь: https://lantern.io/download
th: รับ Lantern Pro ฟรีหนึ่งเดือน ใช้รหัสแนะนำนี้: %s ; คุณสามารถดาวน์โหลดได้จาก: https://lantern.io/download
tk: Mugt bir aýlyk Lantern Pro almak üçin şu taýşdyryş kodyny ulanyň: %s ; Ony şu ýerden göçürip alyp bilersiňiz: https://lantern.io/download
tr: Bir ay ücretsiz Lantern Pro için bu tavsiye kodunu kullan: %s ; Buradan indirebilirsin: https://lantern.io/download
vi: Để nhận một tháng Lantern Pro miễn phí, hãy sử dụng mã giới thiệu này: %s ; Bạn có thể tải xuống từ đây: https://lantern.io/download
zh_cn: 免费获得一个月的蓝灯专业版,请使用此邀请码:%s;您可以从这里下载:https://lantern.io/download
zh_hk: 免費獲得一個月的 Lantern 專業版,請使用此推薦碼:%s;你可以從這裡下載:https://lantern.io/download

source: Submit Issue Report
ar: إرسال تقرير المشكلة
bn: সমস্যা রিপোর্ট জমা দিন
es_cu: Enviar Reporte de Problema
fa: مشکل را گزارش دهید
hi: समस्या रिपोर्ट सबमिट करें
ms: Hantar Laporan Masalah
my: ပြဿနာ အစီရင်ခံစာ တင်သွင်းပါ
ps: د ستونزې راپور وسپارئ
ru: Отправить отчет о проблеме
th: ส่งรายงานปัญหา
tk: Mesele barada habar ber
tr: Sorun Raporu Gönder
vi: Gửi báo cáo sự cố
zh_cn: 提交问题报告
zh_hk: 提交問題回報

source: Select an Issue
ar: اختر مشكلة
bn: একটি সমস্যা নির্বাচন করুন
es_cu: Selecciona un Problema
fa: مشکلی انتخاب کنید
hi: एक समस्या चुनें
ms: Pilih Masalah
my: ပြဿနာတစ်ခု ရွေးပါ
ps: یوه ستونزه غوره کړئ
ru: Выберите проблему
th: เลือกปัญหา
tk: Mesele saýlaň
tr: Bir Sorun Seç
vi: Chọn một sự cố
zh_cn: 选择问题类型
zh_hk: 選擇問題

source: Cannot access blocked sites
ar: لا يمكن الوصول إلى المواقع المحظورة
bn: ব্লক করা সাইটে প্রবেশ করতে পারছি না
es_cu: No se puede acceder a sitios bloqueados
fa: دسترسی به سایت‌های مسدودشده ممکن نیست
hi: ब्लॉक की गई साइटों तक पहुंच नहीं हो पा रही
ms: Tidak dapat mengakses laman yang disekat
my: ပိတ်ဆို့ထားသော ဆိုက်များကို ဝင်ရောက်၍မရပါ
ps: بند شوي سایټونو ته لاسرسی نشم کولی
ru: Не могу получить доступ к заблокированным сайтам
th: ไม่สามารถเข้าถึงเว็บไซต์ที่ถูกบล็อก
tk: Bloklanan saýtlara girip bilemok
tr: Engelli sitelere erişilemiyor
vi: Không thể truy cập các trang web bị chặn
zh_cn: 无法访问被屏蔽的网站
zh_hk: 無法存取被封鎖的網站

source: Cannot complete purchase
ar: لا يمكن إكمال الشراء
bn: ক্রয় সম্পূর্ণ করতে পারছি না
es_cu: No se puede realizar la compra
fa: تکمیل خرید ممکن نیست
hi: खरीदारी पूरी नहीं हो पा रही
ms: Tidak dapat melengkapkan pembelian
my: ဝယ်ယူမှု ပြီးစီး၍မရပါ
ps: پیرود بشپړ نشم کولی
ru: Не могу завершить покупку
th: ไม่สามารถทำการซื้อให้เสร็จสมบูรณ์
tk: Satyn almagy tamamlap bilemok
tr: Satın alma tamamlanamıyor
vi: Không thể hoàn tất thanh toán
zh_cn: 无法完成购买
zh_hk: 無法完成購買

source: Discover not working
ar: الاكتشاف لا يعمل
bn: ডিসকভার কাজ করছে না
es_cu: El descubrimiento no funciona
fa: بخش Discover کار نمی‌کند
hi: डिस्कवर काम नहीं कर रहा
ms: Discover tidak berfungsi
my: ရှာဖွေတွေ့ရှိမှု အလုပ်မလုပ်ပါ
ps: کشف کار نه کوي
ru: Discover не работает
th: Discover ใช้งานไม่ได้
tk: Açyş işlemeýär
tr: Keşfet çalışmıyor
vi: Discover không hoạt động
zh_cn: 发现功能无法使用
zh_hk: 探索功能無法使用

source: Cannot sign in
ar: لا يمكن تسجيل الدخول
bn: সাইন ইন করতে পারছি না
es_cu: No se pudo iniciar sesión
fa: ورود ممکن نیست
hi: साइन इन नहीं हो पा रहा
ms: Tidak dapat log masuk
my: ဝင်ရောက်၍မရပါ
ps: ننوتل نشم کولی
ru: Не могу зарегестрироваться
th: ไม่สามารถลงชื่อเข้าใช้
tk: Içeri girip bilemok
tr: Giriş yapılamıyor
vi: Không thể đăng nhập
zh_cn: 无法登录
zh_hk: 無法登入

source: Spinner loads endlessly
ar: المؤشر يدور بلا نهاية
bn: স্পিনার অনবরত লোড হচ্ছে
es_cu: El Spinner carga infinitamente
fa: مدت بارگذاری تمام‌نشدنی است
hi: स्पिनर लगातार लोड हो रहा है
ms: Pemuat berputar tanpa henti
my: လည်ပတ်နေသည့်အရာ အဆုံးမရှိ တင်နေသည်
ps: سپینر په پای نه رسېدونکي ډول بار کوي
ru: Бесконечная загрузка
th: สัญลักษณ์หมุนโหลดไม่จบ
tk: Ýükleýji hemişe aýlanýar
tr: Yükleme sonsuz devam ediyor
vi: Biểu tượng tải quay mãi không dừng
zh_cn: 加载图标一直转动
zh_hk: 載入動畫無限轉圈

source: Slow
ar: بطيء
bn: ধীর গতি
es_cu: Lento
fa: کند
hi: धीमा
ms: Perlahan
my: နှေးသည်
ps: ورو
ru: Медленно
th: ช้า
tk: Haýal
tr: Yavaş
vi: Chậm
zh_cn: 速度慢
zh_hk: 速度慢

source: Cannot link devices
ar: لا يمكن ربط الأجهزة
bn: ডিভাইস লিংক করতে পারছি না
es_cu: No se pueden vincular dispositivos
fa: امکان پیوند دستگاه‌ها وجود ندارد
hi: डिवाइस लिंक नहीं हो पा रहे
ms: Tidak dapat memautkan peranti
my: စက်ပစ္စည်းများ ချိတ်ဆက်၍မရပါ
ps: وسایل نښلولی نشم
ru: Не могу связать устройства
th: ไม่สามารถเชื่อมโยงอุปกรณ์
tk: Enjamlary baglap bilemok
tr: Cihazlar bağlanamıyor
vi: Không thể liên kết thiết bị
zh_cn: 无法关联设备
zh_hk: 無法連結裝置

# wrong_device_linking_code
source: Wrong or invalid device linking code
ar: رمز ربط الجهاز خاطئ أو غير صالح
bn: ভুল বা অবৈধ ডিভাইস লিংকিং কোড
es_cu: Código de vinculación de dispositivo erróneo o no válido
fa: کد پیوند دستگاه اشتباه یا نامعتبر
hi: गलत या अमान्य डिवाइस लिंकिंग कोड
ms: Kod pautan peranti salah atau tidak sah
my: မှားသော သို့မဟုတ် မမှန်ကန်သော စက်ပစ္စည်း ချိတ်ဆက်ကုဒ်
ps: غلط یا ناسم د وسیلې نښلولو کوډ
ru: Неправильный или недействительный код связывания устройства
th: รหัสเชื่อมโยงอุปกรณ์ผิดหรือไม่ถูกต้อง
tk: Enjam baglaýyş kody nädogry ýa-da nädogry
tr: Yanlış veya geçersiz cihaz bağlama kodu
vi: Mã liên kết thiết bị sai hoặc không hợp lệ
zh_cn: 设备关联码错误或无效
zh_hk: 裝置連結碼錯誤或無效
