Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

# examples_of_bypassed_sites
source: These include HTTPS-encrypted sites with public or non-sensitive content like shopping, weather, and software updates.
ar: تشمل هذه المواقع المشفرة بـ HTTPS ذات المحتوى العام أو غير الحساس مثل التسوق والطقس وتحديثات البرامج.
bn: এর মধ্যে রয়েছে HTTPS-এনক্রিপ্টেড সাইট যেগুলোতে পাবলিক বা অ-সংবেদনশীল কন্টেন্ট আছে যেমন শপিং, আবহাওয়া এবং সফটওয়্যার আপডেট।
es_cu: Estos incluyen sitios cifrados con HTTPS con contenido público o no sensible como compras, clima y actualizaciones de software.
fa: این شامل سایت‌های رمزگذاری شده HTTPS با محتوای عمومی یا غیرحساس مانند خرید، آب و هوا و به‌روزرسانی نرم‌افزار است.
hi: इनमें HTTPS-एन्क्रिप्टेड साइटें शामिल हैं जिनमें सार्वजनिक या गैर-संवेदनशील सामग्री है जैसे शॉपिंग, मौसम और सॉफ़्टवेयर अपडेट।
ms: Ini termasuk laman disulitkan HTTPS dengan kandungan awam atau tidak sensitif seperti membeli-belah, cuaca, dan kemas kini perisian.
my: ယင်းတို့တွင် HTTPS-encrypted ဆိုက်များ အများသူငှာ သို့မဟုတ် အကြောင်းအရာ ထိခိုက်မှုမရှိသည့် ဈေးဝယ်ခြင်း၊ ရာသီဥတု၊ နှင့် ဆော့ဖ်ဝဲလ် အပ်ဒိတ်များ ပါဝင်သည်။
ps: پدې کې هغه HTTPS کوډ شوي سایټونه شامل دي چې عامه یا غیر حساسه منځپانګه لري لکه پیرود، هوا، او د سافټویر تازه کول.
ru: Это включает сайты с HTTPS-шифрованием с публичным или неконфиденциальным контентом, такие как онлайн магазины, погода и обновления программного обеспечения.
th: เช่น เว็บไซต์ที่เข้ารหัส HTTPS ที่มีเนื้อหาสาธารณะหรือไม่ละเอียดอ่อน เช่น ช้อปปิ้ง, สภาพอากาศ, และการอัปเดตซอฟต์แวร์
tk: Bulara HTTPS şifrlenen saýtlar, açyk ýa-da duýgur däl mazmunly saýtlar, söwda, howa we programma täzelenmeleri ýaly zatlary öz içine alýar.
tr: Bunlar, alışveriş, hava durumu ve yazılım güncellemeleri gibi kamuya açık veya hassas olmayan içeriğe sahip HTTPS şifreli siteleri içerir.
vi: Bao gồm các trang web được mã hóa HTTPS với nội dung công khai hoặc không nhạy cảm như mua sắm, thời tiết và cập nhật phần mềm.
zh_cn: 这些网站包括 HTTPS 加密的公开或非敏感内容网站,如购物、天气和软件更新。
zh_hk: 這些包括使用 HTTPS 加密且內容為公開或非敏感資訊的網站,例如購物、天氣和軟體更新。

# routing_rules_vary
source: These rules vary by country and are updated regularly.
ar: تختلف هذه القواعد حسب الدولة ويتم تحديثها بانتظام.
bn: এই নিয়মগুলি দেশ অনুযায়ী পরিবর্তিত হয় এবং নিয়মিত আপডেট করা হয়।
es_cu: Estas reglas varían por país y se actualizan regularmente.
fa: این قوانین بر اساس کشور متفاوت است و به طور منظم به‌روزرسانی می‌شود.
hi: ये नियम देश के अनुसार भिन्न होते हैं और नियमित रूप से अपडेट किए जाते हैं।
ms: Peraturan ini berbeza mengikut negara dan dikemas kini secara berkala.
my: ဒီစည်းမျဉ်းများသည် နိုင်ငံအလိုက် ကွဲပြားပြီး ပုံမှန် အပ်ဒိတ်လုပ်သည်။
ps: دا قواعد د هیواد له مخې توپیر لري او په منظم ډول تازه کیږي.
ru: Эти правила различаются по странам и регулярно обновляются.
th: กฎเหล่านี้แตกต่างกันไปตามประเทศและมีการอัปเดตเป็นประจำ
tk: Bu düzgünler ýurt boýunça üýtgeýär we yzygiderli täzelenýär.
tr: Bu kurallar ülkeye göre değişir ve düzenli olarak güncellenir.
vi: Các quy tắc này khác nhau theo quốc gia và được cập nhật thường xuyên.
zh_cn: 这些规则因国家而异,并定期更新。
zh_hk: 這些規則因國家而異,並會定期更新。

# view_the_full_list
source: View the full list of routing rules.
ar: عرض القائمة الكاملة لقواعد التوجيه.
bn: রাউটিং নিয়মের সম্পূর্ণ তালিকা দেখুন।
es_cu: Ver la lista completa de reglas de enrutamiento.
fa: مشاهده فهرست کامل قوانین مسیریابی.
hi: रूटिंग नियमों की पूरी सूची देखें।
ms: Lihat senarai penuh peraturan penghalaan.
my: လမ်းညွှန်စည်းမျဉ်းများ၏ အပြည့်အစုံ စာရင်းကို ကြည့်ပါ။
ps: د لارې د قواعدو بشپړ لیست وګورئ.
ru: Посмотреть полный список правил маршрутизации.
th: ดูรายการกฎการจัดเส้นทางทั้งหมด
tk: Ugratma düzgünleriniň doly sanawyna göz aýlaň.
tr: Yönlendirme kurallarının tam listesini görüntüleyin.
vi: Xem danh sách đầy đủ các quy tắc định tuyến.
zh_cn: 查看完整的路由规则列表。
zh_hk: 查看完整的路由規則清單。

# turn_on_split_tunneling
source: Turn on split tunneling to customize which websites use the VPN.
ar: قم بتشغيل التوجيه المُقسّم لتخصيص المواقع التي تستخدم VPN.
bn: কোন ওয়েবসাইট ভিপিএন ব্যবহার করবে তা কাস্টমাইজ করতে স্প্লিট টানেলিং চালু করুন।
es_cu: Activa el túnel dividido para personalizar qué sitios web usan la VPN.
fa: تونل‌سازی تفکیکی را روشن کنید تا انتخاب کنید که کدام وب‌سایت‌ها از VPN استفاده کنند.
hi: कस्टमाइज़ करने के लिए स्प्लिट टनलिंग चालू करें कि कौन सी वेबसाइटें VPN का उपयोग करें।
ms: Hidupkan terowong terpisah untuk menyesuaikan laman web yang menggunakan VPN.
my: VPN အသုံးပြုမည့် ဝက်ဘ်ဆိုက်များကို စိတ်ကြိုက်ပြင်ဆင်ရန် ခွဲခြားချိတ်ဆက်ခြင်းကို ဖွင့်ပါ။
ps: وېشل شوی ټنل فعال کړئ ترڅو دا ځانګړي کړئ چې کوم ویب سایټونه VPN کاروي.
ru: Включите раздельное туннелирование, чтобы определить какие сайты используют VPN.
th: เปิดการแยกอุโมงค์เพื่อปรับแต่งว่าเว็บไซต์ใดใช้ VPN
tk: Haýsy web saýtlaryň VPN ulanmalydygyny düzmek üçin bölünişikli tunnelirleme açyň.
tr: Hangi web sitelerinin VPN kullanacağını özelleştirmek için bölünmüş tünellemeyi açın.
vi: Bật định tuyến phân tách để tùy chỉnh các trang web sử dụng VPN.
zh_cn: 开启分流以自定义哪些网站使用 VPN。
zh_hk: 開啟分流以自訂哪些網站使用 VPN。

source: Welcome to Lantern Pro!
ar: مرحبًا بك في Lantern برو!
bn: Lantern Pro তে স্বাগতম!
es_cu: ¡Bienvenido a Lantern Pro!
fa: به Lantern پرو خوش آمدید!
hi: Lantern प्रो में आपका स्वागत है!
ms: Selamat Datang ke Lantern Pro!
my: Lantern Pro သို့ ကြိုဆိုပါသည်!
ps: Lantern Pro ته ښه راغلاست!
ru: Добро пожаловать в Lantern Про!
th: ยินดีต้อนรับสู่ Lantern Pro!
tk: Lantern Pro hoş geldiňiz!
tr: Lantern Pro'ya Hoş Geldin!
vi: Chào mừng đến với Lantern Pro!
zh_cn: 欢迎使用蓝灯专业版!
zh_hk: 歡迎使用 Lantern 專業版

# lantern_pro_description
source: Your Pro features are unlocked—enjoy unlimited data, faster speeds, and premium servers.
ar: تم تفعيل ميزات برو الخاصة بك—استمتع ببيانات غير محدودة وسرعات أعلى وخوادم مميزة.
bn: আপনার প্রো ফিচারগুলি আনলক হয়েছে—আনলিমিটেড ডেটা, দ্রুত গতি এবং প্রিমিয়াম সার্ভার উপভোগ করুন।
es_cu: Tus funciones Pro están desbloqueadas—disfruta de datos ilimitados, velocidades más rápidas y servidores premium.
fa: امکانات پرو شما فعال شد. از داده نامحدود، سرعت بیشتر و سرورهای برتر لذت ببرید.
hi: आपकी प्रो सुविधाएं अनलॉक हो गई हैं—असीमित डेटा, तेज़ गति और प्रीमियम सर्वर का आनंद लें।
ms: Ciri Pro anda dibuka kunci—nikmati data tanpa had, kelajuan lebih pantas, dan pelayan premium.
my: သင့် Pro အင်္ဂါရပ်များကို သော့ဖွင့်ပြီးပါပြီ—ကန့်သတ်မရှိသော ဒေတာ၊ ပိုမြန်သော အမြန်နှုန်းနှင့် ပရီမီယံ ဆာဗာများကို ပျော်မွေ့ပါ။
ps: ستاسو د پرو ځانګړتیاوې خلاصې شوې دي - له نامحدود ډیټا، ګړندي سرعت، او پریمیم سرورونو څخه خوند واخلئ.
ru: Ваши Про функции разблокированы — пользуйтесь безлимитным трафиком, высокой скоростью и премиум-серверами.
th: ฟีเจอร์ Pro ของคุณปลดล็อกแล้ว—เพลิดเพลินกับข้อมูลไม่จำกัด, ความเร็วที่เร็วขึ้น, และเซิร์ฟเวอร์พรีเมียม
tk: Pro aýratynlyklarňyz açyldy - çäksiz maglumatlardan, has çalt tizlikden we premium serwerlerden lezzet alyň.
tr: Pro özellikleriniz açıldı—sınırsız veri, daha hızlı hız ve premium sunucuların keyfini çıkarın.
vi: Các tính năng Pro của bạn đã được mở khóa—tận hưởng dữ liệu không giới hạn, tốc độ nhanh hơn và máy chủ cao cấp.
zh_cn: 您的专业版功能已解锁——享受无限数据、更快速度和高级服务器。
zh_hk: 你的專業版功能已解鎖—盡情享受無限數據、更快速度和高級伺服器。

# plans_fetch_error
source: Error fetching plans. Please try again later.
ar: خطأ في جلب الخطط. يرجى المحاولة مرة أخرى لاحقًا.
bn: প্ল্যান আনতে ত্রুটি। পরে আবার চেষ্টা করুন।
es_cu: Error al cargar los planes. Por favor intenta de nuevo más tarde.
fa: خطا در دریافت طرح‌ها. بعداً دوباره امتحان کنید.
hi: प्लान लाने में त्रुटि। कृपया बाद में पुनः प्रयास करें।
ms: Ralat mendapatkan pelan. Sila cuba lagi kemudian.
my: အစီအစဉ်များကို ရယူရာတွင် အမှားအယွင်း။ နောက်မှ ထပ်စမ်းကြည့်ပါ။
ps: د پلانونو په راوړلو کې تېروتنه. مهرباني وکړئ وروسته بیا هڅه وکړئ.
ru: Ошибка загрузки планов. Пожалуйста, попробуйте позже.
th: เกิดข้อผิดพลาดในการดึงข้อมูลแผน กรุณาลองอีกครั้งในภายหลัง
tk: Planlar alyňanda ýalňyşlyk. Soňra täzeden synanyň.
tr: Planlar alınırken hata oluştu. Lütfen daha sonra tekrar deneyin.
vi: Lỗi khi tải gói dịch vụ. Vui lòng thử lại sau.
zh_cn: 获取套餐时出错。请稍后重试。
zh_hk: 取得方案時發生錯誤。請稍後再試。

source: Best Value!
ar: أفضل قيمة!
bn: সেরা মূল্য!
es_cu: ¡Mejor valorado!
fa: بهترین ارزش!
hi: सबसे अच्छा मूल्य!
ms: Nilai Terbaik!
my: အကောင်းဆုံး တန်ဖိုး!
ps: غوره ارزښت!
ru: Лучшее предложение!
th: คุ้มค่าที่สุด!
tk: Iň gowy bahasy!
tr: En İyi Değer!
vi: Giá trị tốt nhất!
zh_cn: 最超值!
zh_hk: 最超值

source: Choose Payment Method
ar: اختر طريقة الدفع
bn: পেমেন্ট মেথড বেছে নিন
es_cu: Elegir método de pago
fa: روش پرداخت را انتخاب کنید
hi: भुगतान विधि चुनें
ms: Pilih Kaedah Pembayaran
my: ငွေပေးချေမှု နည်းလမ်းကို ရွေးချယ်ပါ
ps: د تادیې طریقه غوره کړئ
ru: Выберите способ оплаты
th: เลือกวิธีการชำระเงิน
tk: Töleg usulyny saýlaň
tr: Ödeme Yöntemi Seç
vi: Chọn phương thức thanh toán
zh_cn: 选择支付方式
zh_hk: 選擇付款方式

# payment_information_encrypted
source: Your payment information is fully encrypted
ar: معلومات الدفع الخاصة بك مشفرة بالكامل.
bn: আপনার পেমেন্ট তথ্য সম্পূর্ণরূপে এনক্রিপ্টেড।
es_cu: Tu información de pago está completamente cifrada.
fa: اطلاعات پرداخت شما به طور کامل رمزگذاری شده است.
hi: आपकी भुगतान जानकारी पूरी तरह से एन्क्रिप्ट की गई है।
ms: Maklumat pembayaran anda disulitkan sepenuhnya.
my: သင့် ငွေပေးချေမှု အချက်အလက်များကို အပြည့်အဝ ကုဒ်ဝှက်ထားသည်။
ps: ستاسو د تادیې معلومات په بشپړه توګه کوډ شوي دي.
ru: Ваша платежная информация полностью зашифрована.
th: ข้อมูลการชำระเงินของคุณได้รับการเข้ารหัสอย่างสมบูรณ์
tk: Töleg maglumatlaryňyz doly şifrlenendir.
tr: Ödeme bilgileriniz tamamen şifrelenmiştir.
vi: Thông tin thanh toán của bạn được mã hóa hoàn toàn.
zh_cn: 您的支付信息已完全加密。
zh_hk: 你的付款資訊已完全加密。

# purchase_not_completed
source: Purchase was not completed. You can try again anytime, or contact support if you need help
ar: لم يكتمل الشراء. يمكنك المحاولة مرة أخرى في أي وقت، أو الاتصال بالدعم إذا كنت بحاجة إلى مساعدة
bn: ক্রয় সম্পূর্ণ হয়নি। আপনি যেকোনো সময় আবার চেষ্টা করতে পারেন, বা সাহায্যের প্রয়োজন হলে সাপোর্টের সাথে যোগাযোগ করুন
es_cu: La compra no se completó. Puedes intentar de nuevo en cualquier momento, o contactar a soporte si necesitas ayuda
fa: خرید تکمیل نشد. می‌توانید دوباره تلاش کنید یا اگر به کمک نیاز دارید با پشتیبانی تماس بگیرید
hi: खरीदारी पूरी नहीं हुई। आप किसी भी समय फिर से कोशिश कर सकते हैं, या यदि आपको मदद चाहिए तो सहायता से संपर्क करें
ms: Pembelian tidak selesai. Anda boleh cuba lagi pada bila-bila masa, atau hubungi sokongan jika anda perlukan bantuan
my: ဝယ်ယူမှု မပြီးစီးပါ။ သင် အချိန်မရွေး ထပ်စမ်းနိုင်သည်၊ သို့မဟုတ် အကူအညီလိုအပ်လျှင် ပံ့ပိုးမှုကို ဆက်သွယ်ပါ
ps: پیرود بشپړ نشو. تاسو کولی شئ هر وخت بیا هڅه وکړئ، یا که مرستې ته اړتیا لرئ د ملاتړ سره اړیکه ونیسئ
ru: Покупка не была завершена. Вы можете попробовать снова в любое время или обратиться в поддержку, если вам нужна помощь
th: การซื้อไม่เสร็จสมบูรณ์ คุณสามารถลองอีกครั้งได้ทุกเมื่อ หรือติดต่อฝ่ายสนับสนุนหากต้องการความช่วยเหลือ
tk: Satyn alma tamamlanmady. Islendik wagta täzeden synanyp bilersiňiz ýa-da kömek gerek bolsa goldaw bilen habarlaşyň
tr: Satın alma tamamlanmadı. İstediğiniz zaman tekrar deneyebilir veya yardıma ihtiyacınız varsa desteğe başvurabilirsiniz
vi: Giao dịch mua chưa hoàn tất. Bạn có thể thử lại bất kỳ lúc nào hoặc liên hệ bộ phận hỗ trợ nếu cần giúp đỡ
zh_cn: 购买未完成。您可以随时重试,如需帮助请联系支持团队
zh_hk: 購買未完成。你可以隨時重試,或如需協助請聯絡支援

source: Are you sure?
ar: هل أنت متأكد؟
bn: আপনি কি নিশ্চিত?
es_cu: ¿Estás seguro?
fa: مطمئنید؟
hi: क्या आप सुनिश्चित हैं?
ms: Adakah anda pasti?
my: သေချာပါသလား?
ps: ایا تاسو ډاډه یاست؟
ru: Вы уверены?
th: คุณแน่ใจหรือไม่?
tk: Siz ynamyňyz barmy?
tr: Emin misiniz?
vi: Bạn có chắc chắn?
zh_cn: 确定吗?
zh_hk: 你確定嗎?

# continue_without_email_message
source: A valid email address is required to use your subscription on other devices.
ar: مطلوب عنوان بريد إلكتروني صالح لاستخدام اشتراكك على أجهزة أخرى.
bn: অন্য ডিভাইসে আপনার সাবস্ক্রিপশন ব্যবহার করতে একটি বৈধ ইমেইল ঠিকানা প্রয়োজন।
es_cu: Se requiere una dirección de email válida para usar tu suscripción en otros dispositivos.
fa: برای استفاده از اشتراک‌تان روی دستگاه‌های دیگر، یک آدرس ایمیل معتبر الزامی است.
hi: अन्य डिवाइसों पर अपनी सब्सक्रिप्शन का उपयोग करने के लिए एक वैध ईमेल पता आवश्यक है।
ms: Alamat e-mel yang sah diperlukan untuk menggunakan langganan anda pada peranti lain.
my: မှန်ကန်သော အီးမေးလ်လိပ်စာသည် အခြားစက်ပစ္စည်းများတွင် သင့်စာရင်းသွင်းမှုကို အသုံးပြုရန် လိုအပ်သည်။
ps: په نورو وسایلو کې د خپل ګډون کارولو لپاره یوه معتبره بریښنالیک پته اړینه ده.
ru: Действующий адрес email необходим для использования подписки на других устройствах.
th: จำเป็นต้องมีที่อยู่อีเมลที่ถูกต้องเพื่อใช้การสมัครสมาชิกบนอุปกรณ์อื่น
tk: Başga enjamlarda abunalygyňyzy ulanmak üçin dogry e-poçta salgysy zerur.
tr: Aboneliğinizi diğer cihazlarda kullanmak için geçerli bir e-posta adresi gereklidir.
vi: Nếu bạn chọn tiếp tục mà không thêm email, bạn sẽ không thể dùng gói đăng ký trên thiết bị khác.
zh_cn: 需要有效的电子邮箱地址才能在其他设备上使用您的订阅。
zh_hk: 需要有效的電子郵件地址才能在其他裝置上使用你的訂閱。

source: Add Email
ar: إضافة بريد إلكتروني
bn: ইমেইল যোগ করুন
es_cu: Agregar Email
fa: افزودن ایمیل
hi: ईमेल जोड़ें
ms: Tambah E-mel
my: အီးမေးလ် ထည့်ပါ
ps: بریښنالیک اضافه کړئ
ru: Добавить email
th: เพิ่มอีเมล
tk: E-poçta goş
tr: E-posta Ekle
vi: Thêm email
zh_cn: 添加电子邮箱
zh_hk: 新增電子郵件

source: Block Ads
ar: حظر الإعلانات
bn: বিজ্ঞাপন ব্লক করুন
es_cu: Bloquear Anuncios
fa: مسدودسازی تبلیغات
hi: विज्ञापन ब्लॉक करें
ms: Sekat Iklan
my: ကြော်ငြာများကို ပိတ်ဆို့ပါ
ps: اعلانونه بند کړئ
ru: Блокировка рекламы
th: บล็อกโฆษณา
tk: Reklamalary blokla
tr: Reklamları Engelle
vi: Chặn quảng cáo
zh_cn: 屏蔽广告
zh_hk: 封鎖廣告

# only_active
source: Only active when VPN is connected
ar: نشط فقط عند الاتصال بـ VPN
bn: শুধুমাত্র ভিপিএন সংযুক্ত থাকলে সক্রিয়
es_cu: Solo activo cuando la VPN está conectada
fa: فقط هنگام اتصال VPN فعال است
hi: केवल तभी सक्रिय जब VPN कनेक्ट हो
ms: Hanya aktif apabila VPN disambungkan
my: VPN ချိတ်ဆက်ထားမှသာ အသက်ဝင်သည်
ps: یوازې هغه وخت فعال دی چې VPN وصل وي
ru: Активна только при подключении к VPN
th: ใช้งานได้เฉพาะเมื่อเชื่อมต่อ VPN
tk: Diňe VPN birikdirilende işjeň
tr: Yalnızca VPN bağlıyken aktif
vi: Chỉ hoạt động khi VPN được kết nối
zh_cn: 仅在 VPN 连接时生效
zh_hk: 僅在 VPN 連線時啟用

# vpn_connected
source: Lantern is now connected.
ar: تم الاتصال بـ Lantern الآن.
bn: Lantern এখন সংযুক্ত।
es_cu: Lantern está ahora conectado.
fa: Lantern اکنون متصل است.
hi: Lantern अब कनेक्ट हो गया है।
ms: Lantern kini disambungkan.
my: Lantern သည် ယခု ချိတ်ဆက်ပြီးပါပြီ။
ps: Lantern اوس وصل دی.
ru: Lantern подключен.
th: Lantern เชื่อมต่อแล้ว
tk: Lantern indi birikdirildi.
tr: Lantern şimdi bağlı.
vi: Lantern đã được kết nối.
zh_cn: 蓝灯已连接。
zh_hk: Lantern 現已連線。

# vpn_disconnected
source: Lantern is now disconnected.
ar: تم قطع الاتصال بـ Lantern الآن.
bn: Lantern এখন সংযোগ বিচ্ছিন্ন।
es_cu: Lantern está ahora desconectado.
fa: Lantern اکنون قطع شده است.
hi: Lantern अब डिस्कनेक्ट हो गया है।
ms: Lantern kini diputuskan.
my: Lantern သည် ယခု ချိတ်ဆက်မှု ဖြုတ်ပြီးပါပြီ။
ps: Lantern اوس قطع دی.
ru: Lantern отключен.
th: Lantern ยกเลิกการเชื่อมต่อแล้ว
tk: Lantern indi birikdirilmedi.
tr: Lantern şimdi bağlantısı kesildi.
vi: Lantern đã ngắt kết nối.
zh_cn: 蓝灯已断开连接。
zh_hk: Lantern 現已斷線。

source: Open Notification
ar: فتح الإشعار
bn: নোটিফিকেশন খুলুন
es_cu: Abrir Notificación
fa: باز کردن اعلان
hi: नोटिफिकेशन खोलें
ms: Buka Pemberitahuan
my: အကြောင်းကြားချက် ဖွင့်ပါ
ps: خبرتیا خلاصه کړئ
ru: Открыть уведомление
th: เปิดการแจ้งเตือน
tk: Habarnamany aç
tr: Bildirimi Aç
vi: Mở thông báo
zh_cn: 打开通知
zh_hk: 開啟通知

source: Logout
ar: تسجيل الخروج
bn: লগ আউট
es_cu: Cerrar Sesión
fa: خروج
hi: लॉगआउट
ms: Log Keluar
my: ထွက်ရန်
ps: وتل
ru: Выйти
th: ออกจากระบบ
tk: Çykmak
tr: Çıkış
vi: Đăng xuất
zh_cn: 退出登录
zh_hk: 登出

# logout_message
source: Logging out will switch Lantern to the free version. To access your account again, you will need to sign back in.
ar: سيؤدي تسجيل الخروج إلى تحويل Lantern إلى الإصدار المجاني. للوصول إلى حسابك مرة أخرى، ستحتاج إلى تسجيل الدخول مجددًا.
bn: লগ আউট করলে Lantern ফ্রি ভার্সনে পরিবর্তিত হবে। আবার আপনার অ্যাকাউন্ট অ্যাক্সেস করতে আপনাকে সাইন ইন করতে হবে।
es_cu: Cerrar sesión cambiará Lantern a la versión gratuita. Para acceder a tu cuenta nuevamente, deberás iniciar sesión de nuevo.
fa: با خروج، Lantern به نسخه رایگان تغییر می‌کند. برای دسترسی دوباره به حساب خود، باید مجدداً وارد شوید.
hi: लॉगआउट करने से Lantern मुफ्त संस्करण में बदल जाएगा। अपने अकाउंट को फिर से एक्सेस करने के लिए, आपको फिर से साइन इन करना होगा।
ms: Log keluar akan menukar Lantern kepada versi percuma. Untuk mengakses akaun anda semula, anda perlu log masuk kembali.
my: ထွက်ခြင်းသည် Lantern ကို အခမဲ့ ဗားရှင်းသို့ ပြောင်းပါမည်။ သင့်အကောင့်ကို ထပ်မံဝင်ရောက်ရန်၊ သင် ပြန်ဝင်ရောက်ရန် လိုအပ်ပါမည်။
ps: وتل به Lantern وړیا نسخې ته بدل کړي. د خپل حساب بیا لاسرسي لپاره، تاسو ته به اړتیا وي چې بیا ننوځئ.
ru: Выход переключит Lantern на бесплатную версию. Для доступа к вашему аккаунту снова потребуется повторный вход.
th: การออกจากระบบจะเปลี่ยน Lantern เป็นเวอร์ชันฟรี ในการเข้าถึงบัญชีของคุณอีกครั้ง คุณจะต้องลงชื่อเข้าใช้ใหม่
tk: Çykmak Lantern-i mugt wersiýasyna geçirer. Hasabyňyza täzeden girmek üçin täzeden girmeliňiz bolar.
tr: Çıkış yapmak Lantern'i ücretsiz sürüme geçirecektir. Hesabınıza tekrar erişmek için yeniden giriş yapmanız gerekecektir.
vi: Đăng xuất sẽ chuyển Lantern về phiên bản miễn phí. Để truy cập tài khoản của bạn lại, bạn sẽ cần đăng nhập lại.
zh_cn: 退出登录将使蓝灯切换到免费版本。要再次访问您的账户,您需要重新登录。
zh_hk: 登出後 Lantern 將切換至免費版本。若要再次存取你的帳號,你需要重新登入。

source: Not now
ar: ليس الآن
bn: এখন নয়
es_cu: Ahora no
fa: الان نه
hi: अभी नहीं
ms: Tidak sekarang
my: ယခုမဟုတ်ပါ
ps: اوس نه
ru: Не сейчас
th: ไม่ใช่ตอนนี้
tk: Häzir däl
tr: Şimdi Değil
vi: Để sau
zh_cn: 暂不
zh_hk: 暫時不要

source: Billed Once
ar: يُحاسب مرة واحدة
bn: একবার বিল করা হয়
es_cu: Cobrado Una Vez
fa: یک بار حساب می‌شود
hi: एक बार बिल
ms: Dibilkan Sekali
my: တစ်ကြိမ် ငွေတောင်းခံသည်
ps: یو ځل بیل شوی
ru: Одноразовый платеж
th: เรียกเก็บเงินครั้งเดียว
tk: Bir gezek tölenilýär
tr: Bir Kez Faturalandırılır
vi: Thanh toán một lần
zh_cn: 一次性付款
zh_hk: 單次計費

source: Subscription
ar: الاشتراك
bn: সাবস্ক্রিপশন
es_cu: Suscripción
fa: اشتراک
hi: सब्सक्रिप्शन
ms: Langganan
my: စာရင်းသွင်းမှု
ps: ګډون
ru: Подписка
th: การสมัครสมาชิก
tk: Abunalyk
tr: Abonelik
vi: Gói đăng ký
zh_cn: 订阅
zh_hk: 訂閱

source: Subscribe
ar: اشترك
bn: সাবস্ক্রাইব করুন
es_cu: Suscribirse
fa: اشتراک
hi: सब्सक्राइब करें
ms: Langgan
my: စာရင်းသွင်းပါ
ps: ګډون واخلئ
ru: Подписаться
th: สมัครสมาชิก
tk: Abuna bol
tr: Abone Ol
vi: Đăng ký
zh_cn: 订阅
zh_hk: 訂閱

source: Checkout
ar: الدفع
bn: চেকআউট
es_cu: Finalizar compra
fa: تسویه حساب
hi: चेकआउट
ms: Daftar Keluar
my: ငွေရှင်းရန်
ps: تادیه
ru: Оформить заказ
th: ชำระเงิน
tk: Hasap
tr: Ödeme
vi: Thanh toán
zh_cn: 结账
zh_hk: 結帳

source: Next Billing Date
ar: تاريخ الفوترة التالي
bn: পরবর্তী বিলিং তারিখ
es_cu: Próxima Fecha de Cobro
fa: تاریخ صورت‌حساب بعدی
hi: अगली बिलिंग तिथि
ms: Tarikh Bil Seterusnya
my: နောက်ထပ် ငွေတောင်းခံမည့်ရက်
ps: د بل بیل نیټه
ru: Следующая дата платежа
th: วันที่เรียกเก็บเงินครั้งถัดไป
tk: Indiki hasap senesi
tr: Sonraki Fatura Tarihi
vi: Ngày thanh toán tiếp theo
zh_cn: 下次扣费日期
zh_hk: 下次計費日期

source: VPN may be needed
ar: قد تحتاج إلى VPN
bn: ভিপিএন প্রয়োজন হতে পারে
es_cu: Es posible que se necesite la VPN
fa: ممکن است لازم باشد از VPN استفاده کنید
hi: VPN की आवश्यकता हो सकती है
ms: VPN mungkin diperlukan
my: VPN လိုအပ်နိုင်သည်
ps: VPN ته اړتیا کیدای شي
ru: Может потребоваться VPN
th: อาจต้องใช้ VPN
tk: VPN gerek bolup biler
tr: VPN gerekli olabilir
vi: Có thể cần VPN
zh_cn: 可能需要 VPN
zh_hk: 可能需要 VPN

# google_and_apple_sign_in_blocked
source: Google and Apple sign-in may be blocked in this region. To finish setting up your account, please turn on the VPN first.
ar: قد يكون تسجيل الدخول عبر Google و Apple محظورًا في هذه المنطقة. لإنهاء إعداد حسابك، يرجى تشغيل VPN أولاً.
bn: Google এবং Apple সাইন-ইন এই অঞ্চলে ব্লক করা থাকতে পারে। আপনার অ্যাকাউন্ট সেটআপ সম্পূর্ণ করতে, প্রথমে ভিপিএন চালু করুন।
es_cu: El inicio de sesión con Google y Apple puede estar bloqueado en esta región. Para terminar de configurar tu cuenta, por favor activa primero la VPN.
fa: ممکن است ورود با گوگل و اپل در این منطقه مسدود باشد. برای تکمیل راه‌اندازی حساب خود، لطفاً اول VPN را روشن کنید.
hi: इस क्षेत्र में Google और Apple साइन-इन ब्लॉक हो सकते हैं। अपने अकाउंट की सेटअप पूरी करने के लिए, कृपया पहले VPN चालू करें।
ms: Log masuk Google dan Apple mungkin disekat di wilayah ini. Untuk melengkapkan persediaan akaun anda, sila hidupkan VPN terlebih dahulu.
my: Google နှင့် Apple ဝင်ရောက်မှုကို ဤဒေသတွင် ပိတ်ဆို့ထားနိုင်သည်။ သင့်အကောင့်ကို အပြီးပြင်ဆင်ရန်၊ ကျေးဇူးပြု၍ ပထမဦးစွာ VPN ကို ဖွင့်ပါ။
ps: په دې سیمه کې د Google او Apple ننوتل ممکن بند وي. د خپل حساب د تنظیم بشپړولو لپاره، مهرباني وکړئ لومړی VPN فعال کړئ.
ru: Вход через Google и Apple может быть заблокирован в этом регионе. Чтобы завершить настройку аккаунта, сначала включите VPN.
th: การลงชื่อเข้าใช้ด้วย Google และ Apple อาจถูกบล็อกในภูมิภาคนี้ ในการตั้งค่าบัญชีของคุณให้เสร็จสมบูรณ์ กรุณาเปิด VPN ก่อน
tk: Bu sebitde Google we Apple giriş bloklanan bolup biler. Hasabyňyzy gutarmak üçin ilki bilen VPN-ni açyň.
tr: Google ve Apple ile giriş bu bölgede engellenmiş olabilir. Hesap kurulumunu tamamlamak için lütfen önce VPN'i açın.
vi: Đăng nhập bằng Google và Apple có thể bị chặn ở khu vực này. Để hoàn tất thiết lập tài khoản, vui lòng bật VPN trước.
zh_cn: 在此地区 Google 和 Apple 登录可能被屏蔽。要完成账户设置,请先开启 VPN。
zh_hk: 在此地區 Google 和 Apple 登入可能被封鎖。為完成帳號設定,請先開啟 VPN。

source: Continue without VPN
ar: المتابعة بدون VPN
bn: ভিপিএন ছাড়া চালিয়ে যান
es_cu: Continuar sin VPN
fa: ادامه بدون VPN
hi: VPN के बिना जारी रखें
ms: Teruskan tanpa VPN
my: VPN မပါဘဲ ဆက်လုပ်ပါ
ps: پرته له VPN دوام ورکړئ
ru: Продолжить без VPN
th: ดำเนินการต่อโดยไม่ใช้ VPN
tk: VPN-siz dowam et
tr: VPN Olmadan Devam Et
vi: Tiếp tục mà không có VPN
zh_cn: 不使用 VPN 继续
zh_hk: 不使用 VPN 繼續

source: Turn on VPN
ar: تشغيل VPN
bn: ভিপিএন চালু করুন
es_cu: Activar VPN
fa: روشن کردن VPN
hi: VPN चालू करें
ms: Hidupkan VPN
my: VPN ကို ဖွင့်ပါ
ps: VPN فعال کړئ
ru: Включить VPN
th: เปิด VPN
tk: VPN-ni aç
tr: VPN'i Aç
vi: Bật VPN
zh_cn: 开启 VPN
zh_hk: 開啟 VPN

# server_setup_do
source: Set up using Digital Ocean
ar: الإعداد باستخدام DigitalOcean
bn: DigitalOcean ব্যবহার করে সেটআপ করুন
es_cu: Configurar usando DigitalOcean
fa: راه‌اندازی با استفاده از DigitalOcean
hi: DigitalOcean का उपयोग करके सेट अप करें
ms: Sediakan menggunakan DigitalOcean
my: DigitalOcean အသုံးပြု၍ စနစ်ထည့်ပါ
ps: د DigitalOcean په کارولو سره تنظیم کړئ
ru: Настроить через DigitalOcean
th: ตั้งค่าโดยใช้ DigitalOcean
tk: DigitalOcean arkaly guruň
tr: DigitalOcean kullanarak kur
vi: Thiết lập sử dụng DigitalOcean
zh_cn: 使用 DigitalOcean 设置
zh_hk: 使用 DigitalOcean 設定

# server_setup_do_price
source: Only %s month through Digital Ocean
ar: فقط %s شهريًا عبر Digital Ocean
bn: DigitalOcean এর মাধ্যমে মাসে মাত্র %s
es_cu: Solo %s al mes a través de Digital Ocean
fa: فقط %s در ماه از طریق Digital Ocean
hi: Digital Ocean के माध्यम से केवल %s महीना
ms: Hanya %s sebulan melalui Digital Ocean
my: Digital Ocean မှတဆင့် တစ်လ %s သာ
ps: یوازې د DigitalOcean له لارې میاشتې %s
ru: Только %s в месяц через Digital Ocean
th: เพียง %s ต่อเดือนผ่าน Digital Ocean
tk: Digital Ocean arkaly diňe %s aýda
tr: Digital Ocean üzerinden ayda sadece %s
vi: Chỉ %s/tháng thông qua DigitalOcean
zh_cn: 通过 Digital Ocean 每月仅需 %s
zh_hk: 透過 DigitalOcean 每月只需 %s

# server_setup_gcp
source: Set up using Google Cloud Platform
ar: الإعداد باستخدام Google Cloud Platform
bn: Google Cloud Platform ব্যবহার করে সেটআপ করুন
es_cu: Configurar usando Google Cloud Platform
fa: راه‌اندازی با استفاده از Google Cloud Platform
hi: Google Cloud Platform का उपयोग करके सेट अप करें
ms: Sediakan menggunakan Google Cloud Platform
my: Google Cloud Platform အသုံးပြု၍ စနစ်ထည့်ပါ
ps: د Google Cloud Platform په کارولو سره تنظیم کړئ
ru: Настроить через Google Cloud Platform
th: ตั้งค่าโดยใช้ Google Cloud Platform
tk: Google Cloud Platform arkaly guruň
tr: Google Cloud Platform kullanarak kur
vi: Thiết lập sử dụng Google Cloud Platform
zh_cn: 使用 Google Cloud Platform 设置
zh_hk: 使用 Google Cloud Platform 設定
