Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

# choose_google_account
source: Choose Google billing account
ar: اختر حساب فوترة Google
bn: Google বিলিং অ্যাকাউন্ট বেছে নিন
es_cu: Elige cuenta de facturación de Google
fa: حساب صورت‌حساب گوگل را برگزینید
hi: Google बिलिंग अकाउंट चुनें
ms: Pilih akaun bil Google
my: Google ငွေတောင်းခံမှု အကောင့် ရွေးပါ
ps: د Google د بیل حساب غوره کړئ
ru: Выберите платежный аккаунт Google
th: เลือกบัญชีการเรียกเก็บเงิน Google
tk: Google hasap hesabyny saýlaň
tr: Google fatura hesabı seç
vi: Chọn tài khoản thanh toán Google
zh_cn: 选择 Google 账单账户
zh_hk: 選擇 Google 帳單帳號

# server_name_placeholder
source: Derek’s Server
ar: خادم ديريك
bn: ডেরেকের সার্ভার
es_cu: Servidor de Derek
fa: سرور احسان
hi: देरेक का सर्वर
ms: Pelayan Saya
my: Derek ရဲ့ ဆာဗာ
ps: د ډیریک سرور
ru: Сервер Дмитрия
th: เซิร์ฟเวอร์ของเดเร็ค
tk: Deregiň serweri
tr: Mehmet'in Sunucusu
vi: Máy chủ của Derek
zh_cn: Derek 的服务器
zh_hk: Derek 的伺服器

source: Change
ar: تغيير
bn: পরিবর্তন করুন
es_cu: Cambiar
fa: تغییر
hi: बदलें
ms: Ubah
my: ပြောင်းရန်
ps: بدل کړئ
ru: Изменить
th: เปลี่ยน
tk: Üýtget
tr: Değiştir
vi: Thay đổi
zh_cn: 更改
zh_hk: 變更

source: Choose Location
ar: اختر الموقع
bn: লোকেশন বেছে নিন
es_cu: Elegir Ubicación
fa: انتخاب مکان
hi: स्थान चुनें
ms: Pilih Lokasi
my: တည်နေရာ ရွေးပါ
ps: موقعیت غوره کړئ
ru: Выбрать расположение
th: เลือกตำแหน่ง
tk: Ýerleşiş saýla
tr: Konum Seç
vi: Chọn vị trí
zh_cn: 选择位置
zh_hk: 選擇位置

source: Choose Your Location
ar: اختر موقعك
bn: আপনার লোকেশন বেছে নিন
es_cu: Elige tu Ubicación
fa: مکان خود را انتخاب کنید
hi: अपना स्थान चुनें
ms: Pilih Lokasi Anda
my: သင့်တည်နေရာကို ရွေးပါ
ps: خپل موقعیت غوره کړئ
ru: Выберите ваше расположение
th: เลือกตำแหน่งของคุณ
tk: Ýerleşişiňizi saýlaň
tr: Konumunu Seç
vi: Chọn vị trí của bạn
zh_cn: 选择您的位置
zh_hk: 選擇你的位置

source: Start Deployment
ar: بدء النشر
bn: ডিপ্লয়মেন্ট শুরু করুন
es_cu: Iniciar Despliegue
fa: شروع استقرار
hi: डिप्लॉयमेंट शुरू करें
ms: Mula Pelancaran
my: ဖြန့်ကျက်မှု စတင်ပါ
ps: ځای پرځای کول پیل کړئ
ru: Начать развертывание
th: เริ่มการติดตั้ง
tk: Ýerleşdirişi başla
tr: Dağıtımı Başlat
vi: Bắt đầu triển khai
zh_cn: 开始部署
zh_hk: 開始部署

# server_name_description
source: How the server will appear in the server selection list.
ar: كيف سيظهر الخادم في قائمة اختيار الخادم.
bn: সার্ভার নির্বাচন তালিকায় সার্ভারটি যেভাবে প্রদর্শিত হবে।
es_cu: Cómo aparecerá el servidor en la lista de selección de servidores.
fa: نحوه نمایش در فهرست انتخاب سرور.
hi: सर्वर चयन सूची में सर्वर कैसे दिखाई देगा।
ms: Bagaimana pelayan akan muncul dalam senarai pemilihan pelayan.
my: ဆာဗာရွေးချယ်မှု စာရင်းတွင် ဆာဗာ ပေါ်လာမည့်ပုံစံ။
ps: څنګه به سرور د سرور د انتخاب په لیست کې څرګندیږي.
ru: Как сервер будет отображаться в списке выбора серверов.
th: วิธีที่เซิร์ฟเวอร์จะปรากฏในรายการเลือกเซิร์ฟเวอร์
tk: Serwer saýlama sanawynda serwer nähili görner.
tr: Sunucunun sunucu seçim listesinde nasıl görüneceği.
vi: Cách máy chủ sẽ xuất hiện trong danh sách chọn máy chủ.
zh_cn: 服务器在服务器选择列表中的显示名称。
zh_hk: 伺服器在伺服器選擇清單中顯示的名稱。

# select_private_server_region
source: Select a region for your Private Server. Closer locations may improve speed and latency.
ar: اختر منطقة لخادمك الخاص. قد تؤدي المواقع الأقرب إلى تحسين السرعة وتقليل زمن الاستجابة.
bn: আপনার প্রাইভেট সার্ভারের জন্য একটি অঞ্চল নির্বাচন করুন। কাছাকাছি লোকেশন গতি এবং লেটেন্সি উন্নত করতে পারে।
es_cu: Selecciona una región para tu Servidor Privado. Ubicaciones más cercanas pueden mejorar la velocidad y latencia.
fa: یک منطقه برای سرور خصوصی خود انتخاب کنید. انتخاب نقاط نزدیک‌تر احتمالا در بهبودی سرعت و تأخیر مؤثرند.
hi: अपने निजी सर्वर के लिए एक क्षेत्र चुनें। करीबी स्थान गति और लेटेंसी में सुधार कर सकते हैं।
ms: Pilih wilayah untuk Pelayan Peribadi anda. Lokasi yang lebih dekat mungkin meningkatkan kelajuan dan kependaman.
my: သင့် ကိုယ်ပိုင်ဆာဗာ အတွက် ဒေသတစ်ခု ရွေးချယ်ပါ။ ပိုနီးသော တည်နေရာများက အမြန်နှုန်းနှင့် နှောင့်နှေးမှုကို တိုးတက်စေနိုင်သည်။
ps: د خپل شخصي سرور لپاره یوه سیمه غوره کړئ. نږدې موقعیتونه ممکن سرعت او وقفه ښه کړي.
ru: Выберите регион для вашего частного сервера. Более близкие расположения могут улучшить скорость и задержку.
th: เลือกภูมิภาคสำหรับเซิร์ฟเวอร์ส่วนตัวของคุณ ตำแหน่งที่ใกล้กว่าอาจช่วยปรับปรุงความเร็วและเวลาแฝง
tk: Hususy serweriňiz üçin sebiti saýlaň. Ýakyn ýerleşişler tizlik we gijikdirme gowulaşdyryp biler.
tr: Özel Sunucunuz için bir bölge seçin. Daha yakın konumlar hız ve gecikmeyi iyileştirebilir.
vi: Chọn khu vực cho máy chủ riêng của bạn. Vị trí gần hơn có thể cải thiện tốc độ và độ trễ.
zh_cn: 为您的私有服务器选择区域。距离较近的位置可能会提高速度并降低延迟。
zh_hk: 選擇私人伺服器的區域。較近的位置可能會提升速度並降低延遲。

# gcp_location_options
source: Google Cloud Platform Location Options (%d):
ar: خيارات مواقع Google Cloud Platform ‏(%d):
bn: Google Cloud Platform লোকেশন অপশন (%d):
es_cu: Opciones de Ubicación de Google Cloud Platform (%d):
fa: گزینه‌های مکان Google Cloud Platform (%d):
hi: Google Cloud Platform स्थान विकल्प (%d):
ms: Pilihan Lokasi Google Cloud Platform (%d):
my: Google Cloud Platform တည်နေရာ ရွေးချယ်စရာများ (%d)-
ps: د Google Cloud Platform د موقعیت اختیارونه (%d):
ru: Варианты расположения Google Cloud Platform (%d):
th: ตัวเลือกตำแหน่ง Google Cloud Platform (%d):
tk: Google Cloud Platform ýerleşiş wariantlary (%d):
tr: Google Cloud Platform Konum Seçenekleri (%d):
vi: Tùy chọn vị trí Google Cloud Platform (%d):
zh_cn: Google Cloud Platform 位置选项 (%d):
zh_hk: Google Cloud Platform 位置選項 (%d):

source: Australia - Sydney
ar: أستراليا - سيدني
bn: অস্ট্রেলিয়া - সিডনি
es_cu: Australia - Sídney
fa: استرالیا - سیدنی
hi: ऑस्ट्रेलिया - सिडनी
my: ဩစတြေးလျ - ဆစ်ဒနီ
ps: استرالیا - سیډني
ru: Австралия - Сидней
th: ออสเตรเลีย - ซิดนีย์
tk: Awstraliýa - Sidneý
tr: Avustralya - Sidney
vi: Úc - Sydney
zh_cn: 澳大利亚 - 悉尼
zh_hk: 澳洲 - 雪梨

source: Belgium - St. Ghislain
ar: بلجيكا - سانت جيسلان
bn: বেলজিয়াম - সেন্ট গিসলেন
es_cu: Bélgica - St. Ghislain
fa: بلژیک - سنت گیسلین
hi: बेल्जियम - सेंट घिसलैन
my: ဘယ်လ်ဂျီယမ် - စိန့်ကစလိန်း
ps: بلجیم - سینټ ګیسلین
ru: Бельгия - Сент-Гислен
th: เบลเยียม - เซนต์กีแล็ง
tk: Belgiýa - St. Ghislain
tr: Belçika - St. Ghislain
vi: Bỉ - St. Ghislain
zh_cn: 比利时 - 圣吉斯兰
zh_hk: 比利時 - 聖吉斯蘭

# brazil_saopaulo
source: São Paulo
ar: ساو باولو
bn: সাও পাওলো
fa: سائوپائولو
hi: साओ पाउलो
my: ဆောင်ပေါလို
ps: ساو پاولو
ru: Сан-Паулу
th: เซาเปาลู
tk: San-Paulu
zh_cn: 圣保罗
zh_hk: 巴西 - 聖保羅

source: US - Los Angeles
ar: الولايات المتحدة - لوس أنجلوس
bn: US - লস অ্যাঞ্জেলেস
es_cu: EE.UU. - Los Ángeles
fa: ایالات متحده - لس آنجلس
hi: यूएस - लॉस एंजिल्स
ms: AS - Los Angeles
my: အမေရိကန် - လော့စ်အိန်ဂျလိစ်
ps: امریکا - لاس انجلس
ru: США - Лос-Анджелес
th: สหรัฐอเมริกา - ลอสแองเจลิส
tk: ABŞ - Los Anjeles
tr: ABD - Los Angeles
vi: Mỹ - Los Angeles
zh_cn: 美国 - 洛杉矶
zh_hk: 美國 - 洛杉磯

source: Japan - Tokyo
ar: اليابان - طوكيو
bn: জাপান - টোকিও
es_cu: Japón - Tokio
fa: ژاپن - توکیو
hi: जापान - टोक्यो
ms: Jepun - Tokyo
my: ဂျပန် - တိုကျို
ps: جاپان - توکیو
ru: Япония - Токио
th: ญี่ปุ่น - โตเกียว
tk: Ýaponiýa - Tokio
tr: Japonya - Tokyo
vi: Nhật Bản - Tokyo
zh_cn: 日本 - 东京
zh_hk: 日本 - 東京

source: Deploying Private Server
ar: نشر الخادم الخاص
bn: প্রাইভেট সার্ভার ডিপ্লয় করা হচ্ছে
es_cu: Desplegando Servidor Privado
fa: در حال استقرار سرور خصوصی
hi: निजी सर्वर डिप्लॉय हो रहा है
ms: Melancarkan Pelayan Peribadi
my: ကိုယ်ပိုင်ဆာဗာကို ဖြန့်ကျက်နေသည်
ps: شخصي سرور ځای پر ځای کیږي
ru: Развертывание частного сервера
th: กำลังติดตั้งเซิร์ฟเวอร์ส่วนตัว
tk: Hususy serwer ýerleşdirilýär
tr: Özel Sunucu Dağıtılıyor
vi: Đang triển khai máy chủ riêng
zh_cn: 正在部署私有服务器
zh_hk: 正在部署私人伺服器

# deploying_server_status
source: Hang tight! Your Private Server is being set up. This may take a few minutes.
ar: يرجى الانتظار قليلاً! يتم إعداد خادمك الخاص. قد يستغرق هذا بضع دقائق.
bn: অপেক্ষা করুন! আপনার প্রাইভেট সার্ভার সেটআপ করা হচ্ছে। এতে কয়েক মিনিট সময় লাগতে পারে।
es_cu: ¡Espera un momento! Tu Servidor Privado se está configurando. Esto puede tomar unos minutos.
fa: صبور باشید! سرور خصوصی شما در حال راه‌اندازی است. این کار ممکن است چند دقیقه طول بکشد.
hi: धैर्य रखें! आपका निजी सर्वर सेट अप हो रहा है। इसमें कुछ मिनट लग सकते हैं।
ms: Tunggu sebentar! Pelayan Peribadi anda sedang disediakan. Ini mungkin mengambil beberapa minit.
my: စိတ်ရှည်ပါ! သင့် ကိုယ်ပိုင်ဆာဗာကို စနစ်ထည့်နေပါသည်။ မိနစ်အနည်းငယ် ကြာနိုင်ပါသည်။
ps: صبر وکړئ! ستاسو شخصي سرور تنظیمیږي. دا ممکن څو دقیقې ونیسي.
ru: Подождите немного! Ваш частный сервер настраивается. Это может занять несколько минут.
th: รอสักครู่! เซิร์ฟเวอร์ส่วนตัวของคุณกำลังถูกตั้งค่า อาจใช้เวลาสักครู่
tk: Sabyr ediň! Hususy serweriňiz gurulýar. Bu birnäçe minut alyp biler.
tr: Sabırlı ol! Özel Sunucun kuruluyor. Bu birkaç dakika sürebilir.
vi: Vui lòng đợi! Máy chủ riêng của bạn đang được thiết lập. Quá trình này có thể mất vài phút.
zh_cn: 请稍候!您的私有服务器正在设置中。这可能需要几分钟。
zh_hk: 稍等片刻!你的私人伺服器正在設定中。這可能需要幾分鐘。

source: Confirm Server Fingerprint
ar: تأكيد بصمة الخادم
bn: সার্ভার ফিঙ্গারপ্রিন্ট নিশ্চিত করুন
es_cu: Confirmar Huella del Servidor
fa: تأیید اثر انگشت سرور
hi: सर्वर फिंगरप्रिंट की पुष्टि करें
ms: Sahkan Cap Jari Pelayan
my: ဆာဗာ လက်ဗွေရာ အတည်ပြုပါ
ps: د سرور ګوتې نښه تایید کړئ
ru: Подтвердить отпечаток сервера
th: ยืนยันลายนิ้วมือของเซิร์ฟเวอร์
tk: Serwer barmak yzyny tassykla
tr: Sunucu Parmak İzini Onayla
vi: Xác nhận dấu vân tay máy chủ
zh_cn: 确认服务器指纹
zh_hk: 確認伺服器指紋

source: Server Fingerprint
ar: بصمة الخادم
bn: সার্ভার ফিঙ্গারপ্রিন্ট
es_cu: Huella del Servidor
fa: اثر انگشت سرور
hi: सर्वर फिंगरप्रिंट
ms: Cap Jari Pelayan
my: ဆာဗာ လက်ဗွေရာ
ps: د سرور ګوتې نښه
ru: Отпечаток сервера
th: ลายนิ้วมือของเซิร์ฟเวอร์
tk: Serwer barmak yzy
tr: Sunucu Parmak İzi
vi: Dấu vân tay máy chủ
zh_cn: 服务器指纹
zh_hk: 伺服器指紋

source: Confirm Fingerprint
ar: تأكيد البصمة
bn: ফিঙ্গারপ্রিন্ট নিশ্চিত করুন
es_cu: Confirmar Huella
fa: تأیید اثر انگشت
hi: फिंगरप्रिंट की पुष्टि करें
ms: Sahkan Cap Jari
my: လက်ဗွေရာ အတည်ပြုပါ
ps: ګوتې نښه تایید کړئ
ru: Подтвердить отпечаток
th: ยืนยันลายนิ้วมือ
tk: Barmak yzyny tassykla
tr: Parmak İzini Onayla
vi: Xác nhận dấu vân tay
zh_cn: 确认指纹
zh_hk: 確認指紋

# private_server_setup_in_progress
source: Hang tight! Your Private Server is being set up. This may take a few minutes, please keep this screen open.
ar: يرجى الانتظار قليلاً! يتم إعداد خادمك الخاص. قد يستغرق هذا بضع دقائق، يرجى إبقاء هذه الشاشة مفتوحة.
bn: অপেক্ষা করুন! আপনার প্রাইভেট সার্ভার সেটআপ করা হচ্ছে। এতে কয়েক মিনিট সময় লাগতে পারে, এই স্ক্রিন খোলা রাখুন।
es_cu: ¡Espera un momento! Tu Servidor Privado se está configurando. Esto puede tomar unos minutos, por favor mantén esta pantalla abierta.
fa: صبور باشید! سرور خصوصی شما در حال راه‌اندازی است. این کار ممکن است چند دقیقه طول بکشد، لطفاً این صفحه را نبندید.
hi: धैर्य रखें! आपका निजी सर्वर सेट अप हो रहा है। इसमें कुछ मिनट लग सकते हैं, कृपया यह स्क्रीन खुली रखें।
ms: Tunggu sebentar! Pelayan Peribadi anda sedang disediakan. Ini mungkin mengambil beberapa minit, sila biarkan skrin ini terbuka.
my: စိတ်ရှည်ပါ! သင့် ကိုယ်ပိုင်ဆာဗာကို စနစ်ထည့်နေပါသည်။ မိနစ်အနည်းငယ် ကြာနိုင်ပါသည်၊ ကျေးဇူးပြု၍ ဒီမျက်နှာကို ဖွင့်ထားပါ။
ps: صبر وکړئ! ستاسو شخصي سرور تنظیمیږي. دا ممکن څو دقیقې ونیسي، مهرباني وکړئ دا پرده خلاصه وساتئ.
ru: Подождите немного! Ваш частный сервер настраивается. Это может занять несколько минут, пожалуйста, не закрывайте этот экран.
th: รอสักครู่! เซิร์ฟเวอร์ส่วนตัวของคุณกำลังถูกตั้งค่า อาจใช้เวลาสักครู่ กรุณาเปิดหน้าจอนี้ไว้
tk: Sabyr ediň! Hususy serweriňiz gurulýar. Bu birnäçe minut alyp biler, şu ekrany açyk saklaň.
tr: Sabırlı ol! Özel Sunucun kuruluyor. Bu birkaç dakika sürebilir, lütfen bu ekranı açık tutun.
vi: Vui lòng đợi! Máy chủ riêng của bạn đang được thiết lập. Quá trình này có thể mất vài phút, vui lòng giữ màn hình này mở.
zh_cn: 请稍候!您的私有服务器正在设置中。这可能需要几分钟,请保持此屏幕打开。
zh_hk: 稍等片刻!你的私人伺服器正在設定中。這可能需要幾分鐘,請保持此畫面開啟。

source: Cancel Server Deployment
ar: إلغاء نشر الخادم
bn: সার্ভার ডিপ্লয়মেন্ট বাতিল করুন
es_cu: Cancelar Despliegue del Servidor
fa: لغو استقرار سرور
hi: सर्वर डिप्लॉयमेंट रद्द करें
ms: Batalkan Pelancaran Pelayan
my: ဆာဗာ ဖြန့်ကျက်မှု ပယ်ဖျက်ပါ
ps: د سرور ځای پر ځای کول لغوه کړئ
ru: Отменить развертывание сервера
th: ยกเลิกการติดตั้งเซิร์ฟเวอร์
tk: Serwer ýerleşdirmesini ýatyr
tr: Sunucu Dağıtımını İptal Et
vi: Hủy triển khai máy chủ
zh_cn: 取消服务器部署
zh_hk: 取消伺服器部署

# server_ready_title
source: Private Server is Ready
ar: الخادم الخاص جاهز
bn: প্রাইভেট সার্ভার প্রস্তুত
es_cu: Servidor Privado Está Listo
fa: سرور خصوصی آماده است
hi: निजी सर्वर तैयार है
ms: Pelayan Peribadi Sudah Sedia
my: ကိုယ်ပိုင်ဆာဗာ အဆင်သင့်ဖြစ်ပါပြီ
ps: شخصي سرور چمتو دی
ru: Частный сервер готов
th: เซิร์ฟเวอร์ส่วนตัวพร้อมแล้ว
tk: Hususy serwer taýýar
tr: Özel Sunucu Hazır
vi: Máy chủ riêng đã sẵn sàng
zh_cn: 私有服务器已就绪
zh_hk: 私人伺服器已就緒

# server_ready_message
source: Your Private Server has been set up and added to your server list. You're ready to connect!
ar: تم إعداد خادمك الخاص وإضافته إلى قائمة الخوادم الخاصة بك. أنت جاهز للاتصال!
bn: আপনার প্রাইভেট সার্ভার সেটআপ করা হয়েছে এবং আপনার সার্ভার তালিকায় যোগ করা হয়েছে। আপনি সংযোগ করতে প্রস্তুত!
es_cu: Tu Servidor Privado ha sido configurado y agregado a tu lista de servidores. ¡Estás listo para conectarte!
fa: سرور خصوصی شما راه‌اندازی و به فهرست سرورهای شما اضافه شد. شما آماده اتصالید!
hi: आपका निजी सर्वर सेट अप हो गया है और आपकी सर्वर सूची में जोड़ दिया गया है। आप कनेक्ट करने के लिए तैयार हैं!
ms: Pelayan Peribadi anda telah disediakan dan ditambah ke senarai pelayan anda. Anda sudah bersedia untuk menyambung!
my: သင့် ကိုယ်ပိုင်ဆာဗာကို စနစ်ထည့်ပြီး သင့်ဆာဗာစာရင်းသို့ ထည့်ပြီးပါပြီ။ ချိတ်ဆက်ရန် အဆင်သင့်ဖြစ်ပါပြီ!
ps: ستاسو شخصي سرور تنظیم او ستاسو د سرور لیست ته اضافه شوی دی. تاسو د وصل کولو لپاره چمتو یاست!
ru: Ваш частный сервер настроен и добавлен в список серверов. Вы готовы подключиться!
th: เซิร์ฟเวอร์ส่วนตัวของคุณถูกตั้งค่าเรียบร้อยแล้วและเพิ่มเข้าในรายการเซิร์ฟเวอร์ของคุณ คุณพร้อมที่จะเชื่อมต่อแล้ว!
tk: Hususy serweriňiz guruldy we serwer sanawyňyza goşuldy. Birikdirmäge taýýarsiňyz!
tr: Özel Sunucunuz kuruldu ve sunucu listenize eklendi. Bağlanmaya hazırsınız!
vi: Máy chủ riêng của bạn đã được thiết lập và thêm vào danh sách máy chủ. Bạn đã sẵn sàng để kết nối!
zh_cn: 您的私有服务器已设置完成并添加到服务器列表中。您可以开始连接了!
zh_hk: 你的私人伺服器已設定完成並新增至你的伺服器清單。你已準備好連線!

# server_failed_message
source: Something went wrong while setting up your Private Server. You can retry or try again later.
ar: حدث خطأ ما أثناء إعداد خادمك الخاص. يمكنك المحاولة مرة أخرى أو المحاولة لاحقًا.
bn: আপনার প্রাইভেট সার্ভার সেটআপ করার সময় কিছু ভুল হয়েছে। আপনি পুনরায় চেষ্টা করতে পারেন বা পরে আবার চেষ্টা করতে পারেন।
es_cu: Algo salió mal al configurar tu Servidor Privado. Puedes reintentar o intentar de nuevo más tarde.
fa: در راه‌اندازی سرور خصوصی شما مشکلی پیش آمد. می‌توانید دوباره تلاش یا بعداً امتحان کنید.
hi: आपके निजी सर्वर को सेट अप करते समय कुछ गड़बड़ी हुई। आप फिर से प्रयास कर सकते हैं या बाद में फिर से कोशिश कर सकते हैं।
ms: Ada masalah semasa menyediakan Pelayan Peribadi anda. Anda boleh cuba semula atau cuba lagi kemudian.
my: သင့် ကိုယ်ပိုင်ဆာဗာကို စနစ်ထည့်ရာတွင် တစ်ခုခု မှားယွင်းသွားပါသည်။ သင် ထပ်စမ်းနိုင်သည် သို့မဟုတ် နောက်မှ ထပ်စမ်းကြည့်ပါ။
ps: ستاسو د شخصي سرور د تنظیم په وخت کې یو څه تېروتنه شوې وي. تاسو کولی شئ بیا هڅه وکړئ یا وروسته بیا هڅه وکړئ.
ru: Что-то пошло не так при настройке вашего частного сервера. Вы можете попробовать снова или попробовать позже.
th: มีบางอย่างผิดพลาดขณะตั้งค่าเซิร์ฟเวอร์ส่วนตัวของคุณ คุณสามารถลองใหม่อีกครั้งหรือลองอีกครั้งในภายหลัง
tk: Hususy serweriňizi gurmakda bir zat nädogry boldy. Täzeden synanyp ýa-da soňra täzeden synanyp bilersiňiz.
tr: Özel Sunucunuzu kurarken bir sorun oluştu. Yeniden deneyebilir veya daha sonra tekrar deneyebilirsiniz.
vi: Đã xảy ra lỗi khi thiết lập máy chủ riêng của bạn. Bạn có thể thử lại hoặc thử lại sau.
zh_cn: 设置私有服务器时出现问题。您可以重试或稍后再试。
zh_hk: 設定私人伺服器時發生問題。你可以重試或稍後再試。

source: Close
ar: إغلاق
bn: বন্ধ করুন
es_cu: Cerrar
fa: بستن
hi: बंद करें
ms: Tutup
my: ပိတ်ပါ
ps: تړل
ru: Закрыть
th: ปิด
tk: Ýap
tr: Kapat
vi: Đóng
zh_cn: 关闭
zh_hk: 關閉

source: Connect Now
ar: الاتصال الآن
bn: এখনই সংযোগ করুন
es_cu: Conectar Ahora
fa: اکنون متصل شوید
hi: अभी कनेक्ट करें
ms: Sambung Sekarang
my: ယခု ချိတ်ဆက်ပါ
ps: اوس وصل کړئ
ru: Подключиться сейчас
th: เชื่อมต่อตอนนี้
tk: Häzir birikdir
tr: Şimdi Bağlan
vi: Kết nối ngay
zh_cn: 立即连接
zh_hk: 立即連線

source: Server Setup Failed
ar: فشل إعداد الخادم
bn: সার্ভার সেটআপ ব্যর্থ হয়েছে
es_cu: Falló la Configuración del Servidor
fa: راه‌اندازی سرور ناموفق بود
hi: सर्वर सेटअप विफल रहा
ms: Persediaan Pelayan Gagal
my: ဆာဗာ စနစ်ထည့်မှု မအောင်မြင်ပါ
ps: د سرور تنظیم ناکام شو
ru: Ошибка настройки сервера
th: การตั้งค่าเซิร์ฟเวอร์ล้มเหลว
tk: Serwer gurnama başartmady
tr: Sunucu Kurulumu Başarısız
vi: Thiết lập máy chủ thất bại
zh_cn: 服务器设置失败
zh_hk: 伺服器設定失敗

source: Cancel Deployment
ar: إلغاء النشر
bn: ডিপ্লয়মেন্ট বাতিল করুন
es_cu: Cancelar Despliegue
fa: لغو استقرار
hi: डिप्लॉयमेंट रद्द करें
ms: Batalkan Pelancaran
my: ဖြန့်ကျက်မှု ပယ်ဖျက်ပါ
ps: ځای پر ځای کول لغوه کړئ
ru: Отменить развертывание
th: ยกเลิกการติดตั้ง
tk: Ýerleşdirmäni ýatyr
tr: Dağıtımı İptal Et
vi: Hủy triển khai
zh_cn: 取消部署
zh_hk: 取消部署

# server_setup_failed_message
source: Something went wrong while setting up your Private Server. You can retry or try again later..
ar: حدث خطأ ما أثناء إعداد خادمك الخاص. يمكنك المحاولة مرة أخرى أو المحاولة لاحقًا.
bn: আপনার প্রাইভেট সার্ভার সেটআপ করার সময় কিছু ভুল হয়েছে। আপনি পুনরায় চেষ্টা করতে পারেন বা পরে আবার চেষ্টা করতে পারেন।
es_cu: Algo salió mal al configurar tu Servidor Privado. Puedes reintentar o intentar de nuevo más tarde.
fa: در راه‌اندازی سرور خصوصی شما مشکلی پیش آمد. می‌توانید دوباره تلاش یا بعداً امتحان کنید.
hi: आपके निजी सर्वर को सेट अप करते समय कुछ गड़बड़ी हुई। आप फिर से प्रयास कर सकते हैं या बाद में फिर से कोशिश कर सकते हैं।
ms: Ada masalah semasa menyediakan Pelayan Peribadi anda. Anda boleh cuba semula atau cuba lagi kemudian.
my: သင့် ကိုယ်ပိုင်ဆာဗာကို စနစ်ထည့်ရာတွင် တစ်ခုခု မှားယွင်းသွားပါသည်။ သင် ထပ်စမ်းနိုင်သည် သို့မဟုတ် နောက်မှ ထပ်စမ်းကြည့်ပါ။
ps: ستاسو د شخصي سرور د تنظیم په وخت کې یو څه تېروتنه شوې وي. تاسو کولی شئ بیا هڅه وکړئ یا وروسته بیا هڅه وکړئ.
ru: Что-то пошло не так при настройке вашего частного сервера. Вы можете попробовать снова или попробовать позже.
th: มีบางอย่างผิดพลาดขณะตั้งค่าเซิร์ฟเวอร์ส่วนตัวของคุณ คุณสามารถลองใหม่อีกครั้งหรือลองอีกครั้งในภายหลัง
tk: Hususy serweriňizi gurmakda bir zat nädogry boldy. Täzeden synanyp ýa-da soňra täzeden synanyp bilersiňiz.
tr: Özel Sunucunuzu kurarken bir sorun oluştu. Yeniden deneyebilir veya daha sonra tekrar deneyebilirsiniz.
vi: Đã xảy ra lỗi khi thiết lập máy chủ riêng của bạn. Bạn có thể thử lại hoặc thử lại sau.
zh_cn: 设置私有服务器时出现问题。您可以重试或稍后再试。
zh_hk: 設定私人伺服器時發生問題。你可以重試或稍後再試。

source: Exit
ar: خروج
bn: প্রস্থান করুন
es_cu: Salir
fa: خروج
hi: बाहर निकलें
ms: Keluar
my: ထွက်ရန်
ps: وتل
ru: Выход
th: ออก
tk: Çyk
tr: Çıkış
vi: Thoát
zh_cn: 退出
zh_hk: 離開

source: Retry
ar: إعادة المحاولة
bn: পুনরায় চেষ্টা করুন
es_cu: Reintentar
fa: تلاش مجدد
hi: फिर से प्रयास करें
ms: Cuba Semula
my: ထပ်စမ်းပါ
ps: بیا هڅه
ru: Повторить
th: ลองอีกครั้ง
tk: Täzeden synanyş
tr: Yeniden Dene
vi: Thử lại
zh_cn: 重试
zh_hk: 重試

# all_required_fields
source: Please fill out all required fields.
ar: يرجى ملء جميع الحقول المطلوبة.
bn: অনুগ্রহ করে সমস্ত প্রয়োজনীয় ফিল্ড পূরণ করুন।
es_cu: Por favor completa todos los campos requeridos.
fa: لطفاً تمام بخش‌های الزامی را پر کنید.
hi: कृपया सभी आवश्यक फ़ील्ड भरें।
ms: Sila isi semua medan yang diperlukan.
my: ကျေးဇူးပြု၍ လိုအပ်သော နေရာများအားလုံးကို ဖြည့်ပါ။
ps: مهرباني وکړئ ټول اړین ډګرونه ډک کړئ.
ru: Пожалуйста, заполните все обязательные поля.
th: กรุณากรอกข้อมูลที่จำเป็นทั้งหมด
tk: Ähli zerur ýerleri dolduryň.
tr: Lütfen tüm gerekli alanları doldurun.
vi: Vui lòng điền đầy đủ tất cả các trường bắt buộc.
zh_cn: 请填写所有必填字段。
zh_hk: 請填寫所有必填欄位。

# private_server_ready
source: Private Server is Ready!
ar: الخادم الخاص جاهز!
bn: প্রাইভেট সার্ভার প্রস্তুত!
es_cu: ¡Servidor Privado Está Listo!
fa: سرور خصوصی آماده است!
hi: निजी सर्वर तैयार है!
ms: Pelayan Peribadi Sudah Sedia!
my: ကိုယ်ပိုင်ဆာဗာ အဆင်သင့်ဖြစ်ပါပြီ!
ps: شخصي سرور چمتو دی!
ru: Частный сервер готов!
th: เซิร์ฟเวอร์ส่วนตัวพร้อมแล้ว!
tk: Hususy serwer taýýar!
tr: Özel Sunucu Hazır!
vi: Máy chủ riêng đã sẵn sàng!
zh_cn: 私有服务器已就绪!
zh_hk: 私人伺服器已就緒

# private_server_ready_message
source: (%d) Server has been set up and added to your server list. You're ready to connect!
ar: تم إعداد خادم (%s) وإضافته إلى قائمة الخوادم الخاصة بك. أنت جاهز للاتصال!
bn: (%s) সার্ভার সেটআপ করা হয়েছে এবং আপনার সার্ভার তালিকায় যোগ করা হয়েছে। আপনি সংযোগ করতে প্রস্তুত!
es_cu: ¡El servidor (%s) ha sido configurado y agregado a tu lista de servidores. Estás listo para conectarte!
fa: سرور (%s) راه‌اندازی و به فهرست سرورهای شما اضافه شد. شما آماده اتصالید!
hi: (%s) सर्वर सेट अप हो गया है और आपकी सर्वर सूची में जोड़ दिया गया है। आप कनेक्ट करने के लिए तैयार हैं!
ms: Pelayan (%s) telah disediakan dan ditambah ke senarai pelayan anda. Anda sudah bersedia untuk menyambung!
my: (%s) ဆာဗာကို စနစ်ထည့်ပြီး သင့်ဆာဗာစာရင်းသို့ ထည့်ပြီးပါပြီ။ ချိတ်ဆက်ရန် အဆင်သင့်ဖြစ်ပါပြီ!
ps: (%s) سرور تنظیم او ستاسو د سرور لیست ته اضافه شوی دی. تاسو د وصل کولو لپاره چمتو یاست!
ru: Сервер (%s) настроен и добавлен в список серверов. Вы готовы подключиться!
th: เซิร์ฟเวอร์ (%s) ถูกตั้งค่าเรียบร้อยแล้วและเพิ่มเข้าในรายการเซิร์ฟเวอร์ของคุณ คุณพร้อมที่จะเชื่อมต่อแล้ว!
tk: (%s) Serwer guruldy we serwer sanawyňyza goşuldy. Birikdirmäge taýýarsiňyz!
tr: (%s) Sunucu kuruldu ve sunucu listenize eklendi. Bağlanmaya hazırsınız!
vi: Máy chủ (%s) đã được thiết lập và thêm vào danh sách máy chủ của bạn. Bạn đã sẵn sàng để kết nối!
zh_cn: (%s) 服务器已设置完成并添加到服务器列表中。您可以开始连接了!
zh_hk: (%s) 伺服器已設定完成並新增至你的伺服器清單。你已準備好連線!

source: Set Up Your Server
ar: قم بإعداد خادمك
bn: আপনার সার্ভার সেটআপ করুন
es_cu: Configura tu Servidor
fa: سرور خود را راه‌اندازی کنید
hi: अपना सर्वर सेट अप करें
ms: Sediakan Pelayan Anda
my: သင့်ဆာဗာကို စနစ်ထည့်ပါ
ps: خپل سرور تنظیم کړئ
ru: Настроить ваш сервер
th: ตั้งค่าเซิร์ฟเวอร์ของคุณ
tk: Serweriňizi guruň
tr: Sunucunu Kur
vi: Thiết lập máy chủ của bạn
zh_cn: 设置您的服务器
zh_hk: 設定你的伺服器

# view_instructions_github
source: View Instructions on GitHub
ar: عرض التعليمات على GitHub
bn: GitHub এ নির্দেশাবলী দেখুন
es_cu: Ver Instrucciones en GitHub
fa: مشاهده دستورالعمل‌ها در GitHub
hi: GitHub पर निर्देश देखें
ms: Lihat Arahan di GitHub
my: GitHub တွင် လမ်းညွှန်ချက်များ ကြည့်ပါ
ps: په GitHub کې لارښوونې وګورئ
ru: Посмотреть инструкции на GitHub
th: ดูคำแนะนำบน GitHub
tk: GitHub-da görkezmelere göz aýlaň
tr: GitHub'da Talimatları Görüntüle
vi: Xem hướng dẫn trên GitHub
zh_cn: 在 GitHub 上查看说明
zh_hk: 在 GitHub 上查看說明

source: Server Access Key
ar: مفتاح الوصول إلى الخادم
bn: সার্ভার অ্যাক্সেস কী
es_cu: Clave de Acceso al Servidor
fa: کلید دسترسی سرور
hi: सर्वर एक्सेस की
ms: Kunci Akses Pelayan
my: ဆာဗာ အသုံးပြုခွင့်ကုဒ်
ps: د سرور لاسرسي کلید
ru: Ключ доступа к серверу
th: คีย์เข้าถึงเซิร์ฟเวอร์
tk: Serwer giriş açary
tr: Sunucu Erişim Anahtarı
vi: Khóa truy cập máy chủ
zh_cn: 服务器访问密钥
zh_hk: 伺服器存取金鑰

source: Access Key
ar: مفتاح الوصول
bn: অ্যাক্সেস কী
es_cu: Clave de Acceso
fa: کلید دسترسی
hi: एक्सेस की
ms: Kunci Akses
my: အသုံးပြုခွင့်ကုဒ်
ps: د لاسرسي کلید
ru: Ключ доступа
th: คีย์เข้าถึง
tk: Giriş açary
tr: Erişim Anahtarı
vi: Khóa truy cập
zh_cn: 访问密钥
zh_hk: 存取金鑰

source: Name Your Server
ar: اسم خادمك
bn: আপনার সার্ভারের নাম দিন
es_cu: Nombra tu Servidor
fa: سرور خود را نام‌گذاری کنید
hi: अपने सर्वर का नाम दें
ms: Namakan Pelayan Anda
my: သင့်ဆာဗာကို အမည်ပေးပါ
ps: خپل سرور ته نوم ورکړئ
ru: Назовите ваш сервер
th: ตั้งชื่อเซิร์ฟเวอร์ของคุณ
tk: Serweriňize at beriň
tr: Sunucuna İsim Ver
vi: Đặt tên cho máy chủ
zh_cn: 为您的服务器命名
zh_hk: 為你的伺服器命名
