Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

source: Cannot remove device
ar: لا يمكن إزالة الجهاز
bn: ডিভাইস সরাতে পারছি না
es_cu: No se puede eliminar el dispositivo
fa: حذف دستگاه ممکن نیست
hi: डिवाइस हटा नहीं पा रहे
ms: Tidak dapat membuang peranti
my: စက်ပစ္စည်းကို ဖယ်ရှား၍မရပါ
ps: وسیله لرې کولی نشم
ru: Не могу удалить устройство
th: ไม่สามารถลบอุปกรณ์
tk: Enjamy aýryp bilemok
tr: Cihaz kaldırılamıyor
vi: Không thể xóa thiết bị
zh_cn: 无法移除设备
zh_hk: 無法移除裝置

source: Application crashes
ar: التطبيق يتعطل
bn: অ্যাপ্লিকেশন ক্র্যাশ হচ্ছে
es_cu: La aplicación se cuelga
fa: برنامه ناگهان از کار می‌افتد
hi: एप्लिकेशन क्रैश हो रहा है
ms: Aplikasi terhenti secara tiba-tiba
my: အပလီကေးရှင်း ပျက်ကျသည်
ps: اپلیکیشن ماتیږي
ru: Приложение вылетает
th: แอปพลิเคชันขัดข้อง
tk: Programma çökýär
tr: Uygulama çöküyor
vi: Ứng dụng bị lỗi
zh_cn: 应用崩溃
zh_hk: 應用程式崩潰

source: Other
ar: أخرى
bn: অন্যান্য
es_cu: Otro
fa: سایر موارد
hi: अन्य
ms: Lain-lain
my: အခြား
ps: بل
ru: Другое
th: อื่นๆ
tk: Başga
tr: Diğer
vi: Khác
zh_cn: 其他
zh_hk: 其他

# issue_description
source: Describe your issue
ar: صِف مشكلتك
bn: আপনার সমস্যা বর্ণনা করুন
es_cu: Descripción del problema
fa: مشکل خود را توضیح دهید
hi: अपनी समस्या का विवरण दें
ms: Huraikan masalah anda
my: သင့်ပြဿနာကို ဖော်ပြပါ
ps: خپله ستونزه بیان کړئ
ru: Опишите вашу проблему
th: อธิบายปัญหาของคุณ
tk: Meseläňizi düşündiriň
tr: Sorununuzu açıklayın
vi: Mô tả sự cố của bạn
zh_cn: 描述您的问题
zh_hk: 描述你的問題

source: Enter password to confirm
ar: أدخل كلمة المرور للتأكيد
bn: নিশ্চিত করতে পাসওয়ার্ড লিখুন
es_cu: Ingresa contraseña para confirmar
fa: برای تأیید، رمز عبور را وارد کنید
hi: पुष्टि के लिए पासवर्ड दर्ज करें
ms: Masukkan kata laluan untuk mengesahkan
my: အတည်ပြုရန် စကားဝှက် ထည့်ပါ
ps: د تایید لپاره پټنوم دننه کړئ
ru: Введите пароль для подтверждения
th: กรอกรหัสผ่านเพื่อยืนยัน
tk: Tassyklamak üçin parol giriziň
tr: Onaylamak için şifre girin
vi: Nhập mật khẩu để xác nhận
zh_cn: 输入密码以确认
zh_hk: 輸入密碼確認

# cannot_view_logs
source: Lantern cannot view your diagnostic logs unless you send them to us.
ar: لا يمكن لـ Lantern عرض سجلات التشخيص الخاصة بك ما لم ترسلها إلينا.
bn: আপনি আমাদের কাছে না পাঠালে Lantern আপনার ডায়াগনস্টিক লগ দেখতে পারে না।
es_cu: Lantern no puede ver tus registros de diagnóstico a menos que nos los envíes.
fa: Lantern نمی‌تواند گزارش تشخیصی را ببیند مگر اینکه آن‌ها را برای‌مان بفرستید
hi: Lantern आपके डायग्नोस्टिक लॉग्स तब तक नहीं देख सकता जब तक आप उन्हें हमें नहीं भेजते।
ms: Lantern tidak dapat melihat log diagnostik anda melainkan anda menghantarnya kepada kami.
my: သင် ကျွန်ုပ်တို့ထံ မပို့လျှင် Lantern သည် သင့် စစ်ဆေးခြင်း မှတ်တမ်းများကို မတွေ့ရနိုင်ပါ။
ps: Lantern ستاسو تشخیصي لاګونه نشي کتلی پرته له دې چې تاسو موږ ته یې واستوئ.
ru: Lantern не может просмотреть ваши диагностические логи, пока вы не отправите их нам.
th: Lantern ไม่สามารถดูบันทึกการวินิจฉัยของคุณได้ เว้นแต่คุณจะส่งมาให้เรา
tk: Lantern diagnostika žurnallaryňyza seredip bilmeýär, eger bize ibermeseňiz.
tr: Lantern, siz bize göndermedikçe tanı günlüklerinizi görüntüleyemez.
vi: Lantern không thể xem nhật ký chẩn đoán của bạn trừ khi bạn gửi cho chúng tôi.
zh_cn: 除非您将诊断日志发送给我们,否则蓝灯无法查看您的诊断日志。
zh_hk: 除非你傳送診斷記錄給我們,否則 Lantern 無法檢視你的診斷記錄。

source: Split Tunneling Mode
ar: وضع التوجيه المُقسّم
bn: স্প্লিট টানেলিং মোড
es_cu: Modo de Túnel Dividido
fa: حالت تونل‌سازی تفکیکی
hi: स्प्लिट टनलिंग मोड
ms: Mod Terowong Terpisah
my: ခွဲခြားချိတ်ဆက်ခြင်း မုဒ်
ps: د وېشل شوی ټنل حالت
ru: Режим раздельного туннелирования
th: โหมดแยกอุโมงค์
tk: Bölünişikli tunnelirleme tertibi
tr: Bölünmüş Tünelleme Modu
vi: Chế độ định tuyến phân tách
zh_cn: 分流模式
zh_hk: 分流模式

source: Apps Split Tunneling
ar: التوجيه المُقسّم للتطبيقات
bn: অ্যাপস স্প্লিট টানেলিং
es_cu: Túnel Dividido de Aplicaciones
fa: تونل‌سازی تفکیکی برنامه‌ها
hi: ऐप स्प्लिट टनलिंग
ms: Terowong Terpisah Aplikasi
my: အက်ပ်များ ခွဲခြားချိတ်ဆက်ခြင်း
ps: د اپلیکیشنونو وېشل شوی ټنل
ru: Раздельное туннелирование приложений
th: แยกอุโมงค์สำหรับแอป
tk: Programmalar üçin bölünişikli tunnelirleme
tr: Uygulamalar için Bölünmüş Tünelleme
vi: Định tuyến phân tách ứng dụng
zh_cn: 应用分流
zh_hk: 應用程式分流

source: Website Split Tunneling
ar: التوجيه المُقسّم للمواقع
bn: ওয়েবসাইট স্প্লিট টানেলিং
es_cu: Túnel Dividido de Sitios Web
fa: تونل‌سازی تفکیکی وب‌سایت‌ها
hi: वेबसाइट स्प्लिट टनलिंग
ms: Terowong Terpisah Laman Web
my: ဝက်ဘ်ဆိုက် ခွဲခြားချိတ်ဆက်ခြင်း
ps: د ویب سایټ وېشل شوی ټنل
ru: Раздельное туннелирование сайтов
th: แยกอุโมงค์สำหรับเว็บไซต์
tk: Web saýtlar üçin bölünişikli tunnelirleme
tr: Web Siteleri için Bölünmüş Tünelleme
vi: Định tuyến phân tách trang web
zh_cn: 网站分流
zh_hk: 網站分流

# iran_optimized
source: Iran-optimized split tunneling
ar: توجيه مُقسّم محسّن لإيران
bn: ইরান-অপটিমাইজড স্প্লিট টানেলিং
es_cu: Túnel dividido optimizado para Irán
fa: تونل‌سازی تفکیکی بهینه برای ایران
hi: ईरान के लिए अनुकूलित स्प्लिट टनलिंग
ms: Terowong terpisah dioptimumkan untuk Iran
my: အီရန် အကောင်းဆုံး ခွဲခြားချိတ်ဆက်ခြင်း
ps: د ایران لپاره مناسب شوی ټنل ویشل
ru: Раздельное туннелирование, оптимизированное для Ирана
th: แยกอุโมงค์ที่ปรับให้เหมาะกับอิหร่าน
tk: Eýrana laýyk optimizasiýalanan bölünişikli tunnelirleme
tr: İran için optimize edilmiş bölünmüş tünelleme
vi: Định tuyến phân tách tối ưu cho Iran
zh_cn: 伊朗优化分流规则
zh_hk: 伊朗最佳化分流

# china_optimized
source: China-optimized split tunneling
ar: توجيه مُقسّم محسّن للصين
bn: চীন-অপটিমাইজড স্প্লিট টানেলিং
es_cu: Túnel dividido optimizado para China
fa: تونل‌سازی تفکیکی بهینه برای چین
hi: चीन के लिए अनुकूलित स्प्लिट टनलिंग
ms: Terowong terpisah dioptimumkan untuk China
my: တရုတ် အကောင်းဆုံး ခွဲခြားချိတ်ဆက်ခြင်း
ps: د چین لپاره مناسب شوی ټنل ویشل
ru: Раздельное туннелирование, оптимизированное для Китая
th: แยกอุโมงค์ที่ปรับให้เหมาะกับจีน
tk: Hytaýa laýyk optimizasiýalanan bölünişikli tunnelirleme
tr: Çin için optimize edilmiş bölünmüş tünelleme
vi: Định tuyến phân tách tối ưu cho Trung Quốc
zh_cn: 中国优化分流规则
zh_hk: 中國最佳化分流

# russia_optimized
source: Russia-optimized split tunneling
ar: توجيه مُقسّم محسّن لروسيا
bn: রাশিয়া-অপটিমাইজড স্প্লিট টানেলিং
es_cu: Túnel dividido optimizado para Rusia
fa: تونل‌سازی تفکیکی بهینه برای روسیه
hi: रूस के लिए अनुकूलित स्प्लिट टनलिंग
ms: Terowong terpisah dioptimumkan untuk Rusia
my: ရုရှား အကောင်းဆုံး ခွဲခြားချိတ်ဆက်ခြင်း
ps: د روسیې لپاره مناسب شوی ټنل ویشل
ru: Раздельное туннелирование, оптимизированное для России
th: แยกอุโมงค์ที่ปรับให้เหมาะกับรัสเซีย
tk: Russiýa laýyk optimizasiýalanan bölünişikli tunnelirleme
tr: Rusya için optimize edilmiş bölünmüş tünelleme
vi: Định tuyến phân tách tối ưu cho Nga
zh_cn: 俄罗斯优化分流规则
zh_hk: 俄羅斯最佳化分流

# global_optimized
source: Global-optimized split tunnneling
ar: توجيه مُقسّم محسّن عالميًا
bn: গ্লোবাল-অপটিমাইজড স্প্লিট টানেলিং
es_cu: Túnel dividido optimizado global
fa: تونل‌سازی تفکیکی بهینه جهانی
hi: वैश्विक स्तर पर अनुकूलित स्प्लिट टनलिंग
ms: Terowong terpisah dioptimumkan untuk global
my: ကမ္ဘာလုံးဆိုင်ရာ အကောင်းဆုံး ခွဲခြားချိတ်ဆက်ခြင်း
ps: نړیوال مناسب شوی ټنل ویشل
ru: Глобально оптимизированное раздельное туннелирование
th: แยกอุโมงค์ที่ปรับให้เหมาะทั่วโลก
tk: Global optimizasiýalanan bölünişikli tunnelirleme
tr: Global optimize edilmiş bölünmüş tünelleme
vi: Định tuyến phân tách tối ưu toàn cầu
zh_cn: 全球优化分流规则
zh_hk: 全球最佳化分流

source: Enter URL
ar: أدخل الرابط
bn: URL লিখুন
es_cu: Ingresar URL
fa: آدرس وب را وارد کنید
hi: URL दर्ज करें
ms: Masukkan URL
my: URL ထည့်ပါ
ps: URL دننه کړئ
ru: Введите URL
th: กรอก URL
tk: URL giriziň
tr: URL Girin
vi: Nhập URL
zh_cn: 输入 URL
zh_hk: 輸入網址

source: Add
ar: إضافة
bn: যোগ করুন
es_cu: Añadir
fa: افزودن
hi: जोड़ें
ms: Tambah
my: ထည့်ရန်
ps: اضافه کړئ
ru: Добавить
th: เพิ่ม
tk: Goş
tr: Ekle
vi: Thêm
zh_cn: 添加
zh_hk: 新增

source: Enabled
ar: مُفعّل
bn: চালু আছে
es_cu: Activado
fa: فعال
hi: सक्षम
ms: Didayakan
my: ဖွင့်ထားသည်
ps: فعال شوی
ru: Включено
th: เปิดใช้งาน
tk: Açyk
tr: Etkin
vi: Đã bật
zh_cn: 已启用
zh_hk: 已啟用

source: Disabled
ar: مُعطّل
bn: বন্ধ আছে
es_cu: Desactivado
fa: غیرفعال
hi: अक्षम
ms: Dilumpuhkan
my: ပိတ်ထားသည်
ps: غیر فعال شوی
ru: Отключено
th: ปิดใช้งาน
tk: Ýapyk
tr: Devre Dışı
vi: Đã tắt
zh_cn: 已禁用
zh_hk: 已停用

source: Automatic
ar: تلقائي
bn: স্বয়ংক্রিয়
es_cu: Automático
fa: خودکار
hi: स्वचालित
ms: Automatik
my: အလိုအလျောက်
ps: اتوماتیک
ru: Автоматически
th: อัตโนมัติ
tk: Awtomatik
tr: Otomatik
vi: Tự động
zh_cn: 自动
zh_hk: 自動

source: Automatic mode
ar: الوضع التلقائي
bn: স্বয়ংক্রিয় মোড
es_cu: Modo automático
fa: حالت خودکار
hi: स्वचालित मोड
ms: Mod automatik
my: အလိုအလျောက် မုဒ်
ps: اتوماتیک حالت
ru: Автоматический режим
th: โหมดอัตโนมัติ
tk: Awtomatik tertip
tr: Otomatik Mod
vi: Chế độ tự động
zh_cn: 自动模式
zh_hk: 自動模式

source: Manual
ar: يدوي
bn: ম্যানুয়াল
fa: دستی
hi: मैनुअल
my: လက်ဖြင့်
ps: لاسي
ru: Вручную
th: ด้วยตนเอง
tk: El bilen
tr: Manuel
vi: Thủ công
zh_cn: 手动
zh_hk: 手動

# enter_url_or_ip
source: Enter URL or IP Address
ar: أدخل الرابط أو عنوان IP
bn: URL বা IP ঠিকানা লিখুন
es_cu: Ingresar URL o Dirección IP
fa: آدرس وب یا IP را وارد کنید
hi: URL या IP पता दर्ज करें
ms: Masukkan URL atau Alamat IP
my: URL သို့မဟုတ် IP လိပ်စာ ထည့်ပါ
ps: URL یا IP پته دننه کړئ
ru: Введите URL или IP-адрес
th: กรอก URL หรือที่อยู่ IP
tk: URL ýa-da IP salgy giriziň
tr: URL veya IP Adresi Girin
vi: Nhập URL hoặc địa chỉ IP
zh_cn: 输入 URL 或 IP 地址
zh_hk: 輸入網址或 IP 位址

source: Installed Apps
ar: التطبيقات المثبتة
bn: ইনস্টল করা অ্যাপস
es_cu: Aplicaciones Instaladas
fa: برنامه‌های نصب‌شده
hi: इंस्टॉल किए गए ऐप
ms: Aplikasi Terpasang
my: ထည့်သွင်းပြီး အက်ပ်များ
ps: نصب شوي اپلیکیشنونه
ru: Установленные приложения
th: แอปที่ติดตั้ง
tk: Gurlan programmalar
tr: Yüklü Uygulamalar
vi: Ứng dụng đã cài đặt
zh_cn: 已安装的应用
zh_hk: 已安裝的應用程式

source: Search Apps
ar: البحث عن التطبيقات
bn: অ্যাপস খুঁজুন
es_cu: Buscar aplicaciones
fa: جستجوی برنامه
hi: ऐप खोजें
ms: Cari Aplikasi
my: အက်ပ်များ ရှာပါ
ps: اپلیکیشنونه ولټوئ
ru: Поиск приложений
th: ค้นหาแอป
tk: Programmalary gözle
tr: Uygulamalarda Ara
vi: Tìm kiếm ứng dụng
zh_cn: 搜索应用
zh_hk: 搜尋應用程式

source: Search Websites
ar: البحث عن المواقع
bn: ওয়েবসাইট খুঁজুন
es_cu: Buscar Sitios Web
fa: جستجوی وب‌سایت
hi: वेबसाइट खोजें
ms: Cari Laman Web
my: ဝက်ဘ်ဆိုက်များ ရှာပါ
ps: ویب سایټونه ولټوئ
ru: Поиск сайтов
th: ค้นหาเว็บไซต์
tk: Web saýtlary gözle
tr: Web Sitelerinde Ara
vi: Tìm kiếm trang web
zh_cn: 搜索网站
zh_hk: 搜尋網站

source: Mode
ar: الوضع
bn: মোড
es_cu: Modo
fa: حالت
hi: मोड
ms: Mod
my: မုဒ်
ps: حالت
ru: Режим
th: โหมด
tk: Tertip
tr: Mod
vi: Chế độ
zh_cn: 模式
zh_hk: 模式

# use_commas
source: Use commas to separate multiple URLs
ar: استخدم الفواصل لفصل روابط متعددة
bn: একাধিক URL আলাদা করতে কমা ব্যবহার করুন
es_cu: Usa comas para separar múltiples URLs
fa: برای جدا کردن چند آدرس، از ویرگول یا کاما استفاده کنید
hi: कई URL को अलग करने के लिए कॉमा का उपयोग करें
ms: Gunakan koma untuk memisahkan berbilang URL
my: URL များစွာကို ခွဲခြားရန် ကော်မာ အသုံးပြုပါ
ps: د ډیرو URLونو د جلا کولو لپاره کاما وکاروئ
ru: Используйте запятые для разделения нескольких URL
th: ใช้เครื่องหมายจุลภาคเพื่อคั่น URL หลายรายการ
tk: Birnäçe URL-leri bölmek üçin vergül ulanyň
tr: Birden fazla URL'yi ayırmak için virgül kullanın
vi: Sử dụng dấu phẩy để phân tách nhiều URL
zh_cn: 使用逗号分隔多个 URL
zh_hk: 使用逗號分隔多個網址

# default_bypass
source: Default Bypass Lists
ar: قوائم التجاوز الافتراضية
bn: ডিফল্ট বাইপাস লিস্ট
es_cu: Listas de Exclusión Predeterminadas
fa: فهرست‌های دور زدن پیش‌فرض
hi: डिफ़ॉल्ट बायपास सूचियां
ms: Senarai Lepasan Lalai
my: မူလ ကျော်သွားမည့် စာရင်းများ
ps: تلواله تیریدونکي لیستونه
ru: Списки обхода по умолчанию
th: รายการข้ามเริ่มต้น
tk: Deslapky geçme sanawlary
tr: Varsayılan Atlama Listeleri
vi: Danh sách bỏ qua mặc định
zh_cn: 默认直连列表
zh_hk: 預設繞過清單

source: Global Bypass List
ar: قائمة التجاوز العالمية
bn: গ্লোবাল বাইপাস লিস্ট
es_cu: Lista de Exclusión Global
fa: فهرست جهانی دور زدن
hi: वैश्विक बायपास सूची
ms: Senarai Lepasan Global
my: ကမ္ဘာလုံးဆိုင်ရာ ကျော်သွားမည့် စာရင်း
ps: نړیوال تیریدونکی لیست
ru: Глобальный список обхода
th: รายการข้ามทั่วโลก
tk: Global geçme sanawy
tr: Global Atlama Listesi
vi: Danh sách bỏ qua toàn cầu
zh_cn: 全球直连列表
zh_hk: 全球繞過清單

# global_bypass_desc
source: Trusted sites (HTTPS) with non-sensitive content.
ar: مواقع موثوقة (HTTPS) بمحتوى غير حساس.
bn: বিশ্বস্ত সাইট (HTTPS) যেগুলোতে সংবেদনশীল কন্টেন্ট নেই।
es_cu: Sitios de confianza (HTTPS) con contenido no sensible.
fa: سایت‌های مورد اعتماد (HTTPS) با محتوای غیرحساس.
hi: विश्वसनीय साइटें (HTTPS) जिनमें गैर-संवेदनशील सामग्री है।
ms: Laman dipercayai (HTTPS) dengan kandungan tidak sensitif.
my: ယုံကြည်စိတ်ချရသော ဆိုက်များ (HTTPS) အကြောင်းအရာ ထိခိုက်မှုမရှိသည်များ။
ps: باوري سایټونه (HTTPS) د غیر حساس منځپانګې سره.
ru: Доверенные сайты (HTTPS) с неконфиденциальным контентом.
th: เว็บไซต์ที่เชื่อถือได้ (HTTPS) ที่มีเนื้อหาที่ไม่ละเอียดอ่อน
tk: Ygtybarly saýtlar (HTTPS) duýgur däl mazmun bilen.
tr: Hassas olmayan içeriğe sahip güvenilir siteler (HTTPS).
vi: Các trang web đáng tin cậy (HTTPS) với nội dung không nhạy cảm.
zh_cn: 包含非敏感内容的可信网站(HTTPS)。
zh_hk: 可信任的網站(HTTPS)且內容非敏感資訊。

source: China Bypass List
ar: قائمة تجاوز الصين
bn: চীন বাইপাস লিস্ট
es_cu: Lista de Exclusión de China
fa: فهرست دور زدن چین
hi: चीन बायपास सूची
ms: Senarai Lepasan China
my: တရုတ် ကျော်သွားမည့် စာရင်း
ps: د چین تیریدونکی لیست
ru: Список обхода для Китая
th: รายการข้ามสำหรับจีน
tk: Hytaý geçme sanawy
tr: Çin Atlama Listesi
vi: Danh sách bỏ qua Trung Quốc
zh_cn: 中国直连列表
zh_hk: 中國繞過清單

# china_bypass_desc
source: Sites freely accessible in China. Updated regularly.
ar: مواقع يمكن الوصول إليها بحرية في الصين. يتم تحديثها بانتظام.
bn: চীনে অবাধে অ্যাক্সেস করা যায় এমন সাইট। নিয়মিত আপডেট করা হয়।
es_cu: Sitios accesibles libremente en China. Actualizado regularmente.
fa: سایت‌هایی که آزادانه در چین در دسترسند. به‌روزرسانی منظم.
hi: चीन में स्वतंत्र रूप से सुलभ साइटें। नियमित रूप से अपडेट की जाती हैं।
ms: Laman yang boleh diakses secara bebas di China. Dikemas kini secara berkala.
my: တရုတ်တွင် လွတ်လပ်စွာ ဝင်ရောက်နိုင်သော ဆိုက်များ။ ပုံမှန် အပ်ဒိတ်လုပ်သည်။
ps: سایټونه په چین کې په آزاده توګه د لاسرسي وړ. په منظم ډول تازه کیږي.
ru: Сайты, свободно доступные в Китае. Регулярно обновляется.
th: เว็บไซต์ที่เข้าถึงได้อย่างอิสระในจีน อัปเดตเป็นประจำ
tk: Hytaýda erkin elýeterli saýtlar. Yzygiderli täzelenýär.
tr: Çin'de serbestçe erişilebilen siteler. Düzenli güncellenir.
vi: Các trang web có thể truy cập tự do ở Trung Quốc. Được cập nhật thường xuyên.
zh_cn: 在中国可以自由访问的网站。定期更新。
zh_hk: 在中國可自由存取的網站。定期更新。

source: Iran Bypass List
ar: قائمة تجاوز إيران
bn: ইরান বাইপাস লিস্ট
es_cu: Lista de Exclusión de Irán
fa: فهرست دور زدن ایران
hi: ईरान बायपास सूची
ms: Senarai Lepasan Iran
my: အီရန် ကျော်သွားမည့် စာရင်း
ps: د ایران تیریدونکی لیست
ru: Список обхода для Ирана
th: รายการข้ามสำหรับอิหร่าน
tk: Eýran geçme sanawy
tr: İran Atlama Listesi
vi: Danh sách bỏ qua Iran
zh_cn: 伊朗直连列表
zh_hk: 伊朗繞過清單

# iran_bypass_desc
source: Sites freely accessible in Iran. Updated regularly.
ar: مواقع يمكن الوصول إليها بحرية في إيران. يتم تحديثها بانتظام.
bn: ইরানে অবাধে অ্যাক্সেস করা যায় এমন সাইট। নিয়মিত আপডেট করা হয়।
es_cu: Sitios accesibles libremente en Irán. Actualizado regularmente.
fa: سایت‌هایی که آزادانه در ایران در دسترسند. به‌روزرسانی منظم.
hi: ईरान में स्वतंत्र रूप से सुलभ साइटें। नियमित रूप से अपडेट की जाती हैं।
ms: Laman yang boleh diakses secara bebas di Iran. Dikemas kini secara berkala.
my: အီရန်တွင် လွတ်လပ်စွာ ဝင်ရောက်နိုင်သော ဆိုက်များ။ ပုံမှန် အပ်ဒိတ်လုပ်သည်။
ps: سایټونه په ایران کې په آزاده توګه د لاسرسي وړ. په منظم ډول تازه کیږي.
ru: Сайты, свободно доступные в Иране. Регулярно обновляется.
th: เว็บไซต์ที่เข้าถึงได้อย่างอิสระในอิหร่าน อัปเดตเป็นประจำ
tk: Eýranda erkin elýeterli saýtlar. Yzygiderli täzelenýär.
tr: İran'da serbestçe erişilebilen siteler. Düzenli güncellenir.
vi: Các trang web có thể truy cập tự do ở Iran. Được cập nhật thường xuyên.
zh_cn: 在伊朗可以自由访问的网站。定期更新。
zh_hk: 在伊朗可自由存取的網站。定期更新。

source: Russia Bypass List
ar: قائمة تجاوز روسيا
bn: রাশিয়া বাইপাস লিস্ট
es_cu: Lista de Exclusión de Rusia
fa: فهرست دور زدن روسیه
hi: रूस बायपास सूची
ms: Senarai Lepasan Rusia
my: ရုရှား ကျော်သွားမည့် စာရင်း
ps: د روسیې تیریدونکی لیست
ru: Список обхода для России
th: รายการข้ามสำหรับรัสเซีย
tk: Russiýa geçme sanawy
tr: Rusya Atlama Listesi
vi: Danh sách bỏ qua Nga
zh_cn: 俄罗斯直连列表
zh_hk: 俄羅斯繞過清單

# russia_bypass_desc
source: Sites freely accessible in Russia. Updated regularly.
ar: مواقع يمكن الوصول إليها بحرية في روسيا. يتم تحديثها بانتظام.
bn: রাশিয়ায় অবাধে অ্যাক্সেস করা যায় এমন সাইট। নিয়মিত আপডেট করা হয়।
es_cu: Sitios accesibles libremente en Rusia. Actualizado regularmente.
fa: سایت‌هایی که آزادانه در روسیه در دسترسند. به‌روزرسانی منظم.
hi: रूस में स्वतंत्र रूप से सुलभ साइटें। नियमित रूप से अपडेट की जाती हैं।
ms: Laman yang boleh diakses secara bebas di Rusia. Dikemas kini secara berkala.
my: ရုရှားတွင် လွတ်လပ်စွာ ဝင်ရောက်နိုင်သော ဆိုက်များ။ ပုံမှန် အပ်ဒိတ်လုပ်သည်။
ps: سایټونه په روسیه کې په آزاده توګه د لاسرسي وړ. په منظم ډول تازه کیږي.
ru: Сайты, свободно доступные в России. Регулярно обновляется.
th: เว็บไซต์ที่เข้าถึงได้อย่างอิสระในรัสเซีย อัปเดตเป็นประจำ
tk: Russiýada erkin elýeterli saýtlar. Yzygiderli täzelenýär.
tr: Rusya'da serbestçe erişilebilen siteler. Düzenli güncellenir.
vi: Các trang web có thể truy cập tự do ở Nga. Được cập nhật thường xuyên.
zh_cn: 在俄罗斯可以自由访问的网站。定期更新。
zh_hk: 在俄羅斯可自由存取的網站。定期更新。

# see_sites_included
source: See sites included in the
ar: شاهد المواقع المدرجة في
bn: অন্তর্ভুক্ত সাইট দেখুন
es_cu: Ver sitios incluidos en las
fa: سایت‌های موجود در
hi: शामिल साइटें देखें
ms: Lihat laman yang termasuk dalam
my: ပါဝင်သော ဆိုက်များကို ကြည့်ပါ
ps: په کې شامل سایټونه وګورئ
ru: Посмотреть сайты, включенные в
th: ดูเว็บไซต์ที่รวมอยู่ใน
tk: Goşulan saýtlara göz aýlaň:
tr: Dahil edilen siteleri görün
vi: Xem các trang web trong
zh_cn: 查看包含在
zh_hk: 查看包含在

source: default lists here
ar: القوائم الافتراضية هنا
bn: ডিফল্ট লিস্ট এখানে
es_cu: listas predeterminadas aquí
fa: فهرست‌های پیش‌فرض در اینجا
hi: यहाँ डिफ़ॉल्ट सूचियां
ms: senarai lalai di sini
my: ဒီမှာ မူလ စာရင်းများ
ps: دلته تلواله لیستونه
ru: списки по умолчанию здесь
th: รายการเริ่มต้นที่นี่
tk: deslapky sanawlary şu ýerde
tr: varsayılan listeler burada
vi: danh sách mặc định tại đây
zh_cn: 默认列表中的网站
zh_hk: 預設清單中的網站

# when_connected
source: When connected, the websites you select will bypass the VPN.
ar: عند الاتصال، ستتجاوز المواقع التي تختارها VPN.
bn: সংযুক্ত থাকলে, আপনার নির্বাচিত ওয়েবসাইটগুলো ভিপিএন বাইপাস করবে।
es_cu: Cuando esté conectado, los sitios web que selecciones omitirán la VPN.
fa: هنگام اتصال، وب‌سایت‌هایی که انتخاب می‌کنید VPN را دور می‌زنند.
hi: जब कनेक्ट हो, तो आपके द्वारा चुनी गई वेबसाइटें VPN को बायपास करेंगी।
ms: Apabila disambungkan, laman web yang anda pilih akan melepasi VPN.
my: ချိတ်ဆက်ထားလျှင်၊ သင်ရွေးချယ်သော ဝက်ဘ်ဆိုက်များသည် VPN ကို ကျော်သွားပါမည်။
ps: کله چې وصل یاست، هغه ویب سایټونه چې تاسو یې غوره کوئ به VPN تیر کړي.
ru: При подключении выбранные вами сайты обойдут VPN.
th: เมื่อเชื่อมต่อแล้ว เว็บไซต์ที่คุณเลือกจะข้าม VPN
tk: Birikdirilende, saýlan web saýtlaryňyz VPN-den geçer.
tr: Bağlandığında, seçtiğiniz web siteleri VPN'i atlayacaktır.
vi: Khi được kết nối, các trang web bạn chọn sẽ bỏ qua VPN.
zh_cn: 连接时,您选择的网站将直连而不经过 VPN。
zh_hk: 連線時,你選擇的網站將繞過 VPN。

# lantern_automatic
source: Lantern automatically chooses which apps and websites bypass the VPN based on your location for best performance. Learn more.
ar: يختار Lantern تلقائيًا التطبيقات والمواقع التي تتجاوز VPN بناءً على موقعك للحصول على أفضل أداء.
bn: Lantern স্বয়ংক্রিয়ভাবে নির্ধারণ করে কোন অ্যাপস এবং ওয়েবসাইট সেরা পারফরম্যান্সের জন্য আপনার লোকেশনের ভিত্তিতে ভিপিএন বাইপাস করবে।
es_cu: Lantern elige automáticamente qué aplicaciones y sitios web omiten la VPN según tu ubicación para un mejor rendimiento.
fa: Lantern به طور خودکار انتخاب می‌کند که کدام برنامه‌ها و وب‌سایت‌ها به VPN نیازمندند تا بر اساس مکان شما، بهترین عملکرد را داشته باشد.
hi: Lantern स्वचालित रूप से चुनता है कि कौन से ऐप और वेबसाइटें सर्वोत्तम प्रदर्शन के लिए आपके स्थान के आधार पर VPN को बायपास करें।
ms: Lantern secara automatik memilih aplikasi dan laman web yang melepasi VPN berdasarkan lokasi anda untuk prestasi terbaik.
my: Lantern သည် အကောင်းဆုံး စွမ်းဆောင်ရည်အတွက် သင့်တည်နေရာပေါ်မူတည်၍ VPN ကို ကျော်သွားမည့် အက်ပ်နှင့် ဝက်ဘ်ဆိုက်များကို အလိုအလျောက် ရွေးချယ်သည်။
ps: Lantern په اتوماتیک ډول غوره کوي کوم اپلیکیشنونه او ویب سایټونه د ستاسو د موقعیت پر بنسټ د غوره کړنې لپاره VPN تیروي.
ru: Lantern автоматически выбирает, какие приложения и сайты обходят VPN, исходя из вашего местоположения, для улучшения производительности.
th: Lantern เลือกแอปและเว็บไซต์ที่ข้าม VPN โดยอัตโนมัติตามตำแหน่งของคุณ เพื่อประสิทธิภาพที่ดีที่สุด
tk: Lantern iň oňat öndürijilik üçin ýagdaýyňyza esaslanyp, haýsy programmalaryň we web saýtlaryň VPN-den geçmeli bolmalydygyny awtomatik saýlaýar.
tr: Lantern, konumunuza göre en iyi performans için hangi uygulama ve web sitelerinin VPN'i atlayacağını otomatik olarak seçer.
vi: Lantern tự động chọn ứng dụng và trang web nào bỏ qua VPN dựa trên vị trí của bạn để có hiệu suất tốt nhất.
zh_cn: 蓝灯会根据您的位置自动选择哪些应用和网站绕过 VPN 直连互联网,以获得最佳性能。
zh_hk: Lantern 會根據你的位置自動選擇哪些應用程式和網站繞過 VPN,以獲得最佳效能。

# apps_bypassing_vpn
source: Apps bypassing the VPN (%d)
ar: التطبيقات التي تتجاوز VPN (%d)
bn: ভিপিএন বাইপাস করছে এমন অ্যাপস (%d)
es_cu: Aplicaciones que omiten la VPN (%d)
fa: برنامه‌هایی که از VPN دور می‌زنند (%d)
hi: VPN बायपास करने वाले ऐप (%d)
ms: Aplikasi yang melepasi VPN (%d)
my: VPN ကို ကျော်သွားသည့် အက်ပ်များ (%d)
ps: اپلیکیشنونه چې VPN تیروي (%d)
ru: Приложения, обходящие VPN (%d)
th: แอปที่ข้าม VPN (%d)
tk: VPN arkaly ulanmaýan programmalar (%d)
tr: VPN'i atlayan uygulamalar (%d)
vi: Ứng dụng bỏ qua VPN (%d)
zh_cn: 直连的应用 (%d)
zh_hk: 繞過 VPN 的應用程式 (%d)

# websites_bypassing_vpn
source: Websites bypassing the VPN (%d)
ar: المواقع التي تتجاوز VPN (%d)
bn: ভিপিএন বাইপাস করছে এমন ওয়েবসাইট (%d)
es_cu: Sitios web que omiten la VPN (%d)
fa: وب‌سایت‌هایی که از VPN دور می‌زنند (%d)
hi: VPN बायपास करने वाली वेबसाइटें (%d)
ms: Laman web yang melepasi VPN (%d)
my: VPN ကို ကျော်သွားသည့် ဝက်ဘ်ဆိုက်များ (%d)
ps: ویب سایټونه چې VPN تیروي (%d)
ru: Сайты обходящие VPN (%d)
th: เว็บไซต์ที่ข้าม VPN (%d)
tk: VPN arkaly ulanmaýan web saýtlar (%d)
tr: VPN'i atlayan web siteleri (%d)
vi: Trang web bỏ qua VPN (%d)
zh_cn: 直连的网站 (%d)
zh_hk: 繞過 VPN 的網站 (%d)

# logs_share_message
source: Here are my diagnostic logs from Lantern.
ar: هذه سجلات التشخيص الخاصة بي من Lantern.
bn: এগুলো Lantern থেকে আমার ডায়াগনস্টিক লগ।
es_cu: Aquí están mis registros de diagnóstico de Lantern.
fa: این لاگ‌های تشخیصی من از Lantern است.
hi: ये Lantern से मेरे डायग्नोस्टिक लॉग्स हैं।
ms: Berikut adalah log diagnostik saya dari Lantern.
my: ဒါတွေက Lantern ကနေ ကျွန်တော့်ရဲ့ စစ်ဆေးခြင်း မှတ်တမ်းများ ဖြစ်ပါတယ်။
ps: دا زما د Lantern تشخیصي لاګونه دي.
ru: Вот мои диагностические логи из Lantern.
th: นี่คือบันทึกการวินิจฉัยของฉันจาก Lantern
tk: Bu meniň Lantern-dan diagnostika žurnallarym.
tr: İşte Lantern'den tanı günlüklerim.
vi: Đây là nhật ký chẩn đoán của tôi từ Lantern.
zh_cn: 这是我的蓝灯诊断日志。
zh_hk: 這是我從 Lantern 取得的診斷記錄。

source: Payment Options
ar: خيارات الدفع
bn: পেমেন্ট অপশন
es_cu: Opciones de Pago
fa: گزینه‌های پرداخت
hi: भुगतान विकल्प
ms: Pilihan Pembayaran
my: ငွေပေးချေမှု ရွေးချယ်စရာများ
ps: د تادیې اختیارونه
ru: Способы оплаты
th: ตัวเลือกการชำระเงิน
tk: Töleg görnüşleri
tr: Ödeme Seçenekleri
vi: Phương thức thanh toán
zh_cn: 支付选项
zh_hk: 付款選項

source: Add Your Email
ar: أضف بريدك الإلكتروني
bn: আপনার ইমেইল যোগ করুন
es_cu: Agrega tu Email
fa: ایمیل خود را اضافه کنید
hi: अपना ईमेल जोड़ें
ms: Tambah E-mel Anda
my: သင့်အီးမေးလ် ထည့်ပါ
ps: خپل بریښنالیک اضافه کړئ
ru: Добавьте ваш email
th: เพิ่มอีเมลของคุณ
tk: E-poçtaňyzy goşuň
tr: E-postanı Ekle
vi: Thêm email của bạn
zh_cn: 添加您的电子邮箱
zh_hk: 新增你的電子郵件

source: Continue
ar: متابعة
bn: চালিয়ে যান
es_cu: Continuar
fa: ادامه
hi: जारी रखें
ms: Teruskan
my: ဆက်လုပ်ပါ
ps: دوام ورکړئ
ru: Продолжить
th: ดำเนินการต่อ
tk: Dowam et
tr: Devam Et
vi: Tiếp tục
zh_cn: 继续
zh_hk: 繼續
