Repository: getlantern/lantern
Catalog: assets/locales/*.po
Languages: ar, bn, es_cu, fa, hi, ms, my, ps, ru, th, tk, tr, vi, zh_cn, zh_hk

# how_server_appears
source: How the server will appear in the server selection list
ar: كيف سيظهر الخادم في قائمة اختيار الخادم
bn: সার্ভার নির্বাচন তালিকায় সার্ভারটি যেভাবে প্রদর্শিত হবে
es_cu: Cómo aparecerá el servidor en la lista de selección de servidores
fa: نحوه نمایش در فهرست انتخاب سرور
hi: सर्वर चयन सूची में सर्वर कैसे दिखाई देगा
ms: Bagaimana pelayan akan muncul dalam senarai pemilihan pelayan
my: ဆာဗာရွေးချယ်မှု စာရင်းတွင် ဆာဗာ ပေါ်လာမည့်ပုံစံ
ps: څنګه به سرور د سرور د انتخاب په لیست کې څرګندیږي
ru: Как сервер будет отображаться в списке выбора серверов
th: วิธีที่เซิร์ฟเวอร์จะปรากฏในรายการเลือกเซิร์ฟเวอร์
tk: Serwer saýlama sanawynda serwer nähili görner
tr: Sunucunun sunucu seçim listesinde nasıl görüneceği
vi: Cách máy chủ sẽ xuất hiện trong danh sách chọn máy chủ
zh_cn: 服务器在服务器选择列表中的显示方式
zh_hk: 伺服器在伺服器選擇清單中顯示的名稱

source: Server Nickname
ar: الاسم المستعار للخادم
bn: সার্ভার নিকনেম
es_cu: Apodo del Servidor
fa: نام مستعار سرور
hi: सर्वर उपनाम
ms: Nama Samaran Pelayan
my: ဆာဗာ အမည်ပြောင်
ps: د سرور عرفي نوم
ru: Псевдоним сервера
th: ชื่อเล่นของเซิร์ฟเวอร์
tk: Serwer lakamy
tr: Sunucu Takma Adı
vi: Biệt danh máy chủ
zh_cn: 服务器昵称
zh_hk: 伺服器暱稱

source: Verify Server
ar: التحقق من الخادم
bn: সার্ভার যাচাই করুন
es_cu: Verificar Servidor
fa: تأیید سرور
hi: सर्वर सत्यापित करें
ms: Sahkan Pelayan
my: ဆာဗာကို အတည်ပြုပါ
ps: سرور تایید کړئ
ru: Проверить сервер
th: ยืนยันเซิร์ฟเวอร์
tk: Serweri barla
tr: Sunucuyu Doğrula
vi: Xác minh máy chủ
zh_cn: 验证服务器
zh_hk: 驗證伺服器

# vpn_client_not_setup
source: Please turn on the VPN client.
ar: يرجى تشغيل عميل VPN.
bn: অনুগ্রহ করে ভিপিএন ক্লায়েন্ট চালু করুন।
es_cu: Por favor activa el cliente VPN.
fa: لطفاً کلاینت VPN را روشن کنید.
hi: कृपया VPN क्लाइंट चालू करें।
ms: Sila hidupkan klien VPN.
my: ကျေးဇူးပြု၍ VPN ကလိုင်းယင့်ကို ဖွင့်ပါ။
ps: مهرباني وکړئ د VPN کلاینټ فعال کړئ.
ru: Пожалуйста, включите VPN-клиент.
th: กรุณาเปิดไคลเอนต์ VPN
tk: VPN klient açyň.
tr: Lütfen VPN istemcisini açın.
vi: Vui lòng bật ứng dụng VPN.
zh_cn: 请开启 VPN 客户端。
zh_hk: 請開啟 VPN 用戶端。

source: Continue with
ar: المتابعة مع
bn: এর সাথে চালিয়ে যান
es_cu: Continuar con
fa: ادامه با
hi: इसके साथ जारी रखें
ms: Teruskan dengan
my: ဆက်လုပ်ပါ
ps: دوام ورکړئ د
ru: Продолжить с
th: ดำเนินการต่อด้วย
tk: Bilen dowam et
tr: Şununla devam et
vi: Tiếp tục với
zh_cn: 继续使用
zh_hk: 使用以下方式繼續

source: Join a Private Server
ar: الانضمام إلى خادم خاص
bn: একটি প্রাইভেট সার্ভারে যোগ দিন
es_cu: Unirse a un Servidor Privado
fa: پیوستن به یک سرور خصوصی
hi: निजी सर्वर से जुड़ें
ms: Sertai Pelayan Peribadi
my: ကိုယ်ပိုင်ဆာဗာတစ်ခု ပူးပေါင်းပါ
ps: یو شخصي سرور سره یوځای شئ
ru: Присоединиться к частному серверу
th: เข้าร่วมเซิร์ฟเวอร์ส่วนตัว
tk: Hususy serwere goşul
tr: Özel Bir Sunucuya Katıl
vi: Tham gia máy chủ riêng
zh_cn: 加入私有服务器
zh_hk: 加入私人伺服器

source: Join Private Server
ar: الانضمام إلى خادم خاص
bn: প্রাইভেট সার্ভারে যোগ দিন
es_cu: Unirse a Servidor Privado
fa: پیوستن به سرور خصوصی
hi: निजी सर्वर से जुड़ें
ms: Sertai Pelayan Peribadi
my: ကိုယ်ပိုင်ဆာဗာ ပူးပေါင်းပါ
ps: شخصي سرور سره یوځای شئ
ru: Присоединиться к частному серверу
th: เข้าร่วมเซิร์ฟเวอร์ส่วนตัว
tk: Hususy serwere goşul
tr: Özel Sunucuya Katıl
vi: Tham gia máy chủ riêng
zh_cn: 加入私有服务器
zh_hk: 加入私人伺服器

source: Join Server
ar: الانضمام إلى الخادم
bn: সার্ভারে যোগ দিন
es_cu: Unirse al Servidor
fa: پیوستن به سرور
hi: सर्वर से जुड़ें
ms: Sertai Pelayan
my: ဆာဗာ ပူးပေါင်းပါ
ps: سرور سره یوځای شئ
ru: Присоединиться к серверу
th: เข้าร่วมเซิร์ฟเวอร์
tk: Serwere goşul
tr: Sunucuya Katıl
vi: Tham gia máy chủ
zh_cn: 加入服务器
zh_hk: 加入伺服器

# private_server_usage_message
source: Private server usage is not counted towards your Lantern daily data cap.
ar: استخدام الخادم الخاص لا يُحتسب ضمن حد البيانات اليومي لـ Lantern.
bn: প্রাইভেট সার্ভার ব্যবহার আপনার Lantern দৈনিক ডেটা ক্যাপে গণনা করা হয় না।
es_cu: El uso del servidor privado no se cuenta para tu límite de datos diarios de Lantern.
fa: استفاده از سرور خصوصی در محدودیت داده روزانه Lantern شما محاسبه نمی‌شود.
hi: निजी सर्वर उपयोग आपकी Lantern दैनिक डेटा सीमा में नहीं गिना जाता।
ms: Penggunaan pelayan peribadi tidak dikira dalam had data harian Lantern anda.
my: ကိုယ်ပိုင်ဆာဗာ အသုံးပြုမှုကို သင့် Lantern နေ့စဉ် ဒေတာ ကန့်သတ်ချက်တွင် မပါဝင်ပါ။
ps: د شخصي سرور کارول ستاسو د Lantern ورځنۍ ډیټا کیپ کې نه شمیرل کیږي.
ru: Использование частного сервера не учитывается в вашем ежедневном лимите данных Lantern.
th: การใช้งานเซิร์ฟเวอร์ส่วนตัวไม่นับรวมในขีดจำกัดข้อมูลรายวันของ Lantern
tk: Hususy serwer ulanyşy Lantern gündelik maglumat çägine goşulmaýar.
tr: Özel sunucu kullanımı Lantern günlük veri limitinize sayılmaz.
vi: Lưu lượng sử dụng máy chủ riêng không được tính vào hạn mức dữ liệu hàng ngày của Lantern.
zh_cn: 私有服务器使用量不计入您的蓝灯每日数据上限。
zh_hk: 私人伺服器的使用量不計入你的 Lantern 每日數據限額。

source: Manage Private Servers
ar: إدارة الخوادم الخاصة
bn: প্রাইভেট সার্ভার পরিচালনা করুন
es_cu: Gestionar Servidores Privados
fa: مدیریت سرورهای خصوصی
hi: निजी सर्वर प्रबंधित करें
ms: Urus Pelayan Peribadi
my: ကိုယ်ပိုင်ဆာဗာများ စီမံခန့်ခွဲပါ
ps: شخصي سرورونه مدیریت کړئ
ru: Управление частными серверами
th: จัดการเซิร์ฟเวอร์ส่วนตัว
tk: Hususy serwerleri dolandyr
tr: Özel Sunucuları Yönet
vi: Quản lý máy chủ riêng
zh_cn: 管理私有服务器
zh_hk: 管理私人伺服器

source: My Servers
ar: خوادمي
bn: আমার সার্ভার
es_cu: Mis Servidores
fa: سرورهای من
hi: मेरे सर्वर
ms: Pelayan Saya
my: ကျွန်တော့်ဆာဗာများ
ps: زما سرورونه
ru: Мои серверы
th: เซิร์ฟเวอร์ของฉัน
tk: Meniň serwerlerim
tr: Sunucularım
vi: Máy chủ của tôi
zh_cn: 我的服务器
zh_hk: 我的伺服器

source: Joined Servers
ar: الخوادم المنضم إليها
bn: যোগদান করা সার্ভার
es_cu: Servidores Unidos
fa: سرورهای پیوسته
hi: जुड़े हुए सर्वर
ms: Pelayan yang Disertai
my: ပူးပေါင်းထားသော ဆာဗာများ
ps: یوځای شوي سرورونه
ru: Присоединенные серверы
th: เซิร์ฟเวอร์ที่เข้าร่วม
tk: Goşulan serwerler
tr: Katıldığım Sunucular
vi: Máy chủ đã tham gia
zh_cn: 已加入的服务器
zh_hk: 已加入的伺服器

# access_key_expiration
source: Each access key is unique and expires after 1 day. You can generate a new one anytime.
ar: كل مفتاح وصول فريد وتنتهي صلاحيته بعد يوم واحد. يمكنك إنشاء مفتاح جديد في أي وقت.
bn: প্রতিটি অ্যাক্সেস কী অনন্য এবং ১ দিন পর মেয়াদ শেষ হয়। আপনি যেকোনো সময় একটি নতুন তৈরি করতে পারেন।
es_cu: Cada clave de acceso es única y expira después de 1 día. Puedes generar una nueva en cualquier momento.
fa: هر کلید دسترسی منحصر به فرد است و بعد از ۱ روز منقضی می‌شود. همیشه می‌توانید یک کلید جدید ایجاد کنید.
hi: प्रत्येक एक्सेस की अद्वितीय है और 1 दिन के बाद समाप्त हो जाती है। आप किसी भी समय नई की जनरेट कर सकते हैं।
ms: Setiap kunci akses adalah unik dan tamat tempoh selepas 1 hari. Anda boleh menjana yang baru pada bila-bila masa.
my: အသုံးပြုခွင့်ကုဒ် တစ်ခုစီသည် ထူးခြားပြီး ရက် 1 အကြာ သက်တမ်းကုန်ဆုံးသည်။ သင် အချိန်မရွေး အသစ်တစ်ခု ထုတ်ယူနိုင်သည်။
ps: هر لاسرسي کلید ځانګړی دی او د 1 ورځې وروسته پای ته رسیږي. تاسو کولی شئ هر وخت نوی جوړ کړئ.
ru: Каждый ключ доступа уникален и истекает через 1 день. Вы можете создать новый в любое время.
th: คีย์เข้าถึงแต่ละอันมีลักษณะเฉพาะและหมดอายุหลังจาก 1 วัน คุณสามารถสร้างใหม่ได้ทุกเมื่อ
tk: Her giriş açary üýtgeşik we 1 günden soň möhleti geçýär. Islendik wagta täzesini döredip bilersiňiz.
tr: Her erişim anahtarı benzersizdir ve 1 gün sonra sona erer. İstediğiniz zaman yeni bir tane oluşturabilirsiniz.
vi: Mỗi khóa truy cập là duy nhất và hết hạn sau 1 ngày. Bạn có thể tạo khóa mới bất kỳ lúc nào.
zh_cn: 每个访问密钥都是唯一的,1 天后过期。您可以随时生成新的访问密钥。
zh_hk: 每個存取金鑰都是唯一的,並在 1 天後過期。你可以隨時產生新的金鑰。

source: Share Access Key
ar: مشاركة مفتاح الوصول
bn: অ্যাক্সেস কী শেয়ার করুন
es_cu: Compartir Clave de Acceso
fa: اشتراک‌گذاری کلید دسترسی
hi: एक्सेस की शेयर करें
ms: Kongsi Kunci Akses
my: အသုံးပြုခွင့်ကုဒ် မျှဝေပါ
ps: د لاسرسي کلید شریک کړئ
ru: Поделиться ключом доступа
th: แชร์คีย์เข้าถึง
tk: Giriş açaryny paýlaş
tr: Erişim Anahtarını Paylaş
vi: Chia sẻ khóa truy cập
zh_cn: 分享访问密钥
zh_hk: 分享存取金鑰

source: Rename Server
ar: إعادة تسمية الخادم
bn: সার্ভারের নাম পরিবর্তন করুন
es_cu: Renombrar Servidor
fa: تغییر نام سرور
hi: सर्वर का नाम बदलें
ms: Namakan Semula Pelayan
my: ဆာဗာ အမည်ပြောင်းပါ
ps: سرور بیا نومول
ru: Переименовать сервер
th: เปลี่ยนชื่อเซิร์ฟเวอร์
tk: Serweri täzeden atlandyr
tr: Sunucuyu Yeniden Adlandır
vi: Đổi tên máy chủ
zh_cn: 重命名服务器
zh_hk: 重新命名伺服器

source: Rename
ar: إعادة تسمية
bn: নাম পরিবর্তন করুন
es_cu: Renombrar
fa: تغییر نام
hi: नाम बदलें
ms: Namakan Semula
my: အမည်ပြောင်းပါ
ps: بیا نومول
ru: Переименовать
th: เปลี่ยนชื่อ
tk: Täzeden atlandyr
tr: Yeniden Adlandır
vi: Đổi tên
zh_cn: 重命名
zh_hk: 重新命名

source: Selected Location
ar: الموقع المحدد
bn: নির্বাচিত লোকেশন
es_cu: Ubicación Seleccionada
fa: مکان انتخاب شده
hi: चयनित स्थान
ms: Lokasi Dipilih
my: ရွေးချယ်ထားသော တည်နေရာ
ps: غوره شوی موقعیت
ru: Выбранное расположение
th: ตำแหน่งที่เลือก
tk: Saýlanan ýerleşiş
tr: Seçili Konum
vi: Vị trí đã chọn
zh_cn: 已选择的位置
zh_hk: 已選擇的位置

# remove_server_message
source: Remove %s? This can’t be undone.
ar: إزالة %s؟ سيؤدي هذا إلى إزالته من تطبيقك فقط، ولن يحذف الخادم من مزود الخدمة السحابية الخاص بك.
bn: %s সরাতে চান? এটি শুধুমাত্র আপনার অ্যাপ থেকে সরবে, এটি আপনার ক্লাউড প্রোভাইডার থেকে সার্ভার মুছবে না।
es_cu: ¿Eliminar %s? Esto solo lo eliminará de tu aplicación, no eliminará el servidor de tu proveedor de nube.
fa: حذف %s؟ این کار فقط آن را از برنامه حذف می‌کند، سرور از ارائه‌دهنده ابری شما حذف نمی‌شود.
hi: %s को हटाएं? इससे यह केवल आपके ऐप से हटेगा, यह आपके क्लाउड प्रदाता से सर्वर को डिलीट नहीं करेगा।
ms: Buang %s? Ini hanya akan membuangnya daripada aplikasi anda, ia tidak akan memadamkan pelayan daripada pembekal awan anda.
my: %s ကို ဖယ်ရှားမလား? ဒါက သင့်အက်ပ်မှသာ ဖယ်ရှားမည်ဖြစ်ပြီး၊ သင့် cloud provider မှ ဆာဗာကို ဖျက်မည်မဟုတ်ပါ။
ps: %s لرې کړئ؟ دا یوازې ستاسو د اپلیکیشن څخه به یې لرې کړي، دا به سرور ستاسو د کلاوډ چمتو کوونکي څخه نه ړنګوي.
ru: Удалить %s? Это удалит его только из вашего приложения, но не удалит сервер у вашего облачного провайдера.
th: ลบ %s หรือไม่? การดำเนินการนี้จะลบเซิร์ฟเวอร์ออกจากแอปของคุณเท่านั้น จะไม่ลบเซิร์ฟเวอร์จากผู้ให้บริการคลาวด์ของคุณ
tk: %s aýyrmaly? Bu ony diňe programmaňyzdan aýyrar, bulut üpjün edijiden serweri pozmaz.
tr: %s kaldırılsın mı? Bu sadece uygulamanızdan kaldıracaktır, bulut sağlayıcınızdan sunucuyu silmeyecektir.
vi: Xóa %s? Việc này chỉ xóa nó khỏi ứng dụng của bạn, nó sẽ không xóa máy chủ khỏi nhà cung cấp dịch vụ đám mây của bạn.
zh_cn: 移除 %s?这只会将其从您的应用中移除,不会从您的云服务商处删除服务器。
zh_hk: 移除 %s?這只會將其從你的應用程式中移除,不會從雲端供應商刪除伺服器。

source: Generate Access key
ar: إنشاء مفتاح وصول
bn: অ্যাক্সেস কী তৈরি করুন
es_cu: Generar clave de acceso
fa: ایجاد کلید دسترسی
hi: एक्सेस की जनरेट करें
ms: Jana Kunci Akses
my: အသုံးပြုခွင့်ကုဒ် ထုတ်ပါ
ps: د لاسرسي کلید جوړ کړئ
ru: Создать ключ доступа
th: สร้างคีย์เข้าถึง
tk: Giriş açar döret
tr: Erişim anahtarı oluştur
vi: Tạo khóa truy cập
zh_cn: 生成访问密钥
zh_hk: 產生存取金鑰

source: Invite Name
ar: اسم الدعوة
bn: আমন্ত্রণের নাম
es_cu: Nombre de Invitación
fa: نام دعوت
hi: आमंत्रण नाम
ms: Nama Jemputan
my: ဖိတ်ခေါ်မှု အမည်
ps: د بلنې نوم
ru: Имя приглашения
th: ชื่อคำเชิญ
tk: Çagyryş ady
tr: Davet Adı
vi: Tên lời mời
zh_cn: 邀请名称
zh_hk: 邀請名稱

# trust_server_operator
source: Trust the Server Operator
ar: ثق بمشغل الخادم
bn: সার্ভার অপারেটরকে বিশ্বাস করুন
es_cu: Confía en el Operador del Servidor
fa: اعتماد به اپراتور سرور
hi: सर्वर ऑपरेटर पर भरोसा करें
ms: Percayai Pengendali Pelayan
my: ဆာဗာ အော်ပရေတာကို ယုံကြည်ပါ
ps: د سرور چلوونکي باور وکړئ
ru: Доверяйте оператору сервера
th: ไว้วางใจผู้ดูแลเซิร์ฟเวอร์
tk: Serwer operatoryna ynan
tr: Sunucu Operatörüne Güvenin
vi: Tin tưởng người vận hành máy chủ
zh_cn: 信任服务器运营者
zh_hk: 信任伺服器營運者

# trust_server_operator_message_one
source: Private servers are hosted and operated by individuals or organizations outside of Lantern. When you connect to one, you're trusting the person running it to manage it securely and use it responsibly.
ar: الخوادم الخاصة تستضيفها وتديرها أفراد أو مؤسسات خارج Lantern. عندما تتصل بأحدها، فأنت تثق بالشخص الذي يديرها لإدارتها بأمان واستخدامها بمسؤولية.
bn: প্রাইভেট সার্ভারগুলি Lantern এর বাইরের ব্যক্তি বা সংস্থা দ্বারা হোস্ট এবং পরিচালিত হয়। যখন আপনি একটিতে সংযোগ করেন, আপনি যে ব্যক্তি এটি চালাচ্ছেন তাকে বিশ্বাস করছেন যে তারা এটি নিরাপদে পরিচালনা করবে এবং দায়িত্বশীলভাবে ব্যবহার করবে।
es_cu: Los servidores privados son alojados y operados por individuos u organizaciones fuera de Lantern. Cuando te conectas a uno, estás confiando en la persona que lo opera para gestionarlo de forma segura y usarlo responsablemente.
fa: سرورهای خصوصی توسط افراد یا سازمان‌های خارج از Lantern میزبانی و اداره می‌شوند. وقتی به یکی از آنها متصل می‌شوید، در واقع به اداره‌کننده‌اش اعتماد می‌کنید تا آن را به طور ایمن مدیریت کند و مسئولانه به کار گیرد.
hi: निजी सर्वर Lantern के बाहर व्यक्तियों या संगठनों द्वारा होस्ट और संचालित किए जाते हैं। जब आप किसी से कनेक्ट करते हैं, तो आप उस व्यक्ति पर भरोसा कर रहे हैं जो इसे सुरक्षित रूप से प्रबंधित करे और जिम्मेदारी से उपयोग करे।
ms: Pelayan peribadi dihoskan dan dikendalikan oleh individu atau organisasi di luar Lantern. Apabila anda menyambung ke satu, anda mempercayai orang yang mengendalikannya untuk mengurusnya dengan selamat dan menggunakannya dengan bertanggungjawab.
my: ကိုယ်ပိုင်ဆာဗာများကို Lantern ပြင်ပရှိ တစ်ဦးချင်း သို့မဟုတ် အဖွဲ့အစည်းများက လက်ခံကျင်းပပြီး လည်ပတ်သည်။ သင် တစ်ခုကို ချိတ်ဆက်လျှင်၊ သင်သည် ၎င်းကို လည်ပတ်နေသူကို လုံခြုံစွာ စီမံခန့်ခွဲရန်နှင့် တာဝန်ရှိစွာ အသုံးပြုရန် ယုံကြည်နေခြင်းဖြစ်သည်။
ps: شخصي سرورونه د Lantern څخه بهر د افرادو یا سازمانونو لخوا کوربه او چلول کیږي. کله چې تاسو یو سره وصل کیږئ، تاسو د هغه کس باور کوئ چې یې چلوي ترڅو یې په خوندي ډول مدیریت او په مسؤلیت سره کاروي.
ru: Частные серверы размещаются и управляются отдельными лицами или организациями вне Lantern. Когда вы подключаетесь к одному из них, вы доверяете человеку, который им управляет, обеспечивать его безопасность и использовать ответственно.
th: เซิร์ฟเวอร์ส่วนตัวถูกโฮสต์และดูแลโดยบุคคลหรือองค์กรนอกเหนือจาก Lantern เมื่อคุณเชื่อมต่อกับเซิร์ฟเวอร์หนึ่ง คุณกำลังไว้วางใจผู้ที่ดูแลเซิร์ฟเวอร์นั้นให้จัดการอย่างปลอดภัยและใช้งานอย่างรับผิดชอบ
tk: Hususy serwerler Lantern-dan daşarda adamlar ýa-da guramalara eýelik edýär we dolandyrylýar. Birine birikdirilýänçäňizde, howpsuzlyk we jogapkärçilik bilen ony dolandyrýan adama ynanyp bilýärsiňiz.
tr: Özel sunucular, Lantern dışındaki bireyler veya kuruluşlar tarafından barındırılır ve işletilir. Birine bağlandığınızda, onu çalıştıran kişiye güvenli bir şekilde yönetmesi ve sorumlu bir şekilde kullanması için güveniyorsunuz.
vi: Máy chủ riêng được lưu trữ và vận hành bởi cá nhân hoặc tổ chức bên ngoài Lantern. Khi bạn kết nối với một máy chủ, bạn đang tin tưởng người vận hành nó để quản lý an toàn và sử dụng có trách nhiệm.
zh_cn: 私有服务器由蓝灯以外的个人或组织托管和运营。当您连接到私有服务器时,您需要信任运行它的人会安全管理并负责任地使用它。
zh_hk: 私人伺服器由 Lantern 以外的個人或組織託管和營運。當你連線至私人伺服器時,你信任營運者能安全地管理並負責任地使用它。

# trust_server_operator_message_two
source: Lantern does not manage or monitor private servers. Make sure you know and trust the server operator before joining one.
ar: لا تدير Lantern الخوادم الخاصة أو تراقبها. تأكد من أنك تعرف وتثق بمشغل الخادم قبل الانضمام إلى أحدها.
bn: Lantern প্রাইভেট সার্ভার পরিচালনা বা নজরদারি করে না। একটিতে যোগদান করার আগে নিশ্চিত করুন যে আপনি সার্ভার অপারেটরকে জানেন এবং বিশ্বাস করেন।
es_cu: Lantern no gestiona ni monitorea los servidores privados. Asegúrate de conocer y confiar en el operador del servidor antes de unirte a uno.
fa: Lantern سرورهای خصوصی را مدیریت یا نظارت نمی‌کند. پیش از پیوستن به آن، مطمئن شوید که اداره‌کننده سرور را می‌شناسید و به او اعتماد دارید.
hi: Lantern निजी सर्वर का प्रबंधन या निगरानी नहीं करता। किसी में शामिल होने से पहले सुनिश्चित करें कि आप सर्वर ऑपरेटर को जानते और उस पर भरोसा करते हैं।
ms: Lantern tidak mengurus atau memantau pelayan peribadi. Pastikan anda mengenali dan mempercayai pengendali pelayan sebelum menyertainya.
my: Lantern သည် ကိုယ်ပိုင်ဆာဗာများကို စီမံခန့်ခွဲ သို့မဟုတ် စောင့်ကြည့်မှုမပြုပါ။ တစ်ခုကို ပူးပေါင်းမီ ဆာဗာ အော်ပရေတာကို သင်သိပြီး ယုံကြည်ကြောင်း သေချာပါစေ။
ps: Lantern شخصي سرورونه نه مدیریت کوي او نه څاري. ډاډ ترلاسه کړئ چې تاسو د سرور چلوونکی پیژنئ او باور یې کوئ مخکې له دې چې یو سره یوځای شئ.
ru: Lantern не управляет и не контролирует частные серверы. Убедитесь, что вы знаете и доверяете оператору сервера, прежде чем присоединиться к нему.
th: Lantern ไม่ได้จัดการหรือติดตามเซิร์ฟเวอร์ส่วนตัว ตรวจสอบให้แน่ใจว่าคุณรู้จักและไว้วางใจผู้ดูแลเซิร์ฟเวอร์ก่อนเข้าร่วม
tk: Lantern hususy serwerleri dolandyrmaýar ýa-da gözegçilik etmeýär. Goşulmazdan öň serwer operatoryny bilýändigiňize we ynanýandygyňyza göz ýetiriň.
tr: Lantern özel sunucuları yönetmez veya izlemez. Bir sunucuya katılmadan önce sunucu operatörünü tanıdığınızdan ve güvendiğinizden emin olun.
vi: Lantern không quản lý hoặc giám sát máy chủ riêng. Hãy chắc chắn bạn biết và tin tưởng người vận hành máy chủ trước khi tham gia.
zh_cn: 蓝灯不管理或监控私有服务器。在加入之前,请确保您了解并信任服务器运营者。
zh_hk: Lantern 不管理或監控私人伺服器。在加入之前,請確保你認識並信任伺服器營運者。

# trust_server_operator_message_three
source: If you're unsure who runs the server or how it's configured, we recommend using one of the default Lantern servers available in your server list
ar: إذا لم تكن متأكدًا من يدير الخادم أو كيف تم تكوينه، نوصي باستخدام أحد خوادم Lantern الافتراضية المتاحة في قائمة الخوادم لديك
bn: আপনি যদি নিশ্চিত না হন কে সার্ভার চালায় বা এটি কীভাবে কনফিগার করা হয়েছে, আমরা আপনার সার্ভার তালিকায় উপলব্ধ ডিফল্ট Lantern সার্ভার ব্যবহার করার পরামর্শ দিই
es_cu: Si no estás seguro de quién opera el servidor o cómo está configurado, te recomendamos usar uno de los servidores Lantern predeterminados disponibles en tu lista de servidores
fa: اگر مطمئن نیستید چه کسی سرور را اداره می‌کند یا چگونه پیکربندی شده است، توصیه می‌کنیم از یکی از سرورهای پیش‌فرض Lantern موجود در فهرست استفاده کنید
hi: यदि आप अनिश्चित हैं कि सर्वर कौन चलाता है या यह कैसे कॉन्फ़िगर किया गया है, तो हम अनुशंसा करते हैं कि आप अपनी सर्वर सूची में उपलब्ध डिफ़ॉल्ट Lantern सर्वर में से किसी एक का उपयोग करें
ms: Jika anda tidak pasti siapa yang mengendalikan pelayan atau bagaimana ia dikonfigurasi, kami mengesyorkan menggunakan salah satu pelayan Lantern lalai yang tersedia dalam senarai pelayan anda
my: ဆာဗာကို မည်သူလည်ပတ်သည် သို့မဟုတ် ဘယ်လို စီစဉ်ထားသည်ကို မသေချာလျှင်၊ သင့်ဆာဗာစာရင်းတွင် ရနိုင်သော မူလ Lantern ဆာဗာများကို အသုံးပြုရန် ကျွန်ုပ်တို့ အကြံပြုပါသည်
ps: که تاسو ډاډه نه یاست چې څوک سرور چلوي یا څنګه یې تنظیم شوی، موږ وړاندیز کوو چې د Lantern تلواله سرورونه وکاروئ چې ستاسو د سرور په لیست کې شته دي
ru: Если вы не уверены, кто управляет сервером или как он настроен, мы рекомендуем использовать один из стандартных серверов Lantern, доступных в вашем списке серверов
th: หากคุณไม่แน่ใจว่าใครเป็นผู้ดูแลเซิร์ฟเวอร์หรือมีการกำหนดค่าอย่างไร เราแนะนำให้ใช้เซิร์ฟเวอร์ Lantern เริ่มต้นที่มีอยู่ในรายการเซิร์ฟเวอร์ของคุณ
tk: Serwer kim dolandyrýandygyny ýa-da nädip düzülendigini bilmeýän bolsaňyz, serwer sanawyňyzda elýeterli deslapky Lantern serwerlerini ulanmagyňyzy maslahat berýäris
tr: Sunucuyu kimin çalıştırdığından veya nasıl yapılandırıldığından emin değilseniz, sunucu listenizde bulunan varsayılan Lantern sunucularından birini kullanmanızı öneririz
vi: Nếu bạn không chắc chắn ai vận hành máy chủ hoặc nó được cấu hình như thế nào, chúng tôi khuyên bạn nên sử dụng một trong các máy chủ Lantern mặc định có sẵn trong danh sách máy chủ của bạn
zh_cn: 如果您不确定谁在运行服务器或服务器是如何配置的,我们建议使用服务器列表中的默认蓝灯服务器
zh_hk: 如果你不確定是誰在營運伺服器或伺服器的配置方式,我們建議使用伺服器清單中的預設 Lantern 伺服器

# invalid_server_details
source: Invalid server details. Please check the access key and try again.
ar: تفاصيل خادم غير صالحة. يرجى التحقق من مفتاح الوصول والمحاولة مرة أخرى.
bn: অবৈধ সার্ভার বিস্তারিত। অনুগ্রহ করে অ্যাক্সেস কী চেক করুন এবং আবার চেষ্টা করুন।
es_cu: Detalles del servidor inválidos. Por favor verifica la clave de acceso e intenta de nuevo.
fa: جزئیات سرور نامعتبر. لطفاً کلید دسترسی را بررسی کرده و دوباره امتحان کنید.
hi: अमान्य सर्वर विवरण। कृपया एक्सेस की जांचें और फिर से प्रयास करें।
ms: Butiran pelayan tidak sah. Sila semak kunci akses dan cuba lagi.
my: မမှန်ကန်သော ဆာဗာ အသေးစိတ်များ။ ကျေးဇူးပြု၍ အသုံးပြုခွင့်ကုဒ်ကို စစ်ဆေးပြီး ထပ်စမ်းကြည့်ပါ။
ps: ناسم د سرور جزئیات. مهرباني وکړئ د لاسرسي کلید وګورئ او بیا هڅه وکړئ.
ru: Неверные данные сервера. Проверьте ключ доступа и попробуйте снова.
th: รายละเอียดเซิร์ฟเวอร์ไม่ถูกต้อง กรุณาตรวจสอบคีย์เข้าถึงและลองอีกครั้ง
tk: Nädogry serwer maglumatlary. Giriş açary barlaň we täzeden synanyň.
tr: Geçersiz sunucu detayları. Lütfen erişim anahtarını kontrol edip tekrar deneyin.
vi: Thông tin máy chủ không hợp lệ. Vui lòng kiểm tra khóa truy cập và thử lại.
zh_cn: 无效的服务器详情。请检查访问密钥并重试。
zh_hk: 無效的伺服器資訊。請檢查存取金鑰後重試。

# join_my_private_server
source: Join My Lantern Private Server
ar: انضم إلى خادم Lantern الخاص بي
bn: আমার Lantern প্রাইভেট সার্ভারে যোগ দিন
es_cu: Únete a mi Servidor Privado de Lantern
fa: به سرور خصوصی Lantern من بپیوندید
hi: मेरे Lantern निजी सर्वर से जुड़ें
ms: Sertai Pelayan Peribadi Lantern Saya
my: ကျွန်တော့် Lantern ကိုယ်ပိုင်ဆာဗာ ပူးပေါင်းပါ
ps: زما د Lantern شخصي سرور سره یوځای شئ
ru: Присоединиться к моему частному серверу Lantern
th: เข้าร่วมเซิร์ฟเวอร์ส่วนตัว Lantern ของฉัน
tk: Meniň Lantern hususy serwerime goşul
tr: Lantern Özel Sunucuma Katıl
vi: Tham gia máy chủ riêng Lantern của tôi
zh_cn: 加入我的蓝灯私有服务器
zh_hk: 加入我的 Lantern 私人伺服器

# your_server
source: Your Servers:
ar: خوادمك:
bn: আপনার সার্ভার:
es_cu: Tus Servidores:
fa: سرورهای شما:
hi: आपके सर्वर:
ms: Pelayan Anda:
my: သင့်ဆာဗာများ-
ps: ستاسو سرورونه:
ru: Ваши серверы:
th: เซิร์ฟเวอร์ของคุณ:
tk: Siziň serwerleňiz:
tr: Sunucularınız:
vi: Máy chủ của bạn:
zh_cn: 您的服务器:
zh_hk: 你的伺服器:

# no_private_server_setup_yet
source: You haven't set up a private server yet. Click the button below to get started.
ar: لم تقم بإعداد خادم خاص بعد. انقر على الزر أدناه للبدء.
bn: আপনি এখনও একটি প্রাইভেট সার্ভার সেটআপ করেননি। শুরু করতে নিচের বাটনে ক্লিক করুন।
es_cu: Aún no has configurado un servidor privado. Haz clic en el botón de abajo para comenzar.
fa: شما هنوز سرور خصوصی راه‌اندازی نکرده‌اید. برای شروع روی دکمه زیر کلیک کنید.
hi: आपने अभी तक कोई निजी सर्वर सेट अप नहीं किया है। शुरू करने के लिए नीचे बटन पर क्लिक करें।
ms: Anda belum menyediakan pelayan peribadi lagi. Klik butang di bawah untuk bermula.
my: သင်သည် ကိုယ်ပိုင်ဆာဗာတစ်ခု မစနစ်ထည့်ရသေးပါ။ စတင်ရန် အောက်ရှိခလုတ်ကို နှိပ်ပါ။
ps: تاسو لا تر اوسه یو شخصي سرور تنظیم کړی نه دی. د پیل لپاره لاندې تڼۍ کلیک کړئ.
ru: Вы еще не настроили частный сервер. Нажмите кнопку ниже, чтобы начать.
th: คุณยังไม่ได้ตั้งค่าเซิร์ฟเวอร์ส่วนตัว คลิกปุ่มด้านล่างเพื่อเริ่มต้น
tk: Entek hususy serwer gurmadyňyz. Başlamak üçin aşakdaky düwmä basyň.
tr: Henüz bir özel sunucu kurmadınız. Başlamak için aşağıdaki düğmeye tıklayın.
vi: Bạn chưa thiết lập máy chủ riêng. Nhấn vào nút bên dưới để bắt đầu.
zh_cn: 您还没有设置私有服务器。点击下方按钮开始设置。
zh_hk: 你尚未設定私人伺服器。點擊下方按鈕開始設定。

source: Connect
ar: اتصال
bn: সংযোগ করুন
es_cu: Conectar
fa: اتصال
hi: कनेक्ट करें
ms: Sambung
my: ချိတ်ဆက်ပါ
ps: وصل کړئ
ru: Подключиться
th: เชื่อมต่อ
tk: Birikdir
tr: Bağlan
vi: Kết nối
zh_cn: 连接
zh_hk: 連線

source: Disconnect
ar: قطع الاتصال
bn: সংযোগ বিচ্ছিন্ন করুন
es_cu: Desconectar
fa: قطع اتصال
hi: डिस्कनेक्ट करें
ms: Putuskan
my: ချိတ်ဆက်မှု ဖြုတ်ပါ
ps: قطع کړئ
ru: Отключиться
th: ยกเลิกการเชื่อมต่อ
tk: Aýyr
tr: Bağlantıyı Kes
vi: Ngắt kết nối
zh_cn: 断开连接
zh_hk: 中斷連線

source: Show
ar: إظهار
bn: দেখান
es_cu: Mostrar
fa: نمایش
hi: दिखाएं
ms: Tunjuk
my: ပြပါ
ps: ښکاره کړئ
ru: Показать
th: แสดง
tk: Görkez
tr: Göster
vi: Hiển thị
zh_cn: 显示
zh_hk: 顯示

# status_on
source: Connected
ar: متصل
bn: সংযুক্ত
es_cu: Conectado
fa: متصل
hi: कनेक्टेड
ms: Disambungkan
my: ချိတ်ဆက်ထားသည်
ps: وصل شوی
ru: Подключено
th: เชื่อมต่อแล้ว
tk: Birikdirildi
tr: Bağlı
vi: Đã kết nối
zh_cn: 已连接
zh_hk: 已連線

# status_off
source: Disconnected
ar: غير متصل
bn: সংযোগ বিচ্ছিন্ন
es_cu: Desconectado
fa: قطع شده
hi: डिस्कनेक्टेड
ms: Diputuskan
my: ချိတ်ဆက်မှု ဖြုတ်ထားသည်
ps: قطع شوی
ru: Отключено
th: ยกเลิกการเชื่อมต่อแล้ว
tk: Aýryldy
tr: Bağlantı Kesildi
vi: Đã ngắt kết nối
zh_cn: 已断开
zh_hk: 已中斷連線
