jQuery.webshims.validityMessages.ar = {
    "typeMismatch": {
        "email": "أدخِل رجاءً البريد الإلكتروني.",
        "url": "أدخِل رجاءً عنوان الموقع.",
        "number": "قيمة غير صحيحة",
        "date": "قيمة غير صحيحة",
        "time": "قيمة غير صحيحة",
        "range": "قيمة غير صحيحة",
        "datetime-local": "قيمة غير صحيحة"
    },
    "tooLong": "قيمة غير صحيحة",
    "patternMismatch": "اتبع رجاءً التنسيق المطلوب: {%title}.",
    "valueMissing": {
        "defaultMessage": "رجاءً املأ هذا الحقل.",
        "checkbox": "رجاءً علّم هذا المربع إن أردت المتابعة.",
        "select": "رجاءً اختر عنصرًا من اللائحة.",
        "radio": "رجاءً اختر أحد هذه الخيارات."
    },
    "rangeUnderflow": {
        "defaultMessage": "يجب أن تكون القيمة أكبر من أو تساوي {%min}.",
        "date": "يجب أن تكون القيمة أكبر من أو تساوي {%min}.",
        "time": "يجب أن تكون القيمة أكبر من أو تساوي {%min}.",
        "datetime-local": "يجب أن تكون القيمة أكبر من أو تساوي {%min}."
    },
    "rangeOverflow": {
        "defaultMessage": "يجب أن تكون القيمة أقل من أو تساوي {%max}.",
        "date": "يجب أن تكون القيمة أقل من أو تساوي {%max}.",
        "time": "يجب أن تكون القيمة أقل من أو تساوي {%max}.",
        "datetime-local": "يجب أن تكون القيمة أقل من أو تساوي {%max}."
    },
    "stepMismatch": "قيمة غير صحيحة"
};
