jQuery.webshims.validityMessages.ru = {
	"typeMismatch": {
		"email": "Пожалуйста, введите адрес e-mail.",
		"url": "Пожалуйста, введите адрес веб-страницы (URL).",
		"number": "Пожалуйста, введите число.",
		"date": "Пожалуйста, введите дату.",
		"time": "Пожалуйста, введите время.",
		"range": "Введено неправильное значение.",
		"datetime-local": "Пожалуйста, введите дату и время."
	},
	"tooLong": "Пожалуйста, введите не более {%maxlength} символов(а). Вы ввели {%valueLen}.",
	"patternMismatch": "Неправильное значение. {%title}",
	"valueMissing": {
		"defaultMessage": "Пожалуйста, заполните это поле.",
		"checkbox": "Пожалуйста, включите этот переключатель, если хотите продолжить.",
		"select": "Пожалуйста, выберите значение.",
		"radio": "Пожалуйста, выберите значение."
	},
	"rangeUnderflow": {
		"defaultMessage": "Значение должно быть больше или равно {%min}.",
		"date": "Дата должна быть {%min} или более поздняя.",
		"time": "Время должно быть {%min} или более позднее.",
		"datetime-local": "Значение должно быть {%min} или более позднее."
	},
	"rangeOverflow": {
		"defaultMessage": "Значение должно быть меньше или равно {%max}.",
		"date": "Дата должна быть {%max} или более ранняя.",
		"time": "Вермя должно быть {%max} или более раннее.",
		"datetime-local": "Значение должно быть {%max} или более раннее."
	},
	"stepMismatch": "Неправильное значение."
};